Repository: vjrj/tails
Catalog: wiki/src/doc/first_steps/media.*.po
Languages: fr, pt

source: [[!meta title="Choosing between burning a DVD and installing onto a USB stick or SD card"]]
fr: [[!meta title="Choisir entre graver un DVD et installer sur une clé USB ou une carte SD"]]
pt: [[!meta title="Escolhendo entre gravar um DVD e instalar em uma memória USB ou cartão SD"]]

source: DVDs are read-only so your Tails can't be altered by a virus or an attacker.
fr: Les DVD sont en "lecture seule" ; votre Tails ne peut donc pas être modifié par un virus ou un attaquant.
pt: DVDs são somente-leitura de modo que o Tails não pode ser alterado por um vírus ou por um atacante.

source: DVDs are cheap but you will need to burn a new DVD each time you update your version of Tails.
fr: Les DVD sont bon marché, mais vous devrez en graver un nouveau à chaque fois que vous mettrez à jour votre version de Tails.
pt: DVDs são baratos mas você terá que gravar um novo DVD toda vez que atualizar sua versão do Tails.

source: You could also use a DVD-RW but those are not read-only.
fr: Vous pouvez également utiliser un DVD réinscriptible, mais ceux-ci ne sont pas en lecture seule (et ne sont donc pas protégés contre les modifications de données).
pt: Você também poderia usar um DVD-RW, mas estes não são somente-leitura.

source: USB stick or SD card
fr: Clé USB ou carte SD
pt: Memória USB ou cartão SD

source: An attacker with physical access to your device or through a virus could alter your Tails.
fr: Un attaquant peut avoir un accès physique à votre périphérique, ou au travers d'un virus, modifier votre Tails.
pt: Um atacante com acesso físico ao seu dispositivo ou através de um vírus poderia alterar seu Tails.

source: USB sticks and SD cards can be upgraded to future versions of Tails.
fr: Les clefs USB et les cartes SD peuvent être réutilisées pour les différentes versions de Tails.
pt: Memórias USB e cartões SD podem ser atualizados para versões futuras do Tails.

source: You can use [[persistence|doc/first_steps/persistence]] and store your documents and configuration in an encrypted persistent volume on the same device.
fr: Vous pouvez utiliser la [[persistance|doc/first_steps/persistence]] pour stocker documents et configuration dans un volume persistant chiffré sur le même pérphérique.
pt: Você pode usar [[persistência|doc/first_steps/persistence]] e armazenar seus documentos e configurações em um volume persistente criptografado no mesmo dispositivo.

source: USB sticks and SD cards are smaller to fit in your pocket.
fr: Les clefs USB et cartes SD sont plus facilement transportables.
pt: Memórias USB e cartões SD são menores e cabem no seu bolso.

source: Some older computers might not be able to start from a USB stick or SD card.
fr: Les vieux ordinateurs ne peuvent pas toujours démarrer sur une clef USB ou sur une carte SD.
pt: Computadores mais antigos podem não ser capazes de serem iniciados a partir de uma memória USB ou cartão SD.

source: Some USB sticks, SD cards, or SD card adapters have a read-only switch that can prevent your Tails from being altered, but be aware that this protection is most probably not ensured by the device itself: do not rely on untrusted computers to respect this feature.
fr: Certaines clés USB, cartes SD et adaptateurs pour cartes SD ont un petit interrupteur permettant d'interdire l'accès en écriture et ainsi de protéger votre Tails d'une éventuelle modification. Notez cependant que cette protection n'est probablement pas garantie par la carte SD elle-même : ne comptez pas sur un ordinateur dans lequel vous n'avez pas confiance pour la respecter.
pt: Algumas memórias USB, cartões SD e adaptadores de cartão SD possuem uma chave que pode evitar seu Tails de ser alterado, mas fique atento/a pois esta proteção muito provavelmente não é garantida pelo dispositivo em si: não confie que computadores não confiáveis respeitarão esta funcionalidade.
