Repository: vjrj/tails
Catalog: wiki/src/doc/first_steps/persistence.*.po
Languages: fr

source: [[!meta title="Encrypted persistence"]]
fr: [[!meta title="Persistance chiffrée"]]

source: If you start Tails from a USB stick or SD card, you can create a persistent volume in the free space left on the device by <span class="application">Tails Installer</span>. The files in the persistent volume are saved encrypted and remain available across separate working sessions.
fr: Si vous avez démarré Tails depuis une clé USB, vous pouvez créer un volume persistant sur l'espace libre de la clé avec l'<span class="application">Installeur de Tails</span>. Les données contenues dans le volume persistant sont sauvegardées de manière chiffrée et restent disponibles d'une session de travail à l'autre.

source: <p>It is only possible to create a persistent volume if the device, USB stick or SD card, was installed using <span class="application">[[Tails Installer|doc/first_steps/installation]]</span>.</p>
fr: <p>Il est uniquement possible de créer un volume persistant sur le périphérique, clé USB ou carte SD a été installé via l'<span class="application">[[Installeur de Tails|doc/first_steps/installation]]</span>.</p>

source: <p>This requires a USB stick or SD card of <strong>at least 4 GB</strong>.</p>
fr: <p>Cela requière une clé USB ou une carte SD d'<strong>au moins 4 Go</strong>.</p>

source: You can use this persistent volume to store different kinds of files:
fr: Vous pouvez utiliser le volume persistant pour stocker différents types de fichiers :

source: your personal files and working documents
fr: vos données personnelles et vos documents de travail

source: the software packages that you download and install in Tails
fr: les paquets logiciels que vous téléchargez et installez dans Tails

source: the configuration of the programs you use
fr: la configuration des logiciels que vous utilisez

source: your encryption keys
fr: vos clés de chiffrement

source: The persistent volume is an encrypted partition protected by a passphrase.
fr: Le volume persistant est une partition chiffrée protégée par une phrase de passe.

source: Once the persistent volume is created, you can choose to activate it or not each time you start Tails.
fr: Une fois le volume persistant créé, vous pouvez choisir de l'activer, ou non, à chaque démarrage de Tails.

source: [[!inline pages="doc/first_steps/persistence.caution" raw="yes"]]
fr: [[!inline pages="doc/first_steps/persistence.caution.fr" raw="yes"]]

source: How to use the persistent volume =================================
fr: Comment utiliser le volume persistant =================================

source: [[Warnings about persistence|first_steps/persistence/warnings]]
fr: [[Avertissement à propos de la persistance|first_steps/persistence/warnings]]

source: [[Create & configure the persistent volume|first_steps/persistence/configure]]
fr: [[Créer et configurer le volume persistant|first_steps/persistence/configure]]

source: [[Enable & use the persistent volume|first_steps/persistence/use]]
fr: [[Activer et utiliser le volume persistant|first_steps/persistence/use]]

source: [[Change the passphrase of the persistent volume|first_steps/persistence/change_passphrase]]
fr: [[Changer la phrase de passe du volume persistant|first_steps/persistence/change_passphrase]]

source: [[Manually copy your persistent data to a new device|first_steps/persistence/copy]]
fr: [[Copier manuellement vos données persistantes vers un nouveau périphérique|first_steps/persistence/copy]]

source: [[Delete the persistent volume|first_steps/persistence/delete]]
fr: [[Supprimer le volume persistant|first_steps/persistence/delete]]
