Repository: vjrj/tails
Catalog: wiki/src/doc/first_steps/shutdown.*.po
Languages: de

source: [[!meta title="Shutting down Tails"]]
de: [[!meta title="Tails herunterfahren"]]

source: There are several ways of shutting down Tails:
de: Es gibt mehrere Möglichkeiten, Tails herunterzufahren:

source: By clicking on the [[system shutdown icon|introduction_to_gnome_and_the_tails_desktop#shutdown]] located in the upper right corner of the notification area and choosing <span class="guimenuitem">Shutdown Immediately</span> or <span class="guimenuitem">Reboot Immediately</span>.
de: Indem man das [[Herunterfahren-Icon|introduction_to_gnome_and_the_tails_desktop#shutdown]], welches sich in der oberen rechten Ecke befindet, anklickt und <span class="guimenuitem">Sofort Herunterfahren</span> oder <span class="guimenuitem">Sofort Neustarten</span> auswählt.

source: - By pressing the power button of the computer.
de: - Indem man den Einschaltknopf des Computers betätigt

source: - By removing physically the device Tails is running from.
de: - Indem man das physikalische Speichermedium entfernt, von dem Tails gestartet wurde

source: <p>This method might in rare occasions break the file system of your persistent volume. <strong>Use this method only in case of emergency.</strong></p>
de: <p>Diese Methode kann in einigen raren Fällen das Dateisystem Ihres beständigen Datenträgers beschädigen. <strong>Benutzen Sie diese Methode nur im Notfall.</strong></p>

source: <p>Using the [[<span class="guilabel">read-only</span> option|persistence/use]] of the persistent volume prevents this problem.</p>
de: <p>Das Aktivieren der [[<span class="guilabel">Nur-lesen</span> Option|persistence/use]] des beständigen Datenträgers vermeidet dieses Problem.</p>

source: <p>If you cannot enable persistence after using this method, you should be able to recover most of your data by doing a [[file system check on the persistent volume|persistence/check_file_system]].</p>
de: <p>Sollten Sie den beständigen Datenträger nicht mehr aktivieren können, nachdem Sie diese Methode benutzt haben. können Sie Ihre Daten sehr wahrscheinlich wiederherstellen, indem Sie das [[Dateisystem des beständigen Datenträgers überprüfen|persistence/check_the_file_system]].

source: This method does not work [[with DVD|support/known_issues#index11h2]], see [[!tails_ticket 5447]].
de: Diese Methode funktioniert nicht [[mit DVDs|support/known_issues#index11h2]], siehe [[!tails_ticket 5447]].

source: This method does not work [[after using the <span class="application">Tails Installer</span>|support/known_issues#index10h2]], see [[!tails_ticket 5677]].
de: Diese Methode funktioniert nicht, [[nachdem der <span class="application">Tails- Installer</span>|support/known_issues#index10h2]] benutzt wurde, siehe [[!tails_ticket 5677]].

source: While shutting down, the data stored in <span class="definition">[[!wikipedia Random-access_memory desc="RAM"]]</span> is erased to protect from [[cold boot attacks|doc/advanced_topics/cold_boot_attacks]].
de: Während des Herunterfahrens werden die Daten, die im <span class="definition">[[!wikipedia_de Random-Access_Memory desc="RAM"]]</span> gespeichert sind, gelöscht, um [[Kaltstartattacken|doc/advanced_topics/cold_boot_attacks]] zu verhindern.
