Repository: vjrj/tails
Catalog: wiki/src/doc/first_steps/upgrade.*.po
Languages: pt

source: [[!meta title="Upgrading a Tails USB stick or SD card"]]
pt: [[!meta title="Atualizando uma memória USB ou cartão SD com Tails"]]

source: Tails includes an automatic mechanism to upgrade a USB stick or a SD card to newer versions. When it is not possible to do this **automatic upgrade**, it is possible to do a **manual upgrade**. This page describes both techniques.
pt: Tails inclui um mecanismo automático para atualizar uma memória USB ou um cartão SD para versões mais novas. Quando não é possível fazer esta **atualização automática**, é possível fazer uma **atualização manual**. Esta página descreve ambas as técnicas.

source: Our upgrades always fix important security issues so it is important to do them as soon as possible.
pt: Nossas atualizações sempre corrigem falhas de segurança importantes, então é importante fazê-las o mais rápido possível.

source: Both techniques only work if the upgraded device, USB stick or SD card, was installed using <span class="application">Tails Installer</span>. **The persistent storage on the device will be preserved.**
pt: A técnica a seguir somente funciona se o dispositivo a ser atualizado, seja uma memória USB ou um cartão SD, tiver sido instalado usando o <span class="application">Tails Installer</span>. **O armazenamento persistente no dispositivo será preservado.**

source: If you use Tails from a DVD or if your Tails device was not installed using <span class="application">Tails Installer</span>, it is not possible to upgrade and you need to follow our [[installation instructions|download#media]] again with the new ISO image.
pt: Se você usa Tails a partir de um DVD ou se seu dispositivo com Tails não foi instalado usando o <span class="application">Tails Installer</span>, então não é possível atualizar e você terá de seguir as [[instruções de instalação|download#media]] novamente, usando a nova imagem ISO.

source: <a name="automatic"></a>
pt: <a id="automatic"></a>

source: Automatic upgrade using <span class="application">Tails Upgrader</span>
pt: Atualização automática usando o <span class="application">Tails Upgrader</span>

source: After starting Tails and connecting to Tor, <span class="application">Tails Upgrader</span> automatically checks if upgrades are available and then proposes you to upgrade your device. The upgrades are checked for and downloaded through Tor.
pt: Depois de inicializar o Tails e conectar ao Tor, o <span class="application">Tails Upgrader</span> verifica automaticamente se atualizações estão disponíveis e então propõe que você atualize seu dispositivo. As atualizações são verificadas e baixadas através do Tor.

source: The advantages of this technique are the following:
pt: As vantagens desta técnica são as seguintes:

source: You only need a single Tails device. The upgrade is done on the fly from a running Tails. After upgrading, you can restart and use the new version.
pt: Você só precisa de um dispositivo com Tails. A atualização é feita "on the fly", a partir de um Tails sendo executado. Após atualizar, você pode reiniciar e usar a nova versão.

source: The upgrade is much smaller to download than a full ISO image.
pt: A atualização é muito menor para baixar do que uma imagem ISO completa.

source: The upgrade mechanism includes cryptographic verification of the upgrade. You don't have to verify the ISO image yourself anymore.
pt: O mecanismo de atualização inclui verificação criptográfica da atualização. Você não tem mais que verificar a imagem ISO você mesmo/a.

source: Requirements:
pt: Requisitos:

source: A Tails device, USB stick or SD card, installed using <span class="application">Tails Installer</span>.
pt: Um dispositivo com Tails, memória USB ou cartão SD, instalados usando o <span class="application">Tails Installer</span>.

source: An Internet connection.
pt: Uma conexão de Internet.

source: After connecting to Tor, if an upgrade is available, a dialog box appears and proposes you to upgrade your device.
pt: Após conectar ao Tor, se uma atualização estiver disponível, uma caixa de diálogo vai aparecer e propor a você que atualize seu dispositivo.

source: <ul> <li>It is recommended to close all the open applications during the upgrade.</li> <li>Downloading the upgrade might take a long time, from several minutes to a few hours.</li> <li>The networking will be disabled after downloading the upgrade.</li> </ul>
pt: <ul> <li>É recomendável fechar todas as aplicações abertas durante a atualização.</li> <li>Baixar a atualização pode demorar um pouco, de vários minutos a algumas horas.</li> <li>A rede será desabilitada depois que a atualização for baixada.</li> </ul>

source: If you decide to do the upgrade, click on <span class="guilabel">Upgrade now</span>, and follow the assistant through the upgrade process.
pt: Se você decidir fazer a atualização, clique em <span class="guilabel">Atualizar agora</span>, e siga o assistente pelo processo de atualização.

source: [[!inline pages="doc/first_steps/upgrade.release_notes" raw="yes"]]
pt: [[!inline pages="doc/first_steps/upgrade.release_notes.pt" raw="yes"]]

source: If an error occurs, the assistant proposes you to read one of the following pages:
pt: Se algum erro ocorrer, o assistente proporá que você leia uma das seguintes páginas:

source: If an error occurs while checking for available upgrades:<br/> [[file:///usr/share/doc/tails/website/doc/upgrade/error/check.en.html|upgrade/error/check]]
pt: Se um erro ocorreu ao verificar as atualizações disponíveis:<br/> [[file:///usr/share/doc/tails/website/doc/upgrade/error/check.en.html|upgrade/error/check]]

source: If an error occurs while download the upgrade:<br/> [[file:///usr/share/doc/tails/website/doc/upgrade/error/download.en.html|upgrade/error/download]]
pt: Se um erro ocorreu ao baixar a atualização:<br/> [[file:///usr/share/doc/tails/website/doc/upgrade/error/download.en.html|upgrade/error/download]]

source: If an error occurs while installing the upgrade:<br/> [[file:///usr/share/doc/tails/website/doc/upgrade/error/install.en.html|upgrade/error/install]]
pt: Se um erro ocorreu ao instalar a atualização:<br/> [[file:///usr/share/doc/tails/website/doc/upgrade/error/install.en.html|upgrade/error/install]]

source: <a name="manual"></a>
pt: <a id="manual"></a>

source: Manual upgrade using <span class="application">Tails Installer</span>
pt: Atualização manual usando o <span class="application">Tails Installer</span>

source: They might also contain <strong>special instructions for upgrading</strong>.
pt: Elas também podem contar <strong>instruções especiais para atualização</strong>.

source: It might not always be possible to do an automatic upgrade as described above. For example, when:
pt: Pode ser que não seja possível fazer uma instalação automática da forma descrita acima. Por exemplo, quando:

source: No automatic upgrade is available from our website for this version.
pt: Nenhuma atualização automática está disponível a partir do nosso sítio web para esta versão.

source: The automatic upgrade is impossible for technical reasons (not enough memory, not enough free space on the device, etc.).
pt: A atualização automática não pode ser realizada por razões técnicas (falta de memória, falta de espaço livre no dispositivo, etc.).

source: You want to upgrade from another Tails device which already has a newer version installed, for example when working offline.
pt: Você quer atualizar a partir de um outro dispositivo Tails que já tem uma versão mais nova instalada, por exemplo ao trabalhar offline.

source: The automatic upgrade failed and you need to repair a Tails device.
pt: A atualização automática falhou e você precisa reparar o dispositivo com Tails.

source: In that case, <span class="application">Tails Installer</span> allows you to manually upgrade a USB stick or SD card to a newer version of Tails. Using <span class="application">Tails Installer</span> you can either:
pt: Neste caso, o <span class="application">Tails Installer</span> permite fazer a atualização da memória USB ou do cartão SD para uma versão mais nova do Tails. Usando o <span class="application">Tails Installer</span> você pode:

source: [[Upgrade by cloning from another device|upgrade#clone]] which already runs a newer version of Tails.
pt: [[Atualizar fazendo um clone de um outro dispositivo|upgrade#clone]] que já contenha uma versão mais nova do Tails.

source: [[Upgrade from an ISO image|upgrade#from_iso]] of a newer version of Tails.
pt: [[Atualizar a partir de uma imagem ISO|upgrade#from_iso]] de uma versão mais nova do Tails

source: Like for installing, you need to start <span class="application">Tails Installer</span> from another media than the device that you want to upgrade.
pt: Para a instalação, você precisa iniciar o <span class="application">Tails Installer</span> a partir de uma outra midia que não seja aquela que você quer atualizar.

source: To know the version of a running Tails, choose <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Tails</span>&nbsp;▸ <span class="guimenuitem">About Tails</span> </span>
pt: Para saber a versão do Tails que está rodando, escolha: <span class="menuchoice"> <span class="guimenu">Aplicações</span>&nbsp;▸ <span class="guisubmenu">Tails</span>&nbsp;▸ <span class="guimenuitem">Sobre o Tails</span> </span>

source: Clone & Upgrade
pt: Clonar & Atualizar

source: Start Tails from the DVD, USB stick, or SD card, that you want to clone from.
pt: Inicie o Tails a partir do DVD, dispositivo USB ou cartão SD que você quer clonar.

source: 2. Choose <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Tails</span>&nbsp;▸ <span class="guimenuitem">Tails Installer</span> </span> to start <span class="application">Tails Installer</span>.
pt: 2. Escolha <span class="menuchoice"> <span class="guimenu">Aplicações (Applications)</span>&nbsp;▸ <span class="guisubmenu">Tails</span>&nbsp;▸ <span class="guimenuitem">Tails Installer</span> </span> para iniciar o <span class="application">Tails Installer</span>.

source: Choose <span class="guilabel">Clone & Upgrade</span>.
pt: Escolha <span class="guilabel">Clonar & Atualizar</span>.

source: Plug the device that you want to upgrade.
pt: Conecte o dispositivo que você quer atualizar.

source: A new device, which corresponds to the USB stick or SD card, appears in the <span class="guilabel">Target Device</span> drop-down list.
pt: Um novo dispositivo, que corresponde à memória USB ou ao cartão SD, aparecerá na lista de opções <span class="guilabel">Dispositivo de Destino (Target Device)</span>.

source: Choose the device from the <span class="guilabel">Target Device</span> drop-down list.
pt: Escolha o dispositivo a partir da lista de opções <span class="guilabel">Dispositivo de Destino (Target Device)</span>.

source: To start the upgrade, click on the <span class="button">Install Tails</span> button.
pt: Para iniciar a atualização, clique no botão <span class="button">Instalar Tails (Install Tails)</span>.

source: Read the warning message in the pop-up window. Click on the <span class="button">Yes</span> button to confirm.
pt: Leia a mensagem de advertência na janela que se abrirá. Clique no botão <span class="button">Sim (Yes)</span> para confirmar.

source: Upgrade from ISO
pt: Atualize a partir de uma imagem ISO

source: Start Tails from another DVD, USB stick, or SD card, than the device that you want to upgrade.
pt: Inicie o Tails a partir de um outro DVD, memória USB ou cartão SD, diferente daquele que você quer atualizar.

source: Choose <span class="guilabel">Upgrade from ISO</span>.
pt: Escolha <span class="guilabel">Atualizar a partir da imagem ISO</span>.

source: Click on the <span class="guilabel">Browse</span> button to specify the location of the ISO image.
pt: Clique no botão <span class="guilabel">Browse</span> para especificar a localização da imagem ISO.

source: If the ISO image is saved on another media, plug it if necessary and click on the corresponding device in the <span class="guilabel">Places</span> column.
pt: Se a imagem ISO estiver salva em uma outra mídia, conecte-a se necessário e clique no dispositivo correspondente na coluna <span class="guilabel">Locais</span>.

source: If the ISO image is stored in a persistent volume, the corresponding device appears first as <span class="guilabel">Encrypted</span>. Click on the device and, in the popup window, enter the passphrase to unlock it.
pt: Se a imagem ISO estiver armazenada em um volume persistente, o dispositivo correspondente aparecerá primeiro como <span class="emphasis">Criptografado (Encrypted)</span>. Clique no dispositivo e, na janela que aparecerá, digite a senha para abrí-lo.
