Repository: vjrj/tails
Catalog: wiki/src/doc/encryption_and_privacy/gpgapplet/passphrase_encryption.*.po
Languages: de

source: [[!meta title="OpenPGP passphrase encryption"]]
de: [[!meta title="OpenPGP Verschlüsselung mit Passphrase"]]

source: With <span class="application">Tails OpenPGP Applet</span> you can **encrypt text with a passphrase** using the passphrase encryption of OpenPGP.
de: Mit dem <span class="application">Tails OpenPGP Applet</span> können Sie **Text mit einer Passphrase verschlüsseln**.

source: [[!inline pages="doc/encryption_and_privacy/gpgapplet.warning" raw="yes"]]
de: [[!inline pages="doc/encryption_and_privacy/gpgapplet.warning.de" raw="yes"]]

source: <strong>This technique requires you to share a secret passphrase with the people who will decrypt the text.</strong> OpenPGP also allows you to use public-key cryptography to send confidential messages without having a shared passphrase. [[See the corresponding documentation.|gpgapplet/public-key_cryptography]]
de: <strong>Bei dieser Methode müssen Sie eine geheime Passphrase mit den Personen teilen, die die Nachricht entschlüsseln sollen.</strong> OpenPGP unterstützt auch die Kryptographie mit öffentlichen Schlüsseln, um vertrauliche Nachrichten ohne eine gemeinsame Passphrase auszutauschen. [[Siehe die zugehörige Dokumentation.|gpgapplet/public-key_cryptography]]

source: Write your text in a text editor. **Do not write it in the web browser!**
de: Schreiben Sie Ihren Text in einen Texteditor. **Schreiben Sie ihn nicht in den Webbrowser!**

source: For example, open <span class="application">gedit</span> from the menu <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Accessories</span>&nbsp;▸ <span class="guimenuitem">gedit Text Editor</span></span>.
de: Zum Beispiel können Sie <span class="application">gedit</span> via <span class="menuchoice"> <span class="guimenu">Anwendungen</span>&nbsp;▸ <span class="guisubmenu">Zubehör</span>&nbsp;▸ <span class="guimenuitem">gedit Text Editor</span></span> öffnen.

source: 2. Select with the mouse the text that you want to encrypt. To copy it into the [[!wikipedia Clipboard_(computing) desc="clipboard"]], right-click on the selected text and choose <span class="guimenuitem">Copy</span> from the menu.
de: 2. Markieren Sie den zu verschlüsselnden Text mit der Maus. Um ihn in die [[!wikipedia_de Zwischenablage desc="Zwischenablage"]] zu kopieren, klicken Sie mit der rechten Maustaste auf den markierten Text und wählen den Menüpunkt <span class="guimenuitem">Kopieren</span> aus.

source: <span class="application">Tails OpenPGP Applet</span> now shows lines of text, meaning that the clipboard contains non-encrypted text.
de: Das <span class="application">Tails OpenPGP Applet</span> zeigt durch Textzeilen an, dass die Zwischenablage unverschlüsselten Text enthält.

source: [[!img gpgapplet_with_text.png link=no alt="Tails OpenPGP Applet with lines of text"]]
de: [[!img gpgapplet_with_text.png link=no alt="Tails OpenPGP Applet mit Textzeilen"]]

source: 3. Click on <span class="application">Tails OpenPGP Applet</span> and select <span class="guimenuitem">Encrypt Clipboard with Passphrase</span> from the menu.
de: 3. Klicken Sie auf das <span class="application">Tails OpenPGP Applet</span> und wählen die Option <span class="guimenuitem">Zwischenablage mit Passwort verschlüsseln</span> aus.

source: If you receive the error message “<span class="guilabel">The clipboard does not contain valid input data</span>”, try to copy your text again, starting from step 2.
de: Sollte die Fehlermeldung “<span class="guilabel">Die Zwischenablage beinhaltet keine gültigen Eingabedaten.</span>” angezeigt werden, versuchen Sie erneut den Text gemäß Schritt 2 zu kopieren.

source: 4. In the <span class="guilabel">Passphrase</span> dialog box, enter a passphrase of your choice. Repeat the same passphrase in the second dialog box.
de: 4. Geben Sie eine Passphrase Ihrer Wahl in den <span class="guilabel"> Passphrase</span> Dialog ein. Wiederholen Sie die gleiche Passphrase im zweiten Dialog.

source: 5. <span class="application">Tails OpenPGP Applet</span> now shows a padlock, meaning that the clipboard contains encrypted text.
de: 5. Das <span class="application">Tails OpenPGP Applet</span> zeigt durch ein Vorhängeschloss an, dass die Zwischenablage verschlüsselten Text enthält.

source: [[!img gpgapplet_with_padlock.png link=no alt="Tails OpenPGP Applet with a padlock"]]
de: [[!img gpgapplet_with_padlock.png link=no alt="Tails OpenPGP Applet mit Vorhängeschloss"]]

source: 6. To paste the encrypted text into another application, right-click in the application where you want to paste it and choose <span class="guimenuitem">Paste</span> from the menu.
de: 6. Um den verschlüsselten Text in ein anderes Programm einzufügen, klicken Sie mit der rechten Maustaste in die Anwendung, in die Sie ihn einfügen möchten, und wählen <span class="guimenuitem">Einfügen</span> aus dem Menü aus.

source: For example, you can paste it into the web browser to send it by email.
de: Sie können ihn beispielsweise in den Webbrowser einfügen und per Email versenden.

source: [[!img browser_paste.png link=no alt="Encrypted text starting with -----BEGIN PGP MESSAGE-----"]]
de: [[!img browser_paste.png link=no alt="Verschlüsselter Text beginnend mit -----BEGIN PGP MESSAGE-----"]]

source: You can also [[decrypt a text that is encrypted with a passphrase|decrypt_verify]] using <span class="application">Tails OpenPGP Applet</span>.
de: Ebenso können Sie mit dem <span class="application">Tails OpenPGP Applet</span> einen [[mit einer Passphrase verschlüsselten Text entschlüsseln|decrypt_verify]].
