Repository: vjrj/tails
Catalog: wiki/src/doc/encryption_and_privacy/gpgapplet/public-key_cryptography.*.po
Languages: de

source: [[!meta title="Tails OpenPGP public-key cryptography"]]
de: [[!meta title="Tails OpenPGP Public-Key Verschlüsselung"]]

source: With <span class="application">Tails OpenPGP Applet</span> you can **encrypt or sign text using the public key encryption of OpenPGP**.
de: Mit dem <span class="application">Tails OpenPGP Applet</span> können Sie **Text mit OpenPGP Public-Key-Verschlüsselung verschlüsseln oder signieren**.

source: [[!inline pages="doc/encryption_and_privacy/gpgapplet.warning" raw="yes"]]
de: [[!inline pages="doc/encryption_and_privacy/gpgapplet.warning.de" raw="yes"]]

source: <strong>This technique requires you to use public-key cryptography.</strong> If you never used OpenPGP keys before, you might rather want to encrypt your text using a passphrase with OpenPGP passphrase encryption. [[See the corresponding documentation.|gpgapplet/passphrase_encryption]]
de: <strong>Bei dieser Methode müssen Sie Public-Key Kryptographie einsetzen. </strong> Falls Sie zuvor noch nicht mit OpenPGP Schlüsseln gearbeitet haben, könnten Sie es bevorzugen, Ihren Text mit einer Passphrase zu verschlüsseln. [[Siehe die zugehörige Dokumentation.|gpgapplet/passphrase_encryption]]

source: Write your text in a text editor. **Do not write it in the web browser!**
de: Schreiben Sie Ihren Text in einen Texteditor. **Schreiben Sie ihn nicht in den Webbrowser!**

source: For example, open <span class="application">gedit</span> from the menu <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Accessories</span>&nbsp;▸ <span class="guimenuitem">gedit Text Editor</span></span>.
de: Zum Beispiel können Sie <span class="application">gedit</span> via <span class="menuchoice"> <span class="guimenu">Anwendungen</span>&nbsp;▸ <span class="guisubmenu">Zubehör</span>&nbsp;▸ <span class="guimenuitem">gedit Text Editor</span></span> öffnen.

source: 2. Select with the mouse the text that you want to encrypt or sign. To copy it into the [[!wikipedia Clipboard_(computing) desc="clipboard"]], right-click on the selected text and choose <span class="guimenuitem">Copy</span> from the menu.
de: 2. Markieren Sie den zu verschlüsselnden oder zu signierenden Text mit der Maus. Um ihn in die [[!wikipedia_de Zwischenablage desc="Zwischenablage"]] zu kopieren, klicken Sie mit der rechten Maustaste auf den markierten Text und wählen den Menüpunkt <span class="guimenuitem">Kopieren</span> aus.

source: <span class="application">Tails OpenPGP Applet</span> now shows lines of text, meaning that the clipboard contains non-encrypted text.
de: Das <span class="application">Tails OpenPGP Applet</span> zeigt durch Textzeilen an, dass die Zwischenablage unverschlüsselten Text enthält.

source: [[!img gpgapplet_with_text.png link=no alt="Tails OpenPGP Applet with lines of text"]]
de: [[!img gpgapplet_with_text.png link=no alt="Tails OpenPGP Applet mit Textzeilen"]]

source: Click on <span class="application">Tails OpenPGP Applet</span> and select <span class="guimenuitem">Sign/Encrypt Clipboard with Public Keys</span> from the menu.
de: Klicken Sie auf das <span class="application">Tails OpenPGP Applet</span> und wählen die Option <span class="guimenuitem">Zwischenablage mit Öffentlichen Schlüssel signieren/verschlüsseln</span> aus.

source: If you receive the error message “<span class="guilabel">The clipboard does not contain valid input data</span>”, try to copy your text again, starting from step 2.
de: Sollte die Fehlermeldung “<span class="guilabel">Die Zwischenablage beinhaltet keine gültigen Eingabedaten.</span>” angezeigt werden, versuchen Sie erneut den Text gemäß Schritt 2 zu kopieren.

source: 4. If you want to encrypt the text, select one or more public keys for the recipients of the encrypted text in the <span class="guilabel">Choose keys</span> dialog box. To select a public key, double-click on the corresponding line in the <span class="guilabel">Select recipients</span> list box.
de: 4. Falls Sie den Text verschlüsseln wollen, wählen Sie einen oder mehrere öffentliche Schlüssel für die Empfänger des verschlüsselten Textes im <span class="guilabel">Schlüssel wählen</span> Dialog aus.

source: 5. If you want to sign the text, select the secret key with which you want to sign the text in the <span class="guilabel">Sign message as</span> drop-down list.
de: 5. Falls Sie den Text signieren wollen, wählen Sie den geheimen Schlüssel aus der <span class="guilabel">Nachricht signieren als</span> Dropdown-Liste aus.

source: 6. If you want to hide the recipients of the encrypted text, select the <span class="guilabel">Hide recipients</span> check box. Otherwise anyone who sees the encrypted text can know who the recipients are.
de: 6. Falls Sie die Empfänger des verschlüsselten Texts verstecken möchten, setzen Sie das Häckchen bei <span class="guilabel">Empfänger verstecken</span>. Anderenfalls kann jeder, der den verschlüsselten Text sieht, sehen, wer die Empfänger sind.

source: Click on the <span class="guilabel">OK</span> button.
de: Klicken Sie auf <span class="guilabel">OK</span>.

source: If you receive the warning message <span class="guilabel">Do you trust these keys</span>, answer it accordingly.
de: Falls Sie die Warnung <span class="guilabel">Vertrauen Sie diesen Schlüsseln?</span> angezeigt bekommen, beantworten Sie sie entsprechend.

source: 8. If you selected one or several public keys to encrypt the text, <span class="application">Tails OpenPGP Applet</span> now shows a padlock, meaning that the clipboard contains encrypted text.
de: 8. Falls Sie einen oder mehrere öffentliche Schlüssel zum Verschlüsseln des Texts ausgewählt haben, zeigt Ihnen das <span class="application">Tails OpenPGP Applet</span> durch ein Vorhängeschloss an, dass die Zwischenablage nun verschlüsselten Text enthält.

source: [[!img gpgapplet_with_padlock.png link=no alt="Tails OpenPGP Applet with a padlock"]]
de: [[!img gpgapplet_with_padlock.png link=no alt="Tails OpenPGP Applet mit Vorhängeschloss"]]

source: If you only selected a secret key to sign the text, <span class="application">Tails OpenPGP Applet</span> now shows a seal, meaning that the clipboard contains signed text.
de: Haben Sie nur einen geheimen Schlüssel zum Signieren des Texts ausgewählt, so zeigt das <span class="application">Tails OpenPGP Applet</span> nun durch ein Siegel an, dass die Zwischenablage signierten Text enthält.

source: [[!img gpgapplet_with_seal.png link=no alt="Tails OpenPGP Applet with a seal"]]
de: [[!img gpgapplet_with_seal.png link=no alt="Tails OpenPGP Applet mit Siegel"]]

source: To paste the encrypted or signed text into another application, right-click in the application where you want to paste it and choose <span class="guimenuitem">Paste</span> from the menu.
de: Um den verschlüsselten oder signierten Text in eine andere Anwendung einzufügen, klicken Sie mit der rechten Maustaste auf das Programm, in das sie den Text einfügen möchten, und wählen die Option <span class="guimenuitem">Einfügen</span> aus dem Menü aus.

source: For example, you can paste it into the web browser to send it by email.
de: Sie können ihn beispielsweise in den Webbrowser einfügen und per Email versenden.

source: [[!img browser_paste.png link=no alt="Encrypted text starting with -----BEGIN PGP MESSAGE-----"]]
de: [[!img browser_paste.png link=no alt="Verschlüsselter Text beginnend mit -----BEGIN PGP MESSAGE-----"]]

source: You can also [[decrypt or verify a text that is encrypted or signed using public-key cryptography|decrypt_verify]] using <span class="application">Tails OpenPGP Applet</span>.
de: Ebenso können Sie mit dem <span class="application">Tails OpenPGP Applet</span> einen [[mit Public-Key Verschlüsselung verschlüsselten oder signierten Text entschlüsseln bzw. die Signatur überprüfen|decrypt_verify]].
