Repository: vjrj/tails
Catalog: wiki/src/doc/encryption_and_privacy/checksums.*.po
Languages: fr

source: [[!meta title="Calculating checksums using GtkHash"]]
fr: [[!meta title="Calculer les sommes de contrôle avec GtkHash"]]

source: [<span class="application">GtkHash</span>](http://gtkhash.sourceforge.net/) allows you to calculate [[!wikipedia checksum desc="checksums"]]. Checksums can be useful to verify the integrity of a file, for example, if you downloaded it from the Internet.
fr: [<span class="application">GtkHash</span>](http://gtkhash.sourceforge.net/) vous permet de calculer des [[!wikipedia_fr Somme_de_contrôle desc="sommes de contrôle"]]. Les sommes de contrôle peuvent servir à vérifier l'intégrité d'un fichier, par exemple si vous le téléchargez depuis l'Internet.

source: To calculate the checksum of a file:
fr: Pour calculer la somme de contrôle d'un fichier :

source: Open the <span class="application">Nautilus</span> file browser, either from the <span class="guimenu">Places</span> menu or the <span class="guilabel">Computer</span> icon on the desktop.
fr: Ouvrez le navigateur de fichiers <span class="application">Nautilus</span>, soit depuis le menu <span class="guimenu">Raccourcis</span>, soit depuis l'icône <span class="guilabel">Poste de travail</span> sur le bureau.

source: Navigate to the folder containing the file that you want to calculate the checksum for.
fr: Allez dans le dossier contenant le fichier dont vous voulez calculer la somme de contrôle.

source: Right-click on the file and choose <span class="guimenuitem">Properties</span>.
fr: Faites un clic-droit sur le fichier et choisissez <span class="guimenuitem">Propriétés</span>.

source: In the <span class="guimenuitem">Properties</span> dialog, click on the <span class="guilabel">Digests</span> tab.
fr: Dans la boîte de dialogue <span class="guimenuitem">Propriétés</span>, cliquez sur l'onglet <span class="guilabel">Condensés</span>.

source: In the <span class="guilabel">Hash Function</span> column of the <span class="guilabel">Digests</span> tabbed section, select the check boxes corresponding to the checksums that you want to calculate.
fr: Dans la colonne <span class="guilabel">Fonction de Hachage</span> de l'onglet <span class="guilabel">Condensés</span>, sélectionnez les cases à cocher correspondant aux sommes de contrôle que vous voulez calculer.

source: Click on the <span class="button">Hash</span> button.
fr: Cliquez sur le bouton <span class="button">Hachage</span>.

source: The calculated checksums appear in the <span class="guilabel">Digest</span> column.
fr: La somme de contrôle calculée apparaît dans la colonne <span class="guilabel">Condensat</span>.
