Repository: vjrj/tails
Catalog: wiki/src/doc/encryption_and_privacy/FireGPG_susceptible_to_devastating_attacks.*.po
Languages: fr

source: [[!meta title="FireGPG susceptible to devastating attacks"]]
fr: [[!meta title="FireGPG peut souffrir d'attaques dévastatrices"]]

source: **FireGPG is no more shipped in Tails.**
fr: **FireGPG n'est plus livré dans Tails.**

source: You should instead use our custom GPG applet to:
fr: Vous devriez plutôt utiliser notre Applet GPG pour :

source: [[Encrypt text with a passphrase|encryption_and_privacy/gpgapplet/passphrase_encryption]]
fr: [[Chiffrer du texte avec une phrase de passe|encryption_and_privacy/gpgapplet/passphrase_encryption]]

source: [[Encrypt and sign text using public-key cryptography|encryption_and_privacy/gpgapplet/public-key_cryptography]]
fr: [[Chiffrer et signer du texte avec une clé publique|encryption_and_privacy/gpgapplet/public-key_cryptography]]

source: [[Decrypt and verify text|encryption_and_privacy/gpgapplet/decrypt_verify]]
fr: [[Déchiffrer et vérifier du texte|encryption_and_privacy/gpgapplet/decrypt_verify]]

source: Advisory
fr: Avertissement

source: [FireGPG](http://getfiregpg.org/) is a Firefox addon that allows users to easily perform cryptographic actions on the contents of HTML pages, e.g. to verify signatures appearing as HTML text, or encrypt texts written inside HTML text boxes (i.e. &lt;textarea&gt;). Webmail interfaces commonly use text boxes for email composition, so FireGPG is a natural fit for this use case: the user writes his or her email plaintext in the text box, selects the plaintext and uses one of the "Encrypt" or "Sign and encrypt" actions available from the FireGPG menu to transform the selection to its encrypted counterpart.
fr: [FireGPG](http://getfiregpg.org) est une extension de Firefox qui permet d'utiliser facilement la cryptographie sur le contenu de pages HTML, par exemple pour vérifier des signatures qui apparaissent comme du texte HTML, ou pour chiffrer du texte écrit dans une fenêtre de texte HTML (&lt;textarea&gt;). Les interfaces webmail utilisent généralement ces fenêtres de texte pour écrire un email, c'est pourquoi FireGPG est l'outil idéal pour cet usage : l'utilisateur écrit son email dans la fenêtre de texte, le sélectionne et choisit l'action "Chiffrer" ou "Signer et chiffrer", disponibles depuis le menu FireGPG, pour transformer le texte en clair en texte chiffré.

source: The FireGPG design incorrectly assumes that this is safe, but it is not, since JavaScript running on the page can still control and observe much of what is happening on the page. For instance, a simple script can set up a timer that silently submits the contents of the text box back to the server every second, thereby leaking the plaintext as it is written, effectively bypassing any subsequent encryption. In fact, many non-malicious webmail services do just that at longer intervals, to save a draft of a message in case the user's browser crashes. The only way that a user can block this type of attack is by completely disabling JavaScript, which is often not desirable. In any case, FireGPG currently does nothing to make users aware of this issue. To the contrary, by making encryption commands easily accessible in the FireGPG context menu, it actively promotes this insecure usage.
fr: La conception de FireGPG nous assure être sûre, alors qu'elle ne l'est pas, étant donné que le JavaScript tournant sur la page peut toujours contrôler et observer la plupart des choses qui s'y passent. Par exemple, un simple script peut mettre en place un minuteur qui transmet sans notification le contenu de la fenêtre de texte à un serveur, ceci chaque seconde, transmettant ainsi le texte en clair à mesure qu'il est écrit, outrepassant donc toute forme de chiffrement. Dans les faits, de nombreux webmails bien intentionnés le font à intervalles réguliers, pour sauvegarder un brouillon du message au cas où le navigateur web de l'utilisateur planterait. Le seul moyen pour l'utilisateur d'empêcher ce type d'attaques est d'interdire complètement le JavaScript, ce qui n'est pas toujours souhaitable. FireGPG ne fait rien à l'heure actuelle pour prévenir ses utilisateurs de ce souci. Au contraire, en rendant le chiffrement facilement accessible dans le menu FireGPG, il promeut cet usage non sûr.

source: The situation is exactly the same if a user decrypts an OpenPGP block inside a text box: the OpenPGP block is replaced with the plaintext within the text box, so the same script can leak the plaintext when the timer fires less than a second later. Luckily, webmail systems rarely present messages in text boxes (although 'pastebins' often do). It is more common for received email to be displayed as HTML text, and when the user decrypts it, FireGPG will display the plaintext in a separate window that is safely out of reach of JavaScript. FireGPG has an option, `extensions.firegpg.result_always_in_new_window`, called "Always display encryption and signature results in a separate window" in the FireGPG options window, that forces this behaviour when decrypting OpenPGP blocks in text boxes as well, but it is disabled by default. This option, however, does not in any way prevent leaking of plaintext while the user is writing it as described in the previous paragraph.
fr: La situation est exactement la même si un utilisateur déchiffre un bloc OpenPGP dans une fenêtre de texte : le bloc OpenPGP est remplacé par le texte en clair dans cette même fenêtre, le même script peut donc récupérer le texte en clair quand le minuteur se déclenche moins d'une seconde plus tard. Heureusement, les webmails présentent rarement les messages dans des fenêtres de texte (bien que les 'pastebins' le font souvent). Les emails reçus sont plus fréquemment affichés en tant que texte HTML, et quand l'utilisateur le déchiffre, FireGPG affiche le texte déchiffré dans une fenêtre séparée qui est hors de portée du JavaScript. Dans la fenêtre des options de FireGPG se trouve l'option `extensions.firegpg.result_always_in_new_window`, qui s'appelle "Toujours afficher le résultat du chiffrement ou de la signature dans une nouvelle fenêtre", qui oblige FireGPG à agir ainsi même quand il s'agit de déchiffrer un bloc OpenPGP dans une fenêtre de texte, mais cette option n'est pas cochée par défaut. De toute façon, cette option ne protège d'aucune manière contre la récupération de texte lorsque que l'utilisateur/ice écrit son message, comme décrit dans le paragraphe précédent.

source: FireGPG also has three commands to sign (but not encrypt) messages: "Sign", "Wrapped sign" and "Clearsign". Simple JavaScript can replace the contents of the text box when the user selects it, so if the user does not re-read the text after selecting one of the 'sign' commands, the attacker will be able to obtain the user's signature on an arbitrary message. Enabling the `result_always_in_new_window` option does not prevent this attack; only user acuity *may* be able to detect and block it.
fr: FireGPG a également trois possibilités pour signer (mais sans chiffrer) des messages : "Signer en clair", "Signature découpée" et "Signer". Un programme JavaScript basique peut remplacer le contenu de la fenêtre de texte quand l'utilisateur le sélectionne, donc si l'utlisateur ne relit pas le texte après avoir sélectionné une de ces trois possibilités de signature, l'attaquant sera capable d'obtenir la signature de l'utilisateur depuis un message arbitraire. L'option `toujours_afficher_dans_une_nouvelle_fenêtre` ne protège pas contre cette attaque ; seule la vigilance de l'utilisateur *peut* être en mesure de la détecter et de l'empêcher.

source: It should be clear that the current FireGPG design of performing cryptographic actions on the contents of text boxes is fundamentally flawed and unsecurable. FireGPG's current design and interface is training users to act as if the contents of text boxes are private until they are explicitly submitted by the user (e.g. by pressing a "Submit"/"Send" button). Hence:
fr: Il est évident que le design actuel de FireGPG pour pratiquer le chiffrement et la signature du contenu de boîtes de texte est fondamentalement mauvais et impossible à sécuriser. Ce design entraîne les utilisateurs/ices à agir comme si le contenu des boîtes de texte était privé jusqu'à ce qu'il soit explicitement envoyé (en pressant le bouton "Envoyer" ou "Écrire"). Donc :

source: It is critical that all actions related to encryption and signing be removed from the FireGPG menu. The only way to perform these actions should be through the FireGPG Text editor, which is located in a separate window and thus safely out of the reach of content JavaScript. The FireGPG Text editor is already available through the FireGPG menu and makes all actions easily accessible.
fr: Il est nécessaire que toutes les actions de chiffrement et de signature soient retirées du menu de FireGPG. La seule manière de les exécuter devrait être via l'éditeur de texte de FireGPG, qui se situe dans une fenêtre séparée, et donc à l'abri du JavaScript. L'éditeur de texte de FireGPG est déjà disponible dans le menu FireGPG et rend toutes ces actions facilement accessibles.

source: FireGPG should explicitly state that the FireGPG Text editor is the only safe place to write plaintext that are to be encrypted and/or signed, or to decrypt messages unless the `result_always_in_new_window` option is enabled. Hopefully this will save users that have been misled by FireGPG for years from risking their data again, and make them understand why this new, less convenient, mode of operation is necessary. Otherwise, they may continue writing their plaintext in JavaScript-accessible text boxes, and then copy-and-paste it into the FireGPG Text editor just to encrypt it, instead of writing it there from the start.
fr: FireGPG devrait dire de manière explicite que son éditeur de texte est le seul moyen sûr pour écrire un texte en clair devant être chiffré et/ou signé, ou pour déchiffrer des messages, sauf si l'option `toujours_afficher_dans_une_nouvelle_fenêtre`est cochée. Ceci pourrait permettre aux utilisateurs, induits en erreur par FireGPG depuis des années, de ne plus exposer leurs données à de tels risques, et leur faire comprendre pourquoi cette nouvelle, certes moins pratique, manière de faire est nécessaire. Autrement, ils risquent de continuer à écrire leurs textes en clair dans des fenêtres de textes accessibles au JavaScript, et ensuite le copier-coller dans l'éditeur de texte de FireGPG pour le chiffrer, au lieu de l'écrire à cet endroit depuis le début.

source: The `result_always_in_new_window` option should be removed -- its behaviour should be forcibly enabled instead.
fr: L'option `toujours_afficher_dans_une_nouvelle_fenêtre` devrait être retirée -- son action devrait être le comportement par défaut et obligatoire.

source: The "Verify" command should display the contents of the signed message in the FireGPG Text editor. Otherwise, it may be possible to present to the user a different message from that seen by FireGPG.
fr: La commande "Vérifier" devrait afficher le contenu des messages signés dans l'éditeur de texte de FireGPG. Autrement, il est possible d'afficher à l'utilisateur un message différent de celui donné à FireGPG.

source: After these changes, the only remaining actions in the FireGPG menu will be "Decrypt" and "Verify". "Decrypt" is made safe by change 3, and "Verify" is made safe by change 4. It may still be a good idea to remove these actions as well to further promote the use of the FireGPG Text editor for all cryptographic actions. If they are removed, points 3 and 4 above become irrelevant and may be ignored. Per a discussion on #tor-dev and later #tails with rransom and katmagic it came to light that FireGPG may have a few serious security and anonymity issues (katmagic even claimed with "85%" certainty that these issues were among the main reasons FireGPG was discontinued):
fr: Après ces modifications, les seuls actions restantes dans le menu de FireGPG seront "Déchiffrer" et "Vérifier". "Déchiffrer" est sûr grâce au changement 3, et "Vérifier" est rendu sûr par le changement 4. Il peut être pertinent de supprimer également ces actions du menu, afin de promouvoir l'utilisation de l'éditeur de texte de FireGPG pour tout ce qui concerne la cryptographie. Si elles sont en effet supprimées, les points 3 et 4 deviennent non pertinents et peuvent être ignorés. Dans une discussion sur #tor-dev et ensuite sur #tails avec rransom et katmagic il est apparu que FireGPG pouvait avoir de sérieux problèmes de sécurité et d'anonymat (katmagic alla même jusqu'à assurer être sûr à "85%" que ces problèmes font partie des principales raisons de l'interruption du développement de FireGPG) :

source: Sample attack
fr: Exemples d'attaques

source: A similar approach should also work for stealing a plaintext written in a text box before it's encrypted.
fr: Une méthode similaire pourrait aussi fonctionner pour récupérer un texte écrit dans une fenêtre de texte avant son chiffrement.

source: Other ressources
fr: Autres ressources

source: [[tor-talk] Tor Browser Bundle: PGP encryption built-in?](http://www.mail-archive.com/tor-talk@lists.torproject.org/msg02105.html)<br/> A thread on the [tor-talk] list adressing the issues of supporting GPG inside a browser.
fr: [[tor-talk] Tor Browser Bundle: PGP encryption built-in?](http://www.mail-archive.com/tor-talk@lists.torproject.org/msg02105.html)<br/> Un fil de discussion sur la liste [tor-talk] au sujet des soucis du maintien de GPG dans un navigateur web.

source: [Spoofing OpenPGP signatures against FireGPG](http://lair.fifthhorseman.net/~dkg/firegpg-audit/spoof/)<br/> Another possible attack on FireGPG.
fr: [Corrompre les signatures OpenPGP grâce à FireGPG](http://lair.fifthhorseman.net/~dkg/firegpg-audit/spoof/)<br/> Une autre attaque possible contre FireGPG.

source: Other possible issues
fr: Autres soucis possibles

source: If it is possible to use JavaScript to check signatures, an attacker could potentially learn the user's whole key chain by replaying messages and their signatures made by those key holders. This would give the attacker an awful lot of identifying bits of the user.
fr: S'il est possible d'utiliser JavaScript pour vérifier des signatures, un attaquant pourrait potentiellement découvrir le trousseau de clés complet d'un utilisateur en rejouant des messages signés. Ceci donnerait à l'attaquant un très grand nombre de bits d'informations, identifiant l'utilisateur.
