Repository: vjrj/tails
Catalog: wiki/src/doc/encryption_and_privacy/truecrypt.*.po
Languages: fr

source: > WARNING: Using TrueCrypt is not secure as it may contain unfixed security issues.
fr: > ATTENTION: Utiliser TrueCrypt n'est pas sûr car pouvant contenir des failles de sécurité non corrigées.

source: <p>This technique might not work on volumes created with <em>TrueCrypt</em> version 4.1 to 4.3 (November 2005 to March 2007).</p>
fr: <p>Cette technique pourrait ne pas fonctionner avec des volumes créés avec <em>TrueCrypt</em> version 4.1 à 4.3 (novembre 2005 à mars 2007).</p>

source: [[Set up an administration password|first_steps/startup_options/administration_password]].
fr: [[Définir un mot de passe d'administration|first_steps/startup_options/administration_password]].

source: 1. Choose <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Accessories</span>&nbsp;▸ <span class="guimenuitem">Root Terminal</span> </span> to open a terminal with administration rights.
fr: 1. Choisir <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Accessoires</span>&nbsp;▸ <span class="guimenuitem">Terminal administrateur</span> </span> pour ouvrir un terminal avec les droits d'administration.

source: **If you want to open a standard *TrueCrypt* volume**, execute the following command. Replace `[volume]` with the path to your volume (partition or file container) and `[name]` with a name of your choice.
fr: ** Si vous voulez ouvrir un volume *TrueCrypt* standard, lancez la commande suivante. Remplacez `[volume]` par le chemin vers votre volume (partition ou conteneur de fichiers) et `[name]` par le nom de votre choix.

source: cryptsetup open --type tcrypt [volume] [name]
fr: cryptsetup open --type tcrypt [volume] [nom]

source: Here is an example of the command to execute to open a standard volume in a file container, yours is probably different:
fr: Voici un exemple de commande à lancer pour ouvrir un volume standard dans un conteneur de fichiers, la vôtre est probablement différente :

source: cryptsetup open --type tcrypt /media/mydisk/mycontainer myvolume
fr: cryptsetup open --type tcrypt /media/mondisque/monconteneur monvolume

source: **Else, if you want to open a hidden *TrueCrypt* volume**, execute the following command. Replace `[volume]` with the path to your volume (partition or file container) and `[name]` with a name of your choice.
fr: **Sinon, si vous voulez ouvrir un volume *TrueCrypt* caché**, lancez la commande suivante. Remplacez `[volume]` par le chemin vers votre volume (partition ou conteneur de fichiers) et `[name]` par le nom de votre choix.

source: cryptsetup --tcrypt-hidden open --type tcrypt [volume] [name]
fr: cryptsetup --tcrypt-hidden open --type tcrypt [volume] [nom]

source: Here is an example of the command to execute to open a hidden volume on a partition, yours is probably different:
fr: Voici un exemple de commande à lancer pour ouvrir un volume caché sur une partition, la vôtre est probablement différente :

source: cryptsetup --tcrypt-hidden open --type tcrypt /dev/sdc1 myhidden
fr: cryptsetup --tcrypt-hidden open --type tcrypt /dev/sdc1 monvolumecaché

source: After typing your password and once the command prompt reappears, execute the following commands to mount the volume. Replace `[name]` with the name chosen in step&nbsp;3.
fr: Après avoir tapé votre mot de passe et une fois que l'invite de commande réapparaît, lancez les commandes suivantes pour monter le volume. Remplacer `[name]` par le nom choisit à l'étape&nbsp;3.

source: mkdir /media/[name]
fr: mkdir /media/[nom]

source: a. And, if your volume contains a **NTFS or FAT file system** (default):
fr: a. Et si votre volume contient un **système de fichiers NTFS ou FAT** (par défaut) :

source: mount -o uid=1000 /dev/mapper/[name] /media/[name]
fr: mount -o uid=1000 /dev/mapper/[nom] /media/[nom]

source: a. Else, if your volume contains an **Ext2, Ext3, or Ext4 file system**:
fr: a. Sinon, si votre volume contient un **système de fichiers Ext2, Ext3, or Ext4** :

source: mount /dev/mapper/[name] /media/[name]
fr: mount /dev/mapper/[nom] /media/[nom]

source: If you don't see any error message, the volume is now available from the <span class="guimenu">Places</span> menu.
fr: Si vous n'avez aucun message d'erreur, le volume est désormais disponible depuis le menu <span class="guimenu">Places</span>.

source: When you want to close your *TrueCrypt* volume, execute the following commands to safely remove it. Otherwise some of your files could be lost or damaged. Replace `[name]`with the mapping name chosen in step&nbsp;3.
fr: Lorsque vous voulez fermer votre volume *TrueCrypt*, lancez les commandes suivantes pour le démonter de manière sûre. Sinon certains de vos fichiers pourraient être perdus ou endommagés. Remplacez `[name]` par le nom de mappage choisit à l'étape&nbsp;3.

source: umount /media/[name] cryptsetup close [name]
fr: umount /media/[nom] cryptsetup close [nom]
