Repository: vjrj/tails
Catalog: wiki/src/contribute.*.po
Languages: de

source: [[!meta title="Contributing to Tails"]]
de: [[!meta title="Bei Tails mitwirken"]]

source: There are many ways you can contribute to Tails. No effort is too small and whatever you bring to this community will be appreciated. So read on to find out how you can make a difference in Tails.
de: Es gibt viele Möglichkeiten, bei Tails mitzuwirken. Keine Bemühung ist zu gering und was auch immer Sie zur Allgemeinheit beitragen, wird gewürdigt werden. Bitte lesen Sie weiter, um herauszufinden, wie Sie Tails helfen können.

source: <div class="contribute-roles-1"> <h2>Share your experience</h2> <div class="contribute-role" id="user">
de: <div class="contribute-roles-1"> <h2>Erfahrungen mitteilen</h2> <div class="contribute-role" id="user">

source: <p>Every user can help others or provide developers with useful information.</p> <ul> <li>[[Report bugs|doc/first_steps/bug_reporting]]</li> <li>[[Test experimental ISO images|contribute/how/testing]]</li> <li>[[Provide input to developers|contribute/how/input]]</li> <li>[[Help other Tails users|contribute/how/help]]</li> </ul> </div> </div>
de: <p>Jeder Nutzer kann anderen Nutzern helfen oder den Entwicklern nützliche Informationen zukommen lassen.</p> <ul> <li>[[Fehler melden|doc/first_steps/bug_reporting]]</li> <li>[[Experimentelle ISO-Images testen|contribute/how/testing]]</li> <li>[[Entwicklern Informationen zutragen|contribute/how/input]]</li> <li>[[Anderen Tails-Nutzern helfen|contribute/how/help]]</li> </ul> </div> </div>

source: <div class="contribute-roles-1"> <h2>Donate</h2> <div class="contribute-role" id="donate">
de: <div class="contribute-roles-1"> <h2>Spenden</h2> <div class="contribute-role" id="donate">

source: <p>Donating speeds up the development of Tails.</p> <ul> <li>[[Make a donation|contribute/how/donate]]</li> </ul> </div> </div>
de: <p>Spenden beschleunigen die Weiterentwicklung von Tails.</p> <ul> <li>[[Spenden|contribute/how/donate]]</li> </ul> </div> </div>

source: <div class="contribute-roles-3"> <h2>Contribute your language skills</h2> <div class="contribute-role" id="content-writer"> <h3>Writer</h3>
de: <div class="contribute-roles-3"> <h2>Mit Ihren Sprachkenntnissen aushelfen</h2> <div class="contribute-role" id="content-writer"> <h3>Autor</h3>

source: <p>Good writers can make Tails accessible to more people.</p> <ul> <li>[[Improve documentation|contribute/how/documentation]]</li> <li>[[Write press releases|contribute/how/promote]]</li> </ul> </div> <div class="contribute-role" id="translator"> <h3>Translator</h3>
de: <p>Gute Autoren können Tails für mehr Menschen zugänglich machen.</p> <ul> <li>[[Die Dokumentation verbessern|contribute/how/documentation]]</li> <li>[[Pressemitteilungen schreiben|contribute/how/promote]]</li> </ul> </div> <div class="contribute-role" id="translator"> <h3>Übersetzer</h3>

source: <p>Translators can allow more people around the world to use Tails.</p> <ul> <li>[[Improve Tails in your own language|contribute/how/translate]]</li> </ul> </div> <div class="contribute-role" id="speaker"> <h3>Speaker</h3>
de: <p>Durch Übersetzungen können mehr Menschen auf der Welt Tails benutzen.</p> <ul> <li>[[Tails in Ihrer eigenen Sprache verbessern|contribute/how/translate]]</li> </ul> </div> <div class="contribute-role" id="speaker"> <h3>Sprecher</h3>

source: <p>Speakers can advocate Tails to all kinds of public.</p> <ul> <li>[[Talk at events|contribute/how/promote]]</li> </ul> </div> </div>
de: <p>Sprecher können Tails jeder Art von Publikum näher bringen.</p> <ul> <li>[[Auf Konferenzen vortragen|contribute/how/promote]]</li> </ul> </div> </div>

source: <div class="contribute-roles-3"> <h2>Contribute your computer skills</h2> <div class="contribute-role" id="developer"> <h3>Developer or maintainer</h3>
de: <div class="contribute-roles-3"> <h2>Mit Informatikkenntnissen zu Tails beitragen</h2> <div class="contribute-role" id="developer"> <h3>Entwickler oder Maintainer</h3>

source: <p>Software people with very diverse skills can improve Tails.</p> <ul> <li>[[Work on the source code|contribute/how/code]]</li> <li>[[Improve Tails by working on Debian|contribute/how/debian]]</li> </ul> </div> <div class="contribute-role" id="sysadmin"> <h3>System administrator</h3>
de: <p>Softwareentwickler mit unterschiedlichsten Fähigkeiten können Tails verbessern.</p> <ul> <li>[[Am Quellcode arbeiten|contribute/how/code]]</li> <li>[[Tails verbessern, indem Sie an Debian arbeiten|contribute/how/debian]]</li> </ul> </div> <div class="contribute-role" id="sysadmin"> <h3>Systemadministrator</h3>

source: <p>System administrators can contribute to the infrastructure behind Tails.</p> <ul> <li>[[Run a HTTP mirror|contribute/how/mirror]]</li> <li>[[Improve Tails infrastructure|contribute/how/sysadmin]]</li> </ul> </div> <div class="contribute-role" id="designer"> <h3>Designer</h3>
de: <p>Systemadministratoren können zur Infrastruktur hinter Tails beitragen.</p> <ul> <li>[[Einen HTTP-Spiegelserver bereitstellen|contribute/how/mirror]]</li> <li>[[Zur Infrastruktur von Tails beitragen|contribute/how/sysadmin]]</li> </ul> </div> <div class="contribute-role" id="designer"> <h3>Designer</h3>

source: <p>Designers can make Tails easier to use and more appealing.</p> <ul> <li>[[Improve the website|contribute/how/website]]</li> <li>[[Design graphics|contribute/how/graphics]]</li> <li>[[Improve the Tails user interface|contribute/how/user_interface]]</li> </ul> </div> </div>
de: <p>Designer können Tails benutzerfreundlicher und verständlicher machen.</p> <ul> <li>[[Die Webseite verbessern|contribute/how/website]]</li> <li>[[Grafiken entwerfen|contribute/how/graphics]]</li> <li>[[Die Benutzeroberfläche von Tails verbessern|contribute/how/user_interface]]</li> </ul> </div> </div>

source: <h1>Table of contents</h1>
de: <h1>Inhalt</h1>

source: <ol> <li class="L2"><a href="#reference-documents">Reference documents</a></li> <li class="L2"><a href="#tools">Tools for contributors</a></li> <li class="L2"><a href="#release-cycle">Release cycle</a></li> <li class="L2"><a href="#upstream">Relationship with upstream</a></li> <li class="L2"><a href="#collective-process">Collective process</a></li> <li class="L2"><a href="#talk">Talk with us</a></li> </ol>
de: <ol> <li class="L2"><a href="#reference-documents">Referenzdokumente</a></li> <li class="L2"><a href="#tools">Werkzeuge für Beitragende</a></li> <li class="L2"><a href="#release-cycle">Veröffentlichungszyklus</a></li> <li class="L2"><a href="#upstream">Beziehung zum Upstream</a></li> <li class="L2"><a href="#collective-process">Kollektive Prozesse</a></li> <li class="L2"><a href="#talk">Mit uns reden</a></li> </ol>

source: This section is only in English, because there is currently no way to contribute to Tails if you do not understand English.
de: Diesen Abschnitt gibt es nur in englischer Sprache, da es derzeit keine Möglichkeit gibt, ohne Englischkenntnisse bei Tails mitzuwirken.

source: Reference documents
de: Referenzdokumente

source: [[Design documents|contribute/design]]
de: Dokumentation der [[Tails-Architektur|contribute/design]]

source: [[Blueprints|blueprint]]
de: [[Entwürfe|blueprint]]

source: Tools for contributors
de: Werkzeuge für Beitragende

source: Source code: [[Git repositories|contribute/git]]
de: Quellcode: [[Git repositories|contribute/git]]

source: - [[Redmine bug tracker|contribute/working_together/Redmine]] - [Roadmap](https://labs.riseup.net/code/projects/tails/roadmap) - [[Easy tasks|easy_tasks]] for new contributors - [Tasks](https://labs.riseup.net/code/projects/tails/issues) can be filtered by type of work (see links in the sidebar) - [[Building a Tails image|contribute/build]] - [[Build the website|contribute/build/website]] - [[Customize Tails|contribute/customize]] - [[Debian package builder|contribute/Debian_package_builder]], to automatically build our custom packages - [[APT repository|contribute/APT_repository]], to store our custom Debian packages - [[Glossary for contributors|contribute/glossary]]
de: - [[Redmine bug tracker|contribute/working_together/Redmine]] - [Roadmap](https://labs.riseup.net/code/projects/tails/roadmap) - [[Einfache Aufgaben|easy_tasks]] für neue Beitragende - [Aufgaben](https://labs.riseup.net/code/projects/tails/issues) können je nach Aufgabenbereich gefiltert werden (siehe Links in der seitlichen Spalte) - [[Ein Tails-Image erstellen|contribute/build]] - [[Die Webseite generieren|contribute/build/website]] - [[Tails anpassen|contribute/customize]] - [[Debian package builder|contribute/Debian_package_builder]], um unsere angepassten Pakete automatisch zu erstellen - [[APT repository|contribute/APT_repository]], um unsere angepassten Debian Pakete zu verwalten - [[Glossar für Beitragende|contribute/glossary]]

source: Release cycle
de: Veröffentlichungszyklus

source: [[Release schedule|contribute/release_schedule]]
de: [[Veröffentlichungskalender|contribute/release_schedule]]

source: Relationship with upstream
de: Verhältnis zum Upstream

source: [[Relationship with upstream|contribute/relationship_with_upstream]]
de: [[Verhältnis zum Upstream|contribute/relationship_with_upstream]]

source: [[Improve Tails by working on Debian|contribute/how/debian]]
de: [[Tails verbessern, indem Sie an Debian mitarbeiten|contribute/how/help]]

source: Collective process
de: Kollektive Prozesse

source: [[Calendar|contribute/calendar]] of releases, meetings, working sessions, etc.
de: [[Kalender|contribute/calendar]] der Veröffentlichungen, Treffen, Arbeitsbesprechungen etc.

source: [[Meetings|contribute/meetings]], and minutes from past meetings
de: [[Treffen|contribute/meetings]] und Protokolle vergangener Treffen

source: [[Marking a task as easy|contribute/working_together/criteria_for_easy_tasks]]
de: [[Eine Aufgabe als leicht markieren|contribute/working_together/criteria_for_easy_tasks]]

source: [[Document progress|contribute/working_together/document_progress]]
de: [[Fortschritte dokumentieren|contribute/working_together/document_progress]]

source: - Roles - [[Front desk|contribute/working_together/roles/front_desk]] - [[Release manager|contribute/working_together/roles/release_manager]] - [[Ticket gardener|contribute/working_together/roles/ticket_gardener]]
de: - Rollen - [[Empfang|contribute/working_together/roles/front_desk]] - [[Release manager|contribute/working_together/roles/release_manager]] - [[Ticket gardener|contribute/working_together/roles/ticket_gardener]]

source: Talk with us
de: Mit uns reden
