Repository: vjrj/tails
Catalog: wiki/src/security.*.po
Languages: de

source: [[!meta title="Security"]]
de: [[!meta title="Sicherheitshinweise"]]

source: Since Tails is based on Debian, it takes advantage of all the work done by the Debian security team. As quoted from <http://security.debian.org/>:
de: Da Tails auf Debian basiert, profitiert es von all der Arbeit des Debian Security Teams. Zitat von <http://security.debian.org/>:

source: > Debian takes security very seriously. We handle all security problems brought to our attention and ensure that they are corrected within a reasonable timeframe. Many advisories are coordinated with other free software vendors and are published the same day a vulnerability is made public and we also have a Security Audit team that reviews the archive looking for new or unfixed security bugs.
de: > Debian nimmt die Sicherheit sehr ernst. Wir behandeln alle Sicherheitsprobleme, die uns bekannt gemacht werden, und stellen sicher, dass diese innerhalb eines angemessenen Zeitrahmens korrigiert werden. Viele Ankündigungen werden mit Anbietern anderer Freier Software koordiniert und werden am selben Tag veröffentlicht, an dem die Sicherheitslücke bekannt gegeben wird, und wir haben auch ein Sicherheits-Audit-Team, das das Archiv auf neue oder nicht behobene Sicherheitslücken hin sichtet.

source: > Experience has shown that "security through obscurity" does not work. Public disclosure allows for more rapid and better solutions to security problems. In that vein, this page addresses Debian's status with respect to various known security holes, which could potentially affect Debian.
de: > Die Erfahrung zeigt, dass "Sicherheit durch Verschleierung" (A.d.Ü.: englisch "security through obscurity") nicht funktioniert. Die Offenlegung erlaubt es, bessere Lösungen für Sicherheitsprobleme schneller zu finden. In diesem Sinne zeigt diese Seite den Stand von Debian in Bezug auf verschiedene bekannte Sicherheitsmängel, die auch Debian betreffen könnten.

source: Current holes
de: Derzeitige Lücken

source: Probable holes
de: Vermutete Lücken

source: Until an [[!tails_ticket 5769 desc="audit"]] of the bundled network applications is done, information leakages at the protocol level should be considered as − at the very least − possible.
de: Solange kein [[!tails_ticket 5769 desc="Audit"]] der mitgeführten Netzwerkanwendungen durchgeführt wurde, sollte davon ausgegangen werden, dass zumindest die Möglichkeit einer ungewollten Informationspreisgabe besteht.

source: Fixed holes
de: Behobene Lücken

source: **WARNING**: some of these holes may only be fixed in [[Git|contribute/git]]. Please carefully read the "Affected versions" sections bellow.
de: **ACHTUNG**: Möglicherweise sind einige Lücken nur in der [[Git|contribute/git]]-Version behoben. Bitte lesen Sie sorgfältig den Abschnitt "Betroffene Versionen" durch.

source: Audits of Tails that we are aware of are collected in [[security/audits]].
de: Uns bekannte Audits von Tails sind unter der Rubrik [[Audits|security/audits]] zu finden.
