Repository: vjrj/tails
Catalog: wiki/src/doc/get/trusting_tails_signing_key.*.po
Languages: fr, pt

source: [[!meta title="Trusting Tails signing key"]]
fr: [[!meta title="Faire confiance à la clé de signature de Tails"]]
pt: [[!meta title="Confiando na chave de assinatura do Tails"]]

source: We will present you three techniques from the easiest to the safest. Again, none of them is a perfect and magic solution. Feel free to explore them according to your possibilities and technical skills.
fr: Nous allons vous montrer trois techniques, de la plus simple à la plus sûre. Encore une fois, aucune de celles-ci n'est une solution magique ou parfaite. N'hésitez pas à les tester selon vos possibilités et compétences techniques.
pt: Nós vamos apresentar agora três técnicas: desde a mais fácil até a mais segura. Reforçamos que nenhuma delas é uma solução mágica e perfeita. Sinta-se à vontade para explorá-las de acordo com suas possibilidades e habilidades técnicas.

source: Note that since all Tails releases are signed with the same key, you will not have to verify the key every time and the trust you might progressively build in it will be built once and for all. Still, you will have to check the ISO image every time you download a new one!
fr: Notez que toutes les versions de Tails étant signées par la même clé, vous n'aurez pas à vérifier la clé à chaque fois et que la confiance que vous pourriez progressivement lui accorder le sera une fois pour toute. En revanche, il vous faudra vérifier l'image ISO à chaque fois que vous en téléchargez une nouvelle !
pt: Note que, como todos os lançamentos do Tails são assinadas com a mesma chave, você não precisa verificar a chave toda vez. Além disso, a confiança que você pode adquirir progressivamente nesta chave em algum momento vai ser adquirida de uma vez por todas. Mesmo assim você tem que verificar a imagem ISO toda vez que baixar uma nova!

source: Correlates several downloads of Tails signing key
fr: Corréler plusieurs téléchargements de la clé de signature de Tails
pt: Correlacione múltiplos downloads da chave de assinatura do Tails

source: A simple technique to increase the trust you can put in Tails signing key would be to download it several times, from several locations, several computers, possibly several countries, etc.
fr: Une technique simple pour augmenter la confiance que vous pouvez accorder à la clé de signature de Tails serait de la télécharger plusieurs fois, de plusieurs endroits, depuis différents ordinateurs, eventuellement plusieurs pays etc.
pt: Uma técnica simples para aumentar a confiança que você pode ter na chave de assinatura do Tails é baixá-la diversas vezes, de diferentes localizações, diferentes computadores, possivelmente diferentes países, etc.

source: For example you could save them every time with a different name in the same directory on a USB stick. Then run the following command from a terminal to check whether all the keys are identical:
fr: Vous pourriez, par exemple, les sauvegarder dans un même dossier sur une clé USB avec un nom différent pour chaque. Lancez ensuite les commandes suivantes dans un terminal pour vérifier qu'elles sont toutes identiques :
pt: Por exemplo, você pode salvá-la toda vez com um nome diferente no mesmo diretório de uma memória USB. Pode, então, rodar o seguinte comando a partir de um terminal para verificar se todas as chaves são idênticas:

source: cd [your download directory] sha256sum tails-signing*.key
fr: cd [votre dossier de téléchargements] sha256sum tails-signing*.key
pt: cd [seu diretório de download] sha256sum tails-signing*.key

source: This command would output something like this:
fr: Cette commande devrait vous donner quelque chose comme ça :
pt: Este comando deve retornar algo como o seguinte:

source: You would then need to visually check that all the checksums of the first column are the same, meaning that the keys are identical.
fr: Vous devrez ensuite vérifier visuellement que toutes les sommes de contrôle de la première colonne sont identiques, ce qui voudrait dire que les clés le sont également.
pt: Você tem então que verificar visualmente que todas as somas de verificação da primeira coluna são as mesmas, significando que as chaves são idênticas.

source: You could also use this technique to compare keys downloaded by your friends or other people you trust.
fr: Vous pourriez aussi utiliser cette technique pour comparer des clés téléchargées par des amis ou d'autres personnes en qui vous avez confiance.
pt: Você também pode usar esta técnica para comparar chaves baixadas pelos seus amigos ou outras pessoas nas quais você confia.

source: Using the OpenPGP Web of Trust
fr: Utiliser la toile de confiance OpenPGP
pt: Usando a Rede de Confiança OpenPGP

source: If you want to be extra cautious and really authenticate Tails signing key in a stronger way than what standard HTTPS offers you, you will need to use the OpenPGP Web of Trust.
fr: Si vous voulez être très prudent et réellement authentifier la clé de signature de Tails d'une manière plus forte que ce que le HTTPS standard vous permet, vous allez devoir utiliser la toile de confiance OpenPGP.
pt: Se você quiser ser extra cuidadoso e realmente autenticar a chave de uma forma mais forte que o HTTPS padrão te oferece, você vai precisar usar a Rede de Confiança OpenPGP.

source: One of the inherent problems of standard HTTPS is that the trust we usually put on a website is defined by certificate authorities: a hierarchical and closed set of companies and governmental institutions approved by web browser vendors. This model of trust has long been criticized and proved several times to be vulnerable to attacks [[as explained on our warning page|about/warning#man-in-the-middle]].
fr: Un problème inhérent au HTTPS standard est le fait que la confiance généralement accordée à un site web est définie par des autorités de certification : un ensemble fermé et hiérarchique d'entreprises et d'institutions gouvernementales agréées par les vendeurs de navigateurs web. La critique de ce modèle de confiance a été faite depuis longtemps et il a été montré de nombreuses fois qu'il était sujet à certaines attaques [[comme expliqué dans notre page d'avertissements|about/warning#man-in-the-middle]].
pt: Um dos problemas inerentes ao HTTPS padrão é que a confiança que geralmente se coloca em um sítio web é definida por autoridades certificadoras: um conjunto fechado e hierárquico de companhias e instituições governamentais aprovadas pelos desenvolvedores de navegadores. Este modelo de confiança tem sido criticado há muito tempo e provou muitas vezes ser vulnerável a ataques [[como explicado em nossa página de advertência|about/warning#man-in-the-middle]].

source: We believe instead that users should be given the final say when trusting a website, and that designation of trust should be done on the basis of human interaction.
fr: Nous pensons plutôt que le dernier mot lorsqu'il s'agit de faire confiance à un site web doit revenir aux utilisateurs, et que la construction de la confiance devrait être basée sur des relations humaines.
pt: Ao invés disso, acreditamos que os usuários devem dar a última palavra quanto à confiança em um sítio web, e que a indicação de confiança deve ser feita com base em interação humana.

source: The OpenPGP [[!wikipedia Web_of_Trust desc="Web of Trust"]] is a decentralized trust model based on OpenPGP keys. Let's see that with an example.
fr: La [[!wikipedia_fr Toile_de_confiance desc="Toile de confiance"]] OpenPGP est un modèle de confiance décentralisé basé sur les clés OpenPGP. Voyons ça avec un exemple.
pt: A [[!wikipedia Web_of_Trust desc="Rede de Confiança"]] é um modelo de confiança descentralizado baseado em chaves OpenPGP. Vejamos um exemplo.

source: *You're a friend of Alice and really trust her way of managing OpenPGP keys. You're trusting Alice's key.*
fr: *Vous êtes un ami d'Alice et lui faites vraiment confiance quant à sa manière de gérer les clés OpenPGP. Vous avez confiance dans la clé d'Alice.*
pt: *Você é amigo de Alice e realmente confia em sua forma de gerenciar chaves OpenPGP. Você está confiando na chave de Alice.*

source: *Furthermore, Alice met Bob, a Tails developer, in a conference, and signed Bob's key. Alice is trusting Bob's key.*
fr: *De plus, Alice a rencontré Bob, un développeur de Tails, lors d'une conférence et a signé sa clé. Alice a confiance dans la clé de Bob.*
pt: *Além disso, Alice conheceu Bob, um desenvolvedor do Tails, em uma conferência, e assinou a chave de Bob. Alice está confiando na chave de Bob*.

source: *Bob is a Tails developer who directly owns the Tails signing key. Bob fully trusts Tails signing key.*
fr: *Bob est un développeur de Tails qui possède la clé de signature de Tails. Bob a pleinement confiance dans la clé de signature de Tails.*
pt: *Bob é um desenvolvedor do Tails que possui diretamente a chave de assinatura do Tails. Bob confia completamente na chave de assinatura do Tails.

source: This scenario creates a trust path from you to Tails signing key that could allow you to trust it without having to depend on certificate authorities.
fr: Ce scénario créé un chemin de confiance entre vous et la clé de signature de Tails vous permettant de lui faire confiance sans avoir à dépendre des autorités de certification.
pt: Este cenário cria um caminho de confiança de você até a chave de assinatura do Tails que pode te permitir confiar nela sem depender de autoridades certificadoras.

source: This trust model is not perfect either and requires both caution and intelligent supervision by users. The technical details of creating, managing and trusting OpenPGP keys is outside of the scope of this document.
fr: Ce modèle de confiance n'est pas parfait non plus et demande à la fois prudence et intelligence dans le suivi de la part des utilisateurs. Les détails techniques de la création, de la gestion et des processus de confiance des clés OpenPGP vont au-delà du sujet de cette page.
pt: Este modelo de confiança também não é perfeito e requer ambos cautela e supervisão inteligente por parte dos usuários. Os detalhes técnicos sobre a criação, gerenciamento e confiança em chaves GPG estão fora do escopo deste documento.

source: We also acknowledge that not everybody might be able to create good trust path to Tails signing key since it based on a network of direct human relationships and the knowledge of quite complex tools such as OpenPGP.
fr: Nous reconnaissons quand même qu'il n'est pas donné à tout le monde de pouvoir établir un bon chemin de confiance jusqu'à la clé de signature de Tails, cela étant basé sur un réseau de relations humaines ainsi que sur le savoir-faire relativement complexe d'outils comme OpenPGP.
pt: Nós também reconhecemos que nem todos podem conseguir criar um bom caminho de confiança até a chave de assinatura uma vez que isto está baseado em uma rede de relações humanas diretas e conhecimento de ferramentas tão complexas quanto OpenPGP.

source: Check Tails signing key against the Debian keyring
fr: Vérifier la clé de signature de Tails via le trousseau Debian
pt: Verifique a chave de assinatura do Tails usando o chaveiro do Debian.

source: Following the previous scenario, when Alice met Bob, a Tails developer, she could have made a new signature on Tails signing key with her own key to certify this trust relationship and make it public. Tails signing key would now come along with a signature made by Alice.
fr: En suivant le précédent scénario, quand Alice a rencontré Bob, un développeur de Tails, elle aurait pu effectuer une nouvelle signature sur la clé de signature de Tails avec sa propre clé, pour certifier cette relation de confiance et la rendre publique. La clé de signature de Tails contiendrait désormais une nouvelle signature faite par Alice.
pt: Num cenário seguinte, quando Alice conhece Bob, que é um desenvolvedor do Tails, ela pode criar uma nova assinatura na chave de assinatura do Tails com a sua própria chave para certificar e tornar pública esta relação de confiança. A chave de assinatua do Tails agora virá junto com a assinatura feita por Alice.

source: Tails signing key is actually already signed by the keys of several official developers of Debian, the operating system on which Tails is based. Debian makes an extensive use of OpenPGP and you can download the keys of all Debian developers by installing the <code>debian-keyring</code> package. You can then verify the signatures those developers made with their own key on Tails signing key.
fr: En fait, la clé de signature de Tails est déjà signée par les clés de plusieurs développeurs officiels de Debian, le système d'exploitation sur lequel est basé Tails. Debian utilise de manière considérable OpenPGP et vous pouvez télécharger les clés de tous les développeurs Debian en installant le paquet <code>debian-keyring</code>. Vous pouvez ensuite vérifier les signatures faites par ces développeurs avec leurs propres clés sur la clé de signature de Tails.
pt: A chave de assinatura do Tails na verdade já está assinada por diversos desenvolvedores oficiais do Debian, o sistema operacional no qual Tails é baseado. O Debian faz um uso extensivo de OpenPGP e você pode baixar as chaves de todos os desenvolvedores Debian instalando o pacote <code>debian-keyring</code>. Você pode então verificar as assinaturas destes desenvolvedores, criadas com suas próprias chaves, na chave de assinatura do Tails.

source: To download the Debian keyring you can do:
fr: Pour télécharger le trousseau Debian vous pouvez faire :
pt: Para baixar o chaveiro do Debian você pode fazer:

source: To get a list of the signatures made by other people on Tails signing key you can do:
fr: Pour obtenir une liste des signatures faites par d'autres personnes sur la clé de signature de Tails vous pouvez faire :
pt: Para obter a lista de assinaturas feitas por outras pessoas na chave de assinatura do Tails você pode fazer:

source: You will get something like this:
fr: Vous obtiendrez quelque chose comme ça :
pt: Você vai ver algo mais ou menos assim:

source: The lines ending with '[User ID not found]' are signatures made by keys you still don't have in your keyring. You could try to search for them in the Debian keyring by their key ID: the 16 digit code between the 'sig' tag and the date. You could for example do:
fr: Les lignes se terminant par '[User ID not found]' sont des signatures faites par des clés qu'à l'heure actuelle vous n'avez pas dans votre trousseau. Vous pouvez essayer de les chercher dans le trousseau Debian via leur identifiant de clé : la suite de 16 chiffres située entre l'étiquette 'sig' et la date. Par exemple, vous pouvez faire :
pt: As linhas terminando com '[User ID not found]' -- ID de usuário não encontrado --, são assinaturas feitas com chaves que você ainda não possui no seu chaveiro. Você pode tentar buscá-las no chaveiro do Debian pelo key ID: o código de 16 dígitos entre a etiqueta 'sig' e a data. Você pode por exemplo fazer:

source: If this signature corresponds to a key in the Debian keyring you will get something like this:
fr: Si cette signature correspond à une clé du trousseau Debian, vous obtiendrez quelque chose comme ça :
pt: Se esta assinatura corresponder a uma chave no chaveiro do Debian você vai obter algo assim:

source: You can then import it in your own keyring by doing:
fr: Vous pouvez ensuite importer cette clé dans votre propre trousseau en faisant :
pt: Você pode então importá-la no seu próprio chaveiro fazendo:

source: Now you can try to verify the signature made by this new key on Tails signing key by doing:
fr: Vous pouvez désormais essayer de vérifier la signature faites par cette nouvelle clé sur la clé de signature de Tails en faisant :
pt: Agora você pode tentar verificar a assinatura feita por esta nova chave na chave de assinatura do Tails fazendo:

source: On the output, the status of the verification is indicated by a flag directly following the "sig" tag. A "!" indicates that the signature has been successfully verified, a "-" denotes a bad signature and a "%" is used if an error occurred while checking the signature (e.g. a non supported algorithm). For example, in the following output the signature of Daniel Kahn Gillmor on Tails signing key has been successfully verified:
fr: En réponse, le status de la vérification est indiqué par un marqueur juste après l'étiquette "sig". Un "!" indique que la signature a été vérifiée avec succès, un "-" une mauvaise signature et un "%" indique qu'une erreur est survenue lors de la vérification de signature (e.g. un algorithme non pris en charge). Par exemple, dans la réponse suivante la signature de Daniel Kahn Gillmor sur la clé de signature de Tails a été vérifié avec succès :
pt: Na saída, o estado da verificação é indicado por sinalizadores posicionados diretamente a seguir da etiqueta "sig". Uma "!" significa que a assinatura foi verificada de forma bem sucedida, um "-" denota uma assinatura ruim e um "%" é usado se um erro ocorreu quando da verificação da assinatura (como por exemplo um algorítmo não suportado). Na seguinte saída, por exemplo, a assinatura de Daniel Kahn Gillmor na chave de assinatura do Tails foi verificada corretamente:

source: Get into the Web of Trust!
fr: Rejoignez la toile de confiance !
pt: Entre na Rede de Confiança!

source: Since the Web of Trust is actually based on human relationships and real-life interactions the best would be to start establishing contacts with people knowledgeable about OpenPGP, start using it yourself and build trust relationships in order to find your own trust path to Tails signing key.
fr: La toile de confiance étant basée sur des relations humaines et des interactions dans la vraie vie le mieux serait d'entrer en contact avec des gens qui s'y connaissent en OpenPGP, de commencer à l'utiliser et à construire des liens de confiance afin de vous frayer votre propre chemin de confiance jusqu'à la clé de signature de Tails.
pt: Uma vez que a Rede de Confiança é de fato baseada em relações humanas e interações na vida real, o melhor é começar a estabelecer contatos com pessoas que tenham conhecimento sobre OpenPGP, começar a usá-lo você mesmo/a e construir relações de confiança para encontrar seu próprio caminho de confiança na chave de assinatura do Tails.

source: You could start by contacting a local [[!wikipedia Linux_User_Group desc="%s"]] or other Tails enthusiasts near you and exchange about their OpenPGP practices.
fr: Vous pourriez commencer par prendre contact avec un [[!wikipedia_fr Groupe_d'utilisateurs_Linux desc="groupe d'utilisateurs Linux"]] ou autres amis de Tails proches de chez vous et échanger à propos des procédés OpenPGP.
pt: Você pode começar contatando um [[!wikipedia Linux_User_Group desc="Grupo de Usuários de Linux" ou outros/as entusiastas do Tails próximos/as a você e trocando ideia sobre suas práticas com OpenPGP.

source: Further reading on OpenPGP
fr: En lire plus à propos de OpenPGP
pt: Mais leituras sobre o OpenPGP

source: [[!wikipedia GnuPG desc="Wikipedia: %s"]], a free OpenPGP software
fr: [[!wikipedia_fr GNU_Privacy_Guard desc="Wikipedia: GnuPG"]], un logiciel OpenPGP libre
pt: [[!wikipedia GnuPG desc="Wikipedia: %s"]], um software livre que implementa OpenPGP

source: [[Apache: How To OpenPGP|http://www.apache.org/dev/openpgp.html]]
pt: [[Apache: How To OpenPGP|http://www.apache.org/dev/openpgp.html]] (em inglês)

source: [[Debian: Keysigning|http://www.debian.org/events/keysigning]], a tutorial on signing keys of other people
fr: [[Debian: Signature de clés|http://www.debian.org/events/keysigning.fr.html]], un tutoriel sur le fait de signer les clés d'autres personnes
pt: [[Debian: Keysigning|http://www.debian.org/events/keysigning]], um tutorial sobre como assinar chaves de outras pessoas (em inglês)

source: [[rubin.ch: Explanation of the web of trust of PGP|http://www.rubin.ch/pgp/weboftrust.en.html]]
pt: [[rubin.ch: Explicação da rede de confiança do PGP|http://www.rubin.ch/pgp/weboftrust.en.html]] (em inglês)

source: [[Gpg4win: Certificate inspection|http://www.gpg4win.org/doc/en/gpg4win-compendium_16.html]], instructions to manage key trust with Gpg4win
fr: [[Gpg4win: Certificate inspection|http://www.gpg4win.org/doc/en/gpg4win-compendium_16.html]], instructions en anglais pour la gestion de la confiance des clés avec Gpg4win
pt: [[Gpg4win: inspeção de certificado|http://www.gpg4win.org/doc/en/gpg4win-compendium_16.html]], instruções para gerenciar confiança em chaves usando Gpg4win
