Repository: vjrj/tails
Catalog: wiki/src/doc/get/verify_the_iso_image_using_other_operating_systems.*.po
Languages: pt

source: [[!meta title="Verify the ISO image using other operating systems"]] [[!toc]]
pt: [[!meta title="Verifique a imagem ISO usando outros sistemas operacionais"]] [[!toc]]

source: GnuPG, a common free software implementation of OpenPGP has versions and graphical frontends for both Windows and Mac OS X. This also make it possible to check the cryptographic signature with those operating systems:
pt: GnuPG, uma implementação em software livre do OpenPGP, possui versões e interfaces gráficas para Windows e Mac OS X. Isto torna possível verificar a assinatura criptográfica também nestes sistemas operacionais:

source: [[Gpg4win|http://www.gpg4win.org/]], for Windows
pt: [[Gpg4win|http://www.gpg4win.org/]], para Windows

source: [[GPGTools|http://www.gpgtools.org/]], for Mac OS X
pt: [[GPGTools|http://www.gpgtools.org/]], para Mac OS X

source: You will find on either of those websites detailed documentation on how to install and use them.
pt: Você vai encontrar neste dois websites documentação sobre como instalá-los e utilizá-los.

source: For Windows using Gpg4win
pt: Para Windows usando Gpg4win

source: After installing Gpg4win, download Tails signing key:
pt: Após instalar Gpg4win, baixe a chave de assinatura do Tails:

source: [[Consult the Gpg4win documentation to import it|http://www.gpg4win.org/doc/en/gpg4win-compendium_15.html]]
pt: [[Consulte a documentação do Gpg4win para saber como importar a chave|http://www.gpg4win.org/doc/en/gpg4win-compendium_15.html]]

source: Then, download the cryptographic signature corresponding to the ISO image you want to verify:
pt: A seguir, baixe a assinatura criptográfica correspondente à imagem ISO que você quer verificar.

source: [[Consult the Gpg4win documentation to check the signature|http://www.gpg4win.org/doc/en/gpg4win-compendium_24.html#id4]]
pt: [[Consulte a documentação do Gpg4win para saber como verificar a assinatura|http://www.gpg4win.org/doc/en/gpg4win-compendium_24.html#id4]]

source: If you see the following warning:
pt: Se você vê o seguinte aviso:

source: Not enough information to check the signature validity. Signed on ... by tails@boum.org (Key ID: 0xBE2CD9C1 The validity of the signature cannot be verified.
pt: Não há informações suficientes para verificar a validade da assinatura. Assinada em ... por tails@boum.org (Key ID: 0xBE2CD9C1) A validade da assinatura não pôde ser verificada.

source: Then the ISO image is still correct, and valid according to the Tails signing key that you downloaded. This warning is related to the trust that you put in the Tails signing key. See, [[Trusting Tails signing key|doc/get/trusting_tails_signing_key]]. To remove this warning you would have to personally <span class="definition">[[!wikipedia Keysigning desc="sign"]]</span> the Tails signing key with your own key.
pt: Então a imagem ISO está correta, e válida de acordo com a chave de assinatura do Tails que você baixou. O aviso está relacionado à confiança que você põe na chave de assinatura do Tails. Veja [[Confiando na chave de assinatura do Tails|doc/get/trusting_tails_signing_key]]. Para remover este aviso você teria que <span class="definition">[[!wikipedia Keysigning desc="assinar"]]</span> pessoalmente a chave de assinatura do Tails com a sua própria chave.

source: For Mac OS X using GPGTools
pt: Para Mac OS X usando GPGTools

source: After installing GPGTools, you should be able to follow the instruction for [[Linux with the command line|verify_the_iso_image_using_the_command_line]]. To open the command line, navigate to your Applications folder, open Utilities, and double click on Terminal.
pt: Após realizar a instalação do GPGTools, você deve conseguir sgeuir as instrições para [[Linux com a linha de comando|verify_the_iso_image_using_the_command_line]]. Para abrir a linha de comando, navegue até a sua pasta de Aplicações, abra Utilitários e faça um clique duplo em Terminal.
