Repository: vjrj/tails
Catalog: wiki/src/doc/get/verify_the_iso_image_using_the_command_line.*.po
Languages: pt

source: [[!meta title="Verify the ISO image using the command line"]]
pt: [[!meta title="Verifique a imagem ISO usando a linha de comando"]]

source: You need to have GnuPG installed. GnuPG is the common OpenPGP implementation for Linux: it is installed by default under Debian, Ubuntu, Tails and many other distributions.
pt: Você precisa ter GnuPG instalado. GnuPG é uma implementação OpenPGP para Linux: ela é instalada por padrão no Debian, Ubuntu, Tails e muitas outras distribuições.

source: First, <strong>download Tails signing key</strong>:
pt: Primeiro, <strong>baixe a chave de assinatura do Tails</strong>:

source: Open a terminal and <strong>import Tails signing key</strong> with the following commands:
pt: Abra um terminal e <strong>importe a chave de assinatura do Tails</strong> com os seguintes comandos:

source: cd [the directory in which you downloaded the key] gpg --keyid-format long --import tails-signing.key
pt: cd [diretório no qual você baixou a chave] gpg --keyid-format long --import tails-signing.key

source: The output should tell you that the key was imported:
pt: A saída do comando deve te dizer que a chave foi importada:

source: <strong>If you had already imported Tails signing key in the past</strong>, the output should tell you that the key was not changed:
pt: <strong>Se você já tinha importado a chave do Tails no passado</strong>, a saída do comando deve te dizer que a chave não foi modificada:

source: <strong>If you are shown the following message</strong> at the end of the output:
pt: <strong>Se você vir a seguinte mensagem</strong> no fim da saída:

source: Analyse the other messages as usual: this extra message doesn't relate to the Tails signing key that you downloaded and usually means that you didn't create an OpenPGP key for yourself yet, which of no importance to verify the ISO image.
pt: Analise as outras mensagens da forma usual: esta mensagem extra não está relacionada à chave de assinatura do Tails que você baixou, e em geral significa que você não criou uma chave OpenPGP pra você mesmo ainda, o que não tem nenhuma importância para a verificação da imagem ISO.

source: Now, <strong>download the cryptographic signature</strong> corresponding to the ISO image you want to verify and save it in the same folder as the ISO image:
pt: Agora, <strong>baixe a assinatura criptográfica</strong> correspondente à imagem ISO que você quer verificar e salve ela no mesmo diretório da imagem ISO:

source: Then, <strong>start the cryptographic verification</strong>, it can take several minutes:
pt: A seguir, <strong>inicie a verificação criptográfica</strong>, que pode demorar vários minutos:

source: cd [the ISO image directory]
pt: cd [diretório da imagem ISO]

source: <strong>If the ISO image is correct</strong> the output will tell you that the signature is good:
pt: <strong>Se a imagem ISO estiver correta</strong> a saída deve te dizer que a assinatura é boa:

source: If you see the following warning:
pt: Se você vê o seguinte aviso:

source: Then the ISO image is still correct, and valid according to the Tails signing key that you downloaded. This warning is related to the trust that you put in the Tails signing key. See, [[Trusting Tails signing key|doc/get/trusting_tails_signing_key]]. To remove this warning you would have to personally <span class="definition">[[!wikipedia Keysigning desc="sign"]]</span> the Tails signing key with your own key.
pt: Então a imagem ISO ainda está corrta, e válida de acordo com a chave de assinatura que você baixou. Este aviso está relacionado à confiança que você põe na chave de assinatura do Tails. Veja [[Confiando na chave de assinatura do Tails|doc/get/trusting_tails_signing_key]]. Para remover este aviso você teria que pessoalmente <span class="definition">[[!wikipedia Keysigning desc="assinar"</span> a chave de assinatura do Tails com a sua própria chave.

source: <strong>If the ISO image is not correct</strong> the output will tell you that the signature is bad:
pt: <strong>Se a imagem ISO não estiver correta</strong> a saída vai te dizer que a assinatura é ruim:
