Repository: vjrj/tails
Catalog: wiki/src/doc/get/verify_the_iso_image_using_gnome.*.po
Languages: fr, pt

source: [[!meta title="Verify the ISO image using Linux with Gnome"]]
fr: [[!meta title="Vérifier l'image ISO sous Linux avec Gnome"]]
pt: [[!meta title="Verifique a imagem ISO usando Linux com Gnome"]]

source: You need to have the <code>seahorse-nautilus</code> package installed. It is already the case in Tails. In Debian or Ubuntu, if you are unsure or want to install it, you can issue the following commands:
fr: Vous avez besoin du paquet <code>seahorse-nautilus</code>. Il est déjà installé si vous utilisez Tails. Si vous utilisez Debian ou Ubuntu, si vous n'êtes pas sûr qu'il soit installé ou si vous souhaitez l'installer, vous pouvez utiliser les commandes suivantes dans un terminal :
pt: Você precisa ter o pacote <code>seahorse-nautilus</code> instalado. Este já é o caso se você estiver executanto o Tails. No Debian ou Ubuntu, se você não tem certeza se o pacote já está instalado ou se quer instalá-lo, você pode usar os seguintes comandos:

source: The <code>seahorse-nautilus</code> package is only available in:
fr: Le paquet <code>seahorse-nautilus</code> est seulement disponible dans :
pt: O pacote <code>seahorse-nautilus</code> somente está disponível:

source: Debian starting from version 7 (Wheezy), as a <a href="http://backports.debian.org/">backport</a>. See the installation <a href="http://backports.debian.org/Instructions/">instructions</a> on the Debian Backports website.
fr: Debian à partir de la version 7 (Wheezy), sous la forme d'un <a href="http://backports.debian.org/">rétroportage</a>. Veuillez consulter les <a href="http://backports.debian.org/Instructions/">instructions d'installation</a> (en anglais) sur le site de Debian Backports.
pt: no Debian a partir da versão 7 (Wheezy), como um <a href="http://backports.debian.org/">backport</a>. Veja as <a href="http://backports.debian.org/Instructions/">instruções</a> de instalação no sítio do Debian Backports.

source: Ubuntu starting from version 14.04 (Trusty).
fr: Ubuntu à partir de la version 14.01 (Trusty).
pt: no Ubuntu a partir da versão 14.04 (Trusty).

source: If you are unable to install it, try [[verifying the ISO using the command line|verify_the_iso_image_using_the_command_line]].
fr: Si vous ne pouvez pas l'installer, essayez de [[vérifier l'image ISO avec la ligne de commande|verify_the_iso_image_using_the_command_line].
pt: Se você não conseguir instalá-lo, tente [[verificar a imagem ISO usando a linha de comando|verify_the_iso_image_using_the_command_line]].

source: If you are using Tails, you already have the signing key. Otherwise, first download Tails signing key:
fr: Si vous utilisez Tails, la clé de signature de Tails est déjà présente dans votre trousseau. Sinon, commencez par télécharger cette clé :
pt: Se você está usando Tails, você já tem a chave de assinatura. Do contrário, primeiro baixe a chave de assinatura do Tails:

source: Your browser should propose you to open it with "Import Key". Choose this action. It will add Tails signing key to your keyring, the collection of OpenPGP keys you already imported:
fr: Votre navigateur peut vous proposer de l'ouvrir avec "Import Key" ou "Importer la clef". Choisissez cette action. Cela va ajouter la clef Tails à votre trousseau, qui rassemble les clef OpenPGP que vous avez déjà importées:
pt: Seu navegador deve propor de abrí-la com a opção "Importar Chave". Escolha esta ação. Ela vai adicionar a chave de assinatura do Tails ao seu chaveiro, a coleção de chaves OpenPGP que você já importou:

source: [[!img import_key.png alt="What should Iceweasel do with this file? Open with: Import Key (default)" link="no"]]
pt: [[!img import_key.png alt="O que o Iceweasel deve fazer com este arquivo? Abrir com: Importar Chave (padrão)" link="no"]]

source: You will get notified will the following message:
fr: Vous serez notifié avec le message suivant :
pt: Você será notificado com a seguinte mensagem:

source: [[!img key_imported.png alt="Key Imported. Imported a key for Tails developers (signing key) &lt;tails@boum.org&gt;" link="no"]]
pt: [[!img key_imported.png alt="Chave importada. Foi importada uma chave para Tails developers (signing key) &lt;tails@boum.org&gt;" link="no"]]

source: Now, download the cryptographic signature corresponding to the ISO image you want to verify:
fr: Maintenant téléchargez la signature numérique correspondant à l'image ISO que vous souhaitez vérifier :
pt: Agora, baixe a assinatura criptográfica correspondente à imagem ISO que você quer verificar:

source: Your browser should propose you to open it with "Verify Signature". Choose this action to start the cryptographic verification:
fr: Votre navigateur devrait vous proposer de l'ouvrir avec "Vérifier signature". Choisissez cette action pour démarrer la vérification :
pt: Seu navegador deve propor de abrí-la com a opção "Verificar assinatura". Escolha esta ação para iniciar a verificação criptográfica:

source: [[!img verify_signature.png alt="What should Iceweasel do with this file? Open with: Verify Signature (default)" link="no"]]
pt: [[!img verify_signature.png alt="O que o Iceweasel deve fazer com este arquivo? Abrir com: Verificar Assinatura (padrão)" link="no"]]

source: Browse your files to select the Tails ISO image you want to verify. Then, the verification will start. It can take several minutes:
fr: Parcourez vos fichiers pour sélectionner l'image ISO que vous souhaitez vérifier. La vérification peut prendre quelques minutes :
pt: Navegue pelos seus arquivos para selecionar a imagem ISO do Tails que você quer verificar. Então, a verificação vai começar. Ela pode demorar vários minutos:

source: [[!img verifying.png alt="Verifying" link="no"]]
pt: [[!img verifying.png alt="Verificando" link="no"]]

source: <strong>If the ISO image is correct</strong> you will get a notification telling you that the signature is good:
fr: <strong>Si la signature numérique correspond à l'image ISO</strong>, vous recevrez un message vous l'indiquant :
pt: <strong>Se a imagem ISO estiver correta</strong> você vai receber uma notificação avisando que a assinatura é boa:

source: [[!img good_signature.png alt="Goog Signature" link="no"]]
pt: [[!img good_signature.png alt="Boa assinatura" link="no"]]

source: <strong>If the ISO image is not correct</strong> you will get a notification telling you that the signature is bad:
fr: <strong>Si l'image ISO est corrompue</strong>, vous recevrez un message de ce type :
pt: <strong>Se a imagem ISO não estiver correta</strong> você vai receber uma notificação avisando que a assinatura é ruim:

source: [[!img bad_signature.png alt="Bad Signature: Bad or forged signature." link="no"]]
pt: [[!img bad_signature.png alt="Assinatura Ruim: Assinatura ruim ou forjada" link="no"]]

source: The GNOME notifications appear truncated on Tails 1.1 and later.
fr: Les notifications GNOME apparaissent coupées depuis Tails 1.1.

source: See&nbsp;[[!tails_ticket 7249]].
fr: Voir&nbsp;[[!tails_ticket 7249]].
