Repository: vjrj/tails
Catalog: wiki/src/doc/anonymous_internet/Tor_Browser.*.po
Languages: pt

source: [[!meta title="Browsing the web with Tor Browser"]]
pt: [[!meta title="Navegando na web com o Tor Browser"]]

source: [[!img Tor_Browser/mozicon128.png link=no alt="Iceweasel icon"]]
pt: [[!img Tor_Browser/mozicon128.png link=no alt="Ícone do Iceweasel"]]

source: Tor Browser is a rebranded version of the [[Mozilla Firefox|http://www.mozilla.com/firefox/]] web browser. Given its popularity many of you have probably used it before and its user interface is like any other modern web browser.
pt: Tor Browser é uma versão sem marca do navegador web [[Mozilla Firefox|http://www.mozilla.com/firefox/]]. Dada sua popularidade, muitos de vocês já devem tê-lo usado anteriormente e sua interface é igual a de qualquer outro navegador web moderno.

source: Here are a few things worth mentioning in the context of Tails.
pt: Aqui estão algumas coisas que valem a pena serem mencionadas no contexto do Tails.

source: HTTPS Encryption
pt: Criptografia HTTPS

source: Using HTTPS instead of HTTP encrypts your communication while browsing the web.
pt: Usar HTTPS ao invés de HTTP criptografa sua comunicação enquanto estiver navegando na web.

source: All the data exchanged between your browser and the server you are visiting are encrypted. It prevents the [[Tor exit node to eavesdrop on your communication|doc/about/warning#exit_node]].
pt: Todos os dados trocados entre seu navegador e o servidor são criptografados. Isto evita que o [[nó de saída do Tor grampeie sua comunicação|doc/about/warning#exit_node]].

source: HTTPS also includes mechanisms to authenticate the server you are communicating with. But those mechanisms can be flawed, [[as explained on our warning page|about/warning#man-in-the-middle]].
pt: HTTPS também inclui mecanismos de autenticação do servidor com o qual você está se comunicando. Mas estes mecanismos podem ser falhos, [[como explicado na nossa página de advertências|about/warning#man-in-the-middle]].

source: For example, here is how the browser looks like when we try to log in an email account at [lavabit.com](http://lavabit.com/), using their [webmail interface](https://lavabit.com/apps/webmail/src/login.php):
pt: Por exemplo, é assim que o navegador se parece quando tenta logar em uma conta de email no [lavabit.com](http://lavabit.com/), usando a [interface de webmail](https://lavabit.com/apps/webmail/src/login.php) deles:

source: Notice the small area on the left of the address bar saying "lavabit.com" on a blue background and the address beginning with "https://" (instead of "http://"):
pt: Note a pequena área à esqueda da barra de endereços dizendo "lavabit.com" em um fundo azul e o endereço inciado em "https://" (ao invés de "http://"):

source: [[!img Tor_Browser/address-bar.png link=no alt="address bar showing 'lavabit.com' / 'https://lavabit.com/'"]]
pt: [[!img Tor_Browser/address-bar.png link=no alt="barra de endereços mostrando 'lavabit.com' / 'https://lavabit.com/'"]]

source: These are the indicators that an encrypted connection using [[!wikipedia HTTPS]] is being used.
pt: Estes são os indicadores de que uma conexão criptografada usando HTTPS está sendo usada.

source: You should try to only use services providing HTTPS when you are sending or retrieving sensitive information (like passwords), otherwise its very easy for an eavesdropper to steal whatever information you are sending or to modify the content of a page on its way to your browser.
pt: Você deve tentar usar somente serviços providos através de HTTPS quando estiver enviando ou recebendo informações sensíveis (como senhas), pois de outra forma é muito fácil para um bisbilhoteiro roubar quaisquer informações que você estiver enviando ou modificar o conteúdo de uma página no caminho até o seu navegador.

source: [[!img https-everywhere.jpg link=no alt="HTTPS Everywhere logo"]]
pt: [[!img https-everywhere.jpg link=no alt="Logo do HTTPS Everywhere"]]

source: [HTTPS Everywhere](https://www.eff.org/https-everywhere) is a Firefox extension shipped in Tails and produced as a collaboration between [The Tor Project](https://torproject.org/) and the [Electronic Frontier Foundation](https://eff.org/). It encrypts your communications with a number of major websites. Many sites on the web offer some limited support for encryption over HTTPS, but make it difficult to use. For instance, they may default to unencrypted HTTP, or fill encrypted pages with links that go back to the unencrypted site. The HTTPS Everywhere extension fixes these problems by rewriting all requests to these sites to HTTPS.
pt: [HTTPS Everywhere](https://www.eff.org/https-everywhere) é uma extensão para o Firefox distribuída junto com o Tails e produzida em uma colaboração entre [o Projeto Tor](https://torproject.org/) e a [Electronic Frontier Foundation](https://eff.org/). Ela criptografa sua comunicação com uma boa quantidade de sítios relevantes. Muitos sítios na internet oferecem algum suporte limitado para criptografia através de HTTPS, mas fazem com que seja difícil de utilizá-la. Por exemplo, eles podem ter como configuração padrão uma conexão HTTP não criptografada, ou então criptografar páginas com links que trazem de volta a páginas não criptografadas. A extensão HTTPS Everywhere resolve este problema reescrevendo todas as requisições para estes sítios de forma que utilizem HTTPS.

source: To learn more about HTTPS Everywhere you can see:
pt: Para saber mais sobre o HTTPS Everywhere, você pode ver:

source: the [HTTPS Everywhere homepage](https://www.eff.org/https-everywhere)
pt: a página do [HTTPS Everywhere](https://www.eff.org/https-everywhere)

source: the [HTTPS Everywhere FAQ](https://www.eff.org/https-everywhere/faq/)
pt: as [perguntas frequentes do HTTPS Everywhere](https://www.eff.org/https-everywhere/faq/)

source: Tor alone is not enough to protect your anonymity and privacy while browsing the web. All modern web browsers, such as Firefox, support [[!wikipedia JavaScript]], [[!wikipedia Adobe_Flash]], [[!wikipedia HTTP_cookie desc="cookies"]] and other services which have been shown to be able to defeat the anonymity provided by the Tor network.
pt: O Tor sozinho não é suficiente para proteger sua anonimidade e privacidade para navegar na web. Todos os navegadores modernos, como o Firefox, têm suporte a [[!wikipedia JavaScript]], [[!wikipedia Adobe_Flash]], [[!wikipedia HTTP_cookie desc="cookies"]] e outros serviços que foram demonstrados serem problemas para a anonimidade provida pela rede Tor.

source: In Tails all such features are handled from inside the browser by an extension called [Torbutton](https://www.torproject.org/torbutton/) which does all sorts of things to prevent the above type of attacks. But that comes at a price: since this will disable some functionalities and some sites might not work as intended.
pt: No Tails, todas estas características são gerenciadas de dentro do navegador por uma extensão chamada [Torbutton](https://www.torproject.org/torbutton/) que faz todo tipo de coisa para evitar os tipos de ataque descritos acima. Mas isto tem um preço, uma vez que para tal a extensão desabilita algumas funcionalidades e alguns sítios podem não funcionar da forma esperada.

source: Protection against dangerous JavaScript
pt: Proteção contra JavaScript perigoso

source: Having all JavaScript disabled by default would disable a lot of harmless and possibly useful JavaScript and render unusable many websites.
pt: Desabilitar todo JavaScript por padrão desabilitaria um monte de scripts inofensivos e possivelmente úteis, e poderia inutilizar muitos sítios.

source: That's why **JavaScript is enabled by default** in Tails.
pt: É por isto queo **JavaScript está habilitado por padrão** no Tails.

source: But we rely on Torbutton to **disable all potentially dangerous JavaScript**.
pt: Mas nós confiamos no Torbutton para **desabilitar todo JavaScript potencialmente perigoso**.

source: We consider this as a necessary compromise between security and usability and as of today we are not aware of any JavaScript that would compromise Tails anonymity.
pt: Nós consideramos isto um compromisso necessário entre segurança e usabilidade. Além do que, até hoje não estamos cientes de nenhum JavaScript que possa comprometer a anonimidade do Tails.

source: For more technical details you can refer to the [Tor Browser design document](https://www.torproject.org/projects/torbrowser/design/).
pt: Para mais detalhes técnicos, você pode ver o [documento de projeto do Torbutton](https://www.torproject.org/projects/torbrowser/design/).

source: NoScript to have even more control over JavaScript
pt: Use o NoScript para ter ainda mais controle sobre JavaScript

source: [[!img noscript.png link=no alt="NoScript logo"]]
pt: [[!img noscript.png link=no alt="Logo do NoScript"]]

source: To allow more control over JavaScript, for example to disable JavaScript completely, Tails includes the <span class="application">NoScript</span> extension.
pt: Para permitir mais controle sobre o JavaScript, como por exemplo para desabilitar o JavaScript completamente, o Tails inclui a extensão <span class="application">NoScript</span>.

source: By default, <span class="application">NoScript</span> is disabled and some JavaScript is allowed by the <span class="application">[[Torbutton|Tor_Browser#javascript]]</span> extension as explained above.
pt: Por padrão, o <span class="application">NoScript</span> fica desabilitado e uma certa quantidade de JavaScript é permitida pela extensão <span class="application">[[Torbutton|Tor_Browser#javascript]]</span>, como explicado acima.

source: For more information you can refer to the NoScript [website](http://noscript.net/) and [features](http://noscript.net/features).
pt: Para mais informações, você pode ver o [website](http://noscript.net/) e as [funcionalidades](http://noscript.net/features) do NoScript.
