Repository: vjrj/tails
Catalog: wiki/src/doc/anonymous_internet/vidalia.*.po
Languages: pt

source: [[!meta title="Controlling Tor using Vidalia"]]
pt: [[!meta title="Controlando o Tor com Vidalia"]]

source: <span class="application">Vidalia</span> allows you to control some of the functionalities of Tor. It is started automatically when an [[Internet connection|networkmanager]] is established.
pt: O <span class="application">Vidalia</span> permite que você controle algumas das funcionalidades do Tor. Ele é automaticamente iniciado quando uma [[conexão à Internet|networkmanager]] é estabelecida.

source: Status icon
pt: Ícone de estado

source: <span class="application">Vidalia</span> appears as an onion icon in the notification area:
pt: O <span class="application">Vidalia</span> aparece como um ícone de uma cebola na área de notificação:

source: <div class="text"><strong>The onion icon is green</strong> when you are connected to Tor.</div> </div>
pt: <div class="text"><strong>O ícone da cebola fica verde</strong> quando você está conectado/a ao Tor.</div> </div>

source: <div class="text"><strong>The onion icon is yellow</strong> while Tor is starting. </div>
pt: <div class="text"><strong>O ícone da cebola fica amarelo</strong> quando o Tor está iniciando. </div>

source: The <span class="application">Vidalia</span> onion icon sometimes stays yellow even if Tor is already started. If the <span class="guilabel">Tor is ready</span> notification appears or if you can browse the Internet using the <span class="application">Tor Browser</span>, then Tor is started correctly.
pt: O ícone do <span class="application">Vidalia</span> algumas vezes fica amarelo mesmo depois do Tor ter iniciado. Se a notificação <span class="guilabel">Tor está pronto</span> aparecer ou se você consegue navegar na Internet usando o <span class="application">Navegador Tor</span>, então o Tor foi iniciado corretamente.

source: Tails has other protections that would prevent your from connecting to the Internet without going through Tor.
pt: O Tails possui outras proteções que evitariam que você se conectasse à Internet sem que estivesse passando pela rede Tor.

source: <div class="text"><strong>The onion icon is crossed out</strong> when Tor is stopped. </div>
pt: <div class="text"><strong>O ícone de cebola fica riscado com um X</strong> quando o Tor está parado. </div>

source: When Tor is stopped all connections to the Internet are blocked by default.
pt: Quando o Tor está parado, todas as conexões à Internet são bloqueadas por padrão.

source: Popup menu
pt: Menu de opções

source: To access more features of <span class="application">Vidalia</span>, right-click on the onion icon to open its popup menu:
pt: Para acessar mais funcionalidades do <span class="application">Vidalia</span>, clique com o botão direito no ícone da cebola para abrir o menu de opções:

source: [[!img vidalia/right-click_menu.png link=no alt="Vidalia popup menu"]]
pt: [[!img vidalia/right-click_menu.png link=no alt="Menu de opções do Vidalia"]]

source: The <span class="guilabel">Network Map</span> feature
pt: A funcionalidade <span class="guilabel">Mapa da Rede</span>

source: The <span class="guilabel">Network Map</span> feature displays information about the available Tor relays and your established circuits and connections:
pt: A funcionalidade <span class="guilabel">Mapa da Rede</span> mostra informações sobre os repetidores disponíveis e seus circuitos e conexões estabelecidos:

source: In the left pane, there is a list of all the public Tor relays. Click on a relay in the list to see its technical details in the right pane.
pt: No painel esquerdo, há uma lista de todos os repetidores públicos do Tor. Clique em um repetidor da lista para ver seus detalhes técnicos no painel direito.

source: In the bottom pane, there is a list of the [[circuits|about/warning#exit_node]] established by Tor. When you connect to a destination server, the connection appears in the list below the circuit it uses.
pt: No painel inferior há uma lista dos [[circuitos|about/warning#exit_node]] estabelecidos pelo Tor. Quando você se conecta a um servidor de destino, a conexão aparece na lista abaixo do circuito que ela está usando.

source: In the example below, the connection to <span class="code">irc.oftc.net</span> goes through the relays <span class="guilabel">PiratenNDS2</span>, <span class="guilabel">AxleRelay3</span>, and the exit node <span class="guilabel">DFRI3</span>.
pt: No exemplo abaixo, a conexão para <span class="code">irc.oftc.net</span> passa através dos repetidores <span class="guilabel">PiratenNDS2</span>, <span class="guilabel">AxleRelay3</span>, e pelo nó de saída <span class="guilabel">DFRI3</span>.

source: In the top pane, there is an approximate map of where the relays of each circuit are located.
pt: No painel superior há um mapa aproximado de onde os repetidores de cada circuito estão localizados.

source: In the example below, the relay <span class="guilabel">PiratenNDS2</span> is in Germany, the relay <span class="guilabel">AxleRelay3</span> is in the USA, and the relay <span class="guilabel">DFRI3</span> is in Sweden.
pt: No exemplo abaixo, o repetidor <span class="guilabel">PiratenNDS2</span> está na alemanha, o repetidor <span class="guilabel">AxleRelay3</span> está nos EUA e o repetidor <span class="guilabel">DFRI3</span> está na Suécia.

source: If you click on a circuit, in the right pane are displayed technical details of the relays composing the circuit.
pt: Se você clicar em um circuido, no painel direito serão mostrados os detalhes técnicos dos repetidores que compõe o circuito.

source: <!-- Note for translators: the entry guard in use when you take the screenshot network_map.png is in a position to identify you. You might prefer to leave it untranslated.-->
pt: <!-- Nota para tradutores/as: a guarda de entrada usada quando você tira um screenshot network_map.png pode identificar você. Você pode preferir deixá-la não traduzida.-->

source: The <span class="guilabel">New Identity</span> feature
pt: A funcionalidade <span class="guilabel">Nova Identidade</span>

source: [[As explained on our warning page|about/warning#identities]], this feature of <span class="application">Vidalia</span> is not a solution to really separate different contextual identities. <strong>Shutdown and restart Tails instead.</strong>
pt: [[Como explicado em nossa página de advertências|about/warning#identities]], esta funcionalidade do <span class="application">Vidalia</span> não é uma solução para realmente separar duas identidades contextuais distintas. <strong>Desligue e reinicie o Tails ao invés de usar esta funcionalidade.</strong>

source: Additional Tor configuration
pt: Configurações adicionais do Tor

source: To configure bridges, firewall, or proxy settings [[select the corresponding option in <span class="application">Tails Greeter</span> |first_steps/startup_options/bridge_mode]].
pt: Para configurar pontes (bridges), firewall ou proxy, [[selecione a opção correspondente no <span class="application">Tails Greeter</span>|first_steps/startup_options/bridge_mode]].

source: It is impossible to edit the <span class="filename">torrc</span> configuration file using <span class="application">Vidalia</span>. See [[!tails_ticket 6601]].
pt: É impossível editar o arquivo de configuração <span class="filename">torrc</span> usando o <span class="application">Vidalia</span>. Veja o [[!tails_ticket 6601]].

source: It is impossible to configure Tails to act as a Tor relay using <span class="application">Vidalia</span>. See [[!tails_ticket 5438]].
pt: É impossível configurar o Tails para funcionar como um repetidor Tor usando o <span class="application">Vidalia</span>. Veja o [[!tails_ticket 5438]].
