Repository: vjrj/tails
Catalog: wiki/src/doc/first_steps/persistence/change_passphrase.*.po
Languages: pt

source: [[!meta title="Change the passphrase of the persistent volume"]]
pt: [[!meta title="Altere a senha do volume persistente"]]

source: Start GNOME Disk utility
pt: Inicie o Utilitário de Disco do GNOME

source: 1. Open <span class="application">GNOME Disk Utility</span> from the menu <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Accessories</span>&nbsp;▸ <span class="guimenuitem">Disk Utility</span> </span>.
pt: 1. Abra o <span class="application">Utilitário de Disco do GNOME</span> a partir do menu <span class="menuchoice"> <span class="guimenu">Aplicações</span>&nbsp;▸ <span class="guisubmenu">Ferramentas de Sistema</span>&nbsp;▸ <span class="guimenuitem">Utilitário de Disco</span> </span>.

source: Find out the device of the persistent volume
pt: Encontre o dispositivo do volume persistente

source: <span class="application">Disk Utility</span> lists all the current storage devices in the left pane of the window. When you select one of these devices, detailed information about it is displayed in the right pane: its partitions, its brand, its size, etc.
pt: O <span class="application">Utilitário de Disco</span> lista todos os dispositivos de armazenamento atuais no painel esquerdo da janela. Quando você seleciona um destes dispositivos, informações detalhadas são mostradas no painel direito: suas partições, marca, tamanho, etc.

source: Find which device contains the persistent volume. It should have two partitions, one labelled <span class="guilabel">Tails</span>, and another one labelled <span class="guilabel">TailsData</span> which corresponds to the persistent volume.
pt: Encontre qual dispositivo contém o volume persistente. Ele deve ter duas partições, uma chamada <span class="guilabel">Tails</span> e outra chamada <span class="guilabel">TailsData</span> que corresponde ao volume persistente.

source: In the right pane of the window, verify that the device corresponds to your device, its brand, its size, etc.
pt: No painel direito da janela, verifique que o dispositivo corresponde ao seu dispositivo, confira a marca, tamanho, etc.

source: Change the passphrase of the persistent volume
pt: Altere a senha do volume persistente

source: In the right pane, select the persistent volume partition, labelled <span class="guilabel">TailsData</span> by clicking on it.
pt: No painel direito, selecione a partição do volume persistente, chamada <span class="TailsData">, clicando nela.

source: Click on <span class="guilabel">Change Passphrase</span>.
pt: Clique em <span class="guilabel">Alterar Senha</span>.

source: Type your current passphrase and then type twice a new one.
pt: Digite sua senha atual e em seguida digite a nova senha.

source: Finally click on <span class="guilabel">Change passphrase</span>.
pt: Finalmente, clique em <span class="guilabel">Alterar senha</span>.

source: You now can restart Tails and try to enable the persistent volume with its new passphrase.
pt: Agora você pode reiniciar o Tails e tentar habilitar o volume persistente com a nova senha.
