Repository: vjrj/tails
Catalog: wiki/src/doc/first_steps/startup_options/bridge_mode.*.po
Languages: de, pt

source: [[!meta title="Tor bridge mode"]]
de: [[!meta title="Tor Bridge Modus"]]
pt: [[!meta title="Modo Ponte (Bridge) do Tor"]]

source: What bridges are and when to use them
de: Was Bridges sind und wann sie benutzt werden
pt: O que são pontes (bridges) e quando usá-las

source: When using Tor with Tails in its default configuration, anyone who can observe the traffic of your Internet connection (for example your Internet Service Provider and perhaps your government and law enforcement agencies) can know that you are using Tor.
de: Wenn Tor in Verbindung mit Tails in seiner Standardkonfiguration verwendet wird, kann jeder die Datenströme Ihrer Internetverbindung überwachen (beispielsweise Ihr Internetanbieter und möglicherweise auch Ihre Regierung sowie Strafverfolgungsbehörden) und somit feststellen, dass Sie Tor benutzen.
pt: Ao usar Tor com Tails em sua configuração padrão, qualquer pessoa que possa observar o tráfego da sua conexão de Internet (por exemplo seu Provedor de Serviços de Internet e talvez seu governo e instituições com poder de fazer valer a lei) pode saber que você está usando Tor.

source: This may be an issue if you are in a country where the following applies:
de: Dies kann ein Problem sein, wenn Sie sich in einem Land befinden, in dem folgendes zutrifft:
pt: Isto pode ser um problema se você estiver em um país no qual:

source: **Using Tor is blocked by censorship:** since all connections to the Internet are forced to go through Tor, this would render Tails useless for everything except for working offline on documents, etc.
de: **Die Nutzung von Tor ist durch Zensur blockiert:** Da alle Verbindungen ins Internet durch Tor geleitet werden, würde das bedeuten, dass Tails unbenutzbar wird, außer um offline an Dokumenten zu arbeiten.
pt: **O uso do Tor é bloqueado pela censura:** uma vez que todas as conexões à Internet passam obrigatoriamente pela rede Tor, a censura torna o Tails seja inútil para tudo, exceto trabalhar offline em documentos, etc.

source: **Using Tor is dangerous or considered suspicious:** in this case starting Tails in its default configuration might get you into serious trouble.
de: **Die Benutzung von Tor ist gefährlich oder wird als verdächtig erachtet:** In diesem Falle könnte das Starten von Tails Sie in ernsthafte Schwierigkeiten bringen.
pt: **O uso do Tor é perigoso ou considerado suspeito:** neste caso, iniciar o Tails com sua configuração padrão poderá te trazer sérios problemas.

source: Tor bridges, also called Tor bridge relays, are alternative entry points to the Tor network that are not all listed publicly. Using a bridge makes it harder, but not impossible, for your Internet Service Provider to know that you are using Tor.
de: Tor Bridges, auch Tor Bridge Relais gennant, sind alternative, nicht öffentlich aufgelistete Eingangspunkte in das Tor Netzwerk. Die Nutzung einer Bridge macht es schwieriger, jedoch nicht unmöglich, für Ihren Internetprovider festzustellen, dass Sie Tor nutzen.
pt: Pontes Tor (Tor bridges), também chamadas pontes repetidoras Tor (Tor bridge relays), são pontos de entrada alternativos à rede Tor que não estão listadas publicamente. Usar uma ponte torna mais difícil, mas não impossível, para seu Provedor de Serviços de Internet, saber que você está usando Tor.

source: If you are in one of the situations described above you might want to use Tor bridges in Tails. Please also read The Tor Project's [dedicated page about bridges](https://www.torproject.org/docs/bridges) to get a general idea about what bridges are.
de: Falls Sie sich in einer der oben genannten Situationen befinden können Sie es in Erwägung ziehen, Tor Bridges in Tails zu nutzen. Bitte lesen Sie hierzu auch die [zugehörige Dokumentation zu Brigdes](https://www.torproject.org/docs/bridges) des Tor Projekts, um einen Überblick darüber zu bekommen, was Bridges sind.
pt: Se você está em uma destas situações descritas acima, pode ser que você queira usar pontes Tor no Tails. Por favor, leia a [página dedicada sobre pontes](https://www.torproject.org/docs/bridges) do projeto Tor, para ter uma dieia geral do que são as pontes.

source: In order to use bridges, you must know in advance the address of at least one bridge. The Tor Project distributes bridge addresses in several ways, for example from their [website](https://bridges.torproject.org/) and via email.
de: Um Bridges zu benutzen, müssen Sie im Vorfeld eine Adresse von zumindest einer Bridge kennen. Das Tor Projekt verteilt diese auf verschiedenste Art und Weise, beispielsweise auf ihrer [Website](https://bridges.torproject.org/) als auch über E-Mail.
pt: Para usar pontes, você tem que saber de antemão o endereço de ao menos uma ponte. O projeto Tor distribui endereços de pontes de diversas maneiras, por exemplo a partir do [website](https://bridges.torproject.org/) e por email.

source: Bridges are less reliable and tend to have lower performance than other entry points.
de: Bridges sind unzuverlässiger und neigen dazu eine niedrigere Kapazität als andere Eingangspunkte ins Tor Netzwerk zu haben.
pt: Pontes são menos confiáveis e têm a tendência de ter um desempenho pior do que que outros pontos de entrada.

source: How to use bridges in Tails
de: Wie Bridges in Tails benutzt werden
pt: Como usar pontes no Tails

source: You must have at hand at least one bridge address before starting Tails. For example, you can write it down on a piece of paper or store it in the [[persistent volume|doc/first_steps/persistence]].
de: Sie müssen zumindest eine Adresse einer Bridge zur Verfügung haben, bevor Sie Tails starten. Sie können die Adresse zum Beispiel auf einem Papier aufschreiben oder sie im [[beständigen Speicherbereich|doc/first_steps/persistence]] speichern.
pt: Você precisa ter ao menos um endereço de ponte antes de iniciar o Tails. Por exemplo, você pode escrevê-lo em um pedaço de papel ou armazená-lo no [[volume persistente|doc/first_steps/persistence]].

source: Tails allows you to use bridges of the following types:
de: Tails bietet Ihnen die Möglichkeit folgende Arten von Bridges zu benutzen:
pt: O Tails permite que você use pontes dos seguintes tipos:

source: To use bridges, choose to configure bridge settings from [[<span class="application">Tails Greeter</span>|startup_options#tails_greeter]] as explained in the [[network configuration|network_configuration]] documentation.
de: Um Bridges zu benutzen, konfigurieren Sie bitte die Bridge-Einstellungen vom [[<span class="application">Tails Greeter</span>|startup_options#tails_greeter]], wie es in der Dokumentation zur [[Netzwerkkonfiguration|network_configuration]] erklärt wird.
pt: Para usar pontes, escolha para configurar as preferências de ponte a partir do [[<span class="application">Tails Greeter</span>|startup_options#tails_greeter]] como explicado na documentação de [[configuração de rede|network_configuration]].

source: If using Tor is dangerous in your country
de: Falls die Nutzung von Tor in Ihrem Land gefährlich ist
pt: Se usar Tor é perigoso em seu país

source: The Tor Project's [documentation on bridges](https://www.torproject.org/docs/bridges) mainly focuses on censorship circumvention, this means when the usage of Tor is blocked by censorship. If using Tor is dangerous or considered suspicious in your country, then there are some extra rules that you should follow in order to prevent you from being identified as a Tor user.
de: Die [Dokumentation zu Bridges](https://www.torproject.org/docs/bridges) des Tor Projekts ist hauptsächlich auf die Umgehung von Zensur ausgelegt, also wenn die Nutzung von Tor durch Zensur verhindert wird. Falls die Nutzung von Tor in Ihrem Land gefährlich ist oder als verdächtig eingestuft wird, müssen Sie einige spezielle Regeln befolgen, damit Sie nicht als Nutzer von Tor erkannt werden.
pt: A [documentação sobre pontes](https://www.torproject.org/docs/bridges) do Projeto Tor foca principalmente em como contornar a censura, ou seja, quando o uso do Tor é bloqueado por censura. Se o uso do Tor é perigoso ou considerado suspeito em seu país, então existem algumas regras a mais que você deve seguir para evitar que você seja identificado com um/a usuário/a Tor.

source: Bridges are important tools that work in many cases but <strong>they are not an absolute protection</strong> against the technical progress that an adversary could do to identify Tor users.
de: Bridges sind wichtige Werkzeuge, die in den meisten Fällen funktionieren, bieten jedoch <strong>keine vollkommene Sicherheit</strong> gegen die technischen Abläufe, die ein Angreifer anwenden kann, um Nutzer von Tor zu identifizieren.
pt: Pontes são ferramentas importantes que funcionam em muitos casos, mas <strong>elas não são uma proteção absoluta</strong> contra o progresso técnico que um adversário poderia realizar para identificar usuários/as Tor.

source: Always start Tails in *bridge mode*.
de: Starten Sie Tails immer im *Bridge-Modus*.
pt: Sempre inicie em *modo ponte* (bridge mode).

source: Only use [*obfuscated bridges*](https://www.torproject.org/docs/bridges#PluggableTransports) since they are harder to identify than other bridges.
de: Benutzen Sie nur [*verschleierte Bridges*](https://www.torproject.org/docs/bridges#PluggableTransports), da diese schwieriger als andere Bridges zu erkennen sind.
pt: Somente use [*pontes ofuscadas*](https://www.torproject.org/docs/bridges#PluggableTransports) uma vez que elas são mais difíceis de identificar do que outras pontes.

source: The less publicly known the bridges are, the better. Unfortunately, since some bridge addresses can be obtained by anyone from the Tor website or by email, it is also possible for an adversary to get the same bridge information by the same means. The Tor Project has some protection against that, but they are far from being perfect.
de: Je weniger Bridges öffentlich bekannt sind, umso besser. Bedauerlicherweise, da einige Adressen von Bridges von jedem über die Tor Webseite oder über E-Mail herausgefunden werden können, kann ein Angreifer die gleichen Informationen über dieselben Wege bekommen. Das Tor Projekt hat einige Sicherheitsvorkehrungen dagegen, diese sind jedoch weit davon entfernt, perfekt zu sein.
pt: Quanto menos publicamente conhecidas as pontes forem, melhor. Infelizmente, uma vez que alguns endereços de pontes podem ser obtidos por qualquer um a partir do sítio do Tor ou por email, também é possível para um adversário obter as mesmas informações sobre pontes por outros meios. O projeto Tor possui algumas proteções contra isso, mas elas estão longe de serem perfeitas.

source: So the best is if you can find a trusted friend or an organisation in a different country who runs a "private" *obfuscated bridge* for you. In this case "private" means that the bridge is configured with the option `PublishServerDescriptor 0`. Without this option The Tor Project can learn about the bridge and may distribute its address to others and so it could end up in the hands of your adversary.
de: Deswegen ist es am Besten, wenn Sie einen Freund oder eine Organistation in einem anderen Land finden, denen Sie vertrauen, die eine "private" *verschleierte Bridge* für Sie betreiben. In diesem Falle bedeutet "privat", dass die Bridge mit der Option `PublishServerDescriptor 0` konfiguriert ist. Ohne diese Option erhält das Tor Projekt Informationen über diese Bridge und kann die Adresse weitergeben, wodurch sie in die Hände eines Angreifers geraten könnte.
pt: Então, o melhor é se você conseguir encontrar um/a amigo/a confiável ou uma organização em um país diferente que rode uma *ponte ofuscada* "privada" para você. Neste caso, "privada" significa que a ponte está configurada com a opção `PublishServerDescriptor 0`. Sem esta opção, o Projeto Tor terá conhecimento sobre esta ponte e poderá distribuir seu endereço para outras pessoas, e assim ela poderia cair nas mãos do seu adversário.
