Repository: vjrj/tails
Catalog: wiki/src/doc/first_steps/reset/linux.*.po
Languages: pt

source: [[!meta title="Resetting a USB stick or SD card using Linux"]]
pt: [[!meta title="Resetando uma memória USB ou um cartão SD no Linux"]]

source: [[!inline pages="doc/first_steps/usb_reset.intro" raw="yes"]]
pt: [[!inline pages="doc/first_steps/usb_reset.intro.pt" raw="yes"]]

source: Using <span class="application">GNOME Disk Utility</span>
pt: Usando o <span class="application">Utilitário de Disco do GNOME</span>

source: <strong>You might overwrite any hard drive on the computer.</strong> If at some point you are not sure about which device to choose, stop proceeding.
pt: <strong>Você pode sobrescrever qualquer disco rígido no seu computador.</strong> Se em algum ponto você não tiver certeza de qual dispositivo escolher, interrompa o procedimento.

source: Make sure that the USB stick or SD card that you want to reset is unplugged.
pt: Tenha certeza de que a memória USB ou o cartão SD que você quer resetar estejam desconectados.

source: A list of all the storage devices on the computer appears in the left pane of the window.
pt: Uma lista com todos os dispositivos de armazenamento conectados ao computador aparecerá no painel esquedo da janela.

source: Plug the USB stick or SD card that you want to reset.
pt: Conecte a memória USB ou o cartão SD que você quer resetar.

source: A new device appears in the list of storage devices. This new device corresponds to the USB stick or SD card that you plugged in. Click on it.
pt: Um novo dispositivo aparecerá na lista no painel esquerdo da janela. Este novo dispositivo corresponde à memória USB ou ao cartão SD que você acabou de conectar. Clique nele.

source: In the right pane of the window, verify that the device corresponds to the device that you want to reset, its brand, its size, etc.
pt: No painel à direita da janela, verifique que o dispositivo corresponde ao dispositivo que você quer resetar (sua marca, tamanho, etc).

source: In the popup window, choose <span class="guilabel">Master Boot Record</span> from the <span class="guilabel">Scheme</span> drop-down list. Then click on the <span class="button">Format</span> button.
pt: Na janela que aparecerá, escolha <span class="guilabel">Master Boot Record</span> a partir da lista de opções <span class="guilabel">Esquema</span>. Em seguida clique no botão <span class="button">Formatar</span>.

source: In the confirmation dialog, click on the <span class="button">Format</span> button to confirm.
pt: Na caixa de diálogo de confirmaao, clique no botão <span class="button">Formatar</span> para confirmar.

source: To make sure that all the changes are written to the device, click on the <span class="button">Safe Removal</span> button in the right pane.
pt: Para ter certeza de que todas as mudanças serão escritas no dispositivo, clique no botão <span class="button">Remover de forma segura</span> no painel à direita.

source: Resetting a Tails device from itself
pt: Resetando um dispositivo com Tails a partir dele próprio

source: If Tails is your only Linux system, you can generally reset a Tails USB stick or SD card directly from that device while running Tails.
pt: Se o Tails for seu único sistema Linux, você pode geralmente resetar uma memória USB ou um cartão SD com Tails diretamente a partir do dispositivo que está rodando o Tails.

source: When starting Tails, add the <span class="command">toram</span> boot option in the <span class="application">boot menu</span>. For detailed instructions, see the documentation on [[using the <span class="application">boot menu</span>|startup_options#boot_menu]].
pt: Quando iniciar o Tails, adicione a opção de boot <span class="command">toram</span> no <span class="application">meno de boot</span>. Para instruções detalhadas, veja a documentação sobre [[como usar o <span class="application">menu de boot</span>|startup_options#boot_menu]].

source: If Tails starts as usual, follow the instructions for [[resetting a USB stick or SD card using <span class="application">Disk Utility</span>|linux#disk_utility]].
pt: Se o Tails for iniciado da forma usual, siga as instruções para [[resetar uma memória USB ou um cartão SD utilizando o <span class="application">Utilitário de Disco</span>|linux#disk_utility]].

source: **If the system fails to start**, that means that the computer does not have enough memory for this operation mode. Try with another computer, or find another Linux system, such as another Tails device, to do the reset from.
pt: ***Se o sistema falhar em iniciar***, isto significa que o computador não possui memória suficiente para este modo de operação. Tente com um outro computador, ou encontre um outro sistema Linux, como por exemplo um outro dispositivo com Tails, para resetar a partir dele.
