Repository: vjrj/tails
Catalog: wiki/src/doc/first_steps/reset/windows.*.po
Languages: pt

source: [[!meta title="Resetting a USB stick or SD card using Windows"]]
pt: [[!meta title="Resetando uma memória USB ou um cartão SD no Windows"]]

source: [[!inline pages="doc/first_steps/usb_reset.intro" raw="yes"]]
pt: [[!inline pages="doc/first_steps/usb_reset.intro.pt" raw="yes"]]

source: <strong>The following instructions do not work on Windows XP.</strong><br/> The version of <span class="application">Diskpart</span> on Windows XP does not list removable disks.
pt: <strong>As instruções a seguir não funcionam no Windows XP.</strong><br/> A versão do <span class="application">Diskpart</span> no Windows XP não lista discos removíveis.

source: Using <span class="application">Diskpart</span>
pt: Usando <span class="application">Diskpart</span>

source: <strong>You might overwrite any hard drive on the computer.</strong><br/> If at some point you are not sure about the disk number, stop proceeding.
pt: <strong>Você pode sobrescrever qualquer disco rígido no seu computador.</strong> Se em algum ""ponto você não tiver certeza de qual dispositivo escolher, interrompa o procedimento.

source: Make sure that the USB stick or SD card that you want to reset is unplugged.
pt: Tenha certeza de que a memória USB ou o cartão SD que você quer resetar estejam desconectados.

source: Click on the <span class="button">Start</span> button, and choose <span class="menuchoice">All Programs&nbsp;▸ Accessories&nbsp;▸ Command Prompt</span>, to open the <span class="application">[[!wikipedia Command Prompt]]</span>,
pt: Clique no botão <span class="button">Iniciar</span>, e escolha <span class="menuchoice">Todos os programas&nbsp;▸ Acessórios&nbsp;▸ Prompt de Comando</span>, para abrir o <span class="application">[[!wikipedia Command Prompt]]</span>,

source: [[More help on how to start the <span class="application">Command Prompt</span>|http://www.computerhope.com/issues/chdos.htm]]
pt: [[Mais informações sobre como iniciar o <span class="application">Command Prompt</span>|http://www.computerhope.com/issues/chdos.htm]]

source: 2. Execute the <span class="command">diskpart</span> command, to start <span class="application">Diskpart</span>.
pt: 2. Execute o comando <span class="command">diskpart</span>, para iniciar o <span class="application">Diskpart</span>.

source: Execute the <span class="command">list disk</span> command to obtain information about each disk in the computer.
pt: Execute o comando <span class="command">list disk</span> para obter informações sobre cada disco em seu computador.

source: For example:
pt: Por exemplo:

source: Plug the USB stick or SD card that you want to reset. Run the <span class="command">list disk</span> command again.
pt: Conecte a memória USB ou cartão SD que você quer resetar. Execute o comando <span class="command">list disk</span> novamente.

source: A new disk, which corresponds to that device, appears in the list.
pt: Um novo disco, que corresponde àquele dispositivo, aparecerá na lista.

source: For example:
pt: Por exemplo:

source: Make sure that its size corresponds to the size of the device that you want to reset. Note down the disk number assigned by <span class="application">Diskpart</span> to the device.
pt: Tenha certeza de que o tamanho corresponde ao tamanho do dispositivo que você quer resetar. Anote o número do disco designado pelo <span class="application">Diskpart</span> para o dispositivo.

source: To select the device, execute the following command: <span class="command">select disk=<span class="replaceable">number</span></span>. Replace <span class="replaceable">number</span> by the disk number of the device that you want to reset.
pt: Para selecionar o dispositivo, execute o seguinte comando: <span class="command">select disk=<span class="replaceable">número</span></span>. Substitua <span class="replaceable">número</span> pelo número do disco que você quer resetar.

source: Execute the <span class="command">clean</span> command to delete the partition table from the device.
pt: Execute o comando <span class="command">clean</span> para remover todas as partições do dispositivo.

source: Execute the <span class="command">convert mbr</span> command to create a new partition table on the device.
pt: Execute o comando <span class="command">convert mbr</span> para instalar uma partição no dispositivo.

source: Execute the <span class="command">create partition primary</span> command to create a new primary partition on the device.
pt: Execute o comando <span class="command">create partition primary</span> para criar uma nova partição primária no dispositivo.

source: Troubleshooting
pt: Resolução de problemas

source: See the [[Diskpart documentation from Microsoft Support|http://support.microsoft.com/kb/300415]].
pt: Veja a [[documentação do Diskpart no Suporte da Microsoft|http://support.microsoft.com/kb/300415]].
