Repository: vjrj/tails
Catalog: wiki/src/doc/about/finances.*.po
Languages: pt

source: [[!meta title="Finances"]]
pt: [[!meta title="Finanças"]]

source: Income statement for 2013
pt: Declaração de renda de 2013

source: Revenues: $-21000.00000 NDI $-20000.00000 Tor (bounties program) -29.58 btc bitcoin -330.000000€ tax -------------------- $-41000.00000 -29.58 btc -330.000000€
pt: Receita: $-21000.00000 NDI $-20000.00000 Tor (programa de doações) -29.58 btc bitcoin -330.000000€ impostos -------------------- $-41000.00000 -29.58 btc -330.000000€

source: Expenses: 60.000000€ banking $17000.00000 bounties $1194.69000 hardware 499.650000€ hardware 390.000000€ hosting 2341.000000€ meeting $21000.00000 work -------------------- $39194.69000 3290.650000€
pt: Despesas: 60.000000€ banco $17000.00000 doações $1194.69000 hardware 499.650000€ hardware 390.000000€ hospedagem 2341.000000€ encontro $21000.00000 trabalho -------------------- $39194.69000 3290.650000€

source: Income statement for 2012
pt: Declaração de renda de 2012

source: Revenues: -137.30€ tax -------------------- -137.30€
pt: Receita: -137.30€ imposto -------------------- -137.30€

source: Expenses: $3810.71000 hardware 856.79€ hardware 300.00€ hosting 3128.39€ meeting $479.00000 ssl -------------------- $4289.71000 4285.18€
pt: Despesas: $3810.71000 hardware 856.79€ hardware 300.00€ hospedagem 3128.39€ encontro $479.00000 ssl -------------------- $4289.71000 4285.18€

source: In addition, one developer was paid full-time by the Tor Project, and NDI sponsored 40 days of development work.
pt: Adicionalmente, um desenvolvedor foi pago por tempo integral pelo projeto Tor, e a NDI patrocinou 40 dias de trabalho de desenvolvimento.

source: Income statement for 2011
pt: Declaração de renda de 2011

source: Revenues: -7500.00€ Tor -------------------- -7500.00€
pt: Receita: -7500.00€ Tor -------------------- -7500.00€

source: Expenses: $555.00000 hardware 1075.00€ hosting 3163.32€ meeting -------------------- $555.00000 4238.32€
pt: Despesas: $555.00000 hardware 1075.00€ hospedagem 3163.32€ encontro -------------------- $555.00000 4238.32€

source: Income statement for 2010
pt: Declaração de renda de 2010

source: Revenues: $-8500.00000 Tor -------------------- $-8500.00000
pt: Receita: $-8500.00000 Tor -------------------- $-8500.00000

source: Expenses: 2025.00€ hardware -------------------- 2025.00€
pt: Despesas: 2025.00€ hardware -------------------- 2025.00€
