Repository: vjrj/tails
Catalog: wiki/src/doc/about/tor.*.po
Languages: de, pt

source: [[!meta title="Why does Tails use Tor?"]]
de: [[!meta title="Wieso nutzt Tails Tor?"]]
pt: [[!meta title="Por que o Tails utiliza Tor?"]]

source: Tails uses Tor because it is the best available anonymity network.
de: Tails benutzt Tor, da dieses das beste verfügbare Anonymisierungsnetzwerk ist.
pt: Tails utiliza Tor porque é a melhor rede de anonimato disponível.

source: Anonymity enforcement
de: Ermöglichung von Anonymität
pt: Anonimato forçado

source: We want to enforce good security by default for our users. That is why it is a fundamental assumption of Tails to force all outgoing traffic to anonymity networks such as Tor.
de: Wir wollen unseren Nutzern standardmäßig eine gute Sicherheit bieten. Deswegen ist es für Tails selbstverständlich, dass sämtlicher ausgehender Datenverkehr durch Anonymisierungsnetzwerke wie Tor geleitet wird.
pt: Nós queremos forçar uma boa segurança por padrão para nossos usuários. É por isto que é uma pretensão do Tails forçar todo o tráfego de saída por redes de anonimato como Tor.

source: Over the years Tor has become a big network with a lot of capacity and a good speed.
de: Im Laufe der Jahre ist Tor zu einem großen Netzwerk mit einer großen Kapazität und Geschwindigkeit gewachsen.
pt: Ao longo dos anos, Tor se tornou uma grande rede com bastante capacidade e boa velocidade.

source: Virtual Private Networks (VPNs) could be faster than Tor but they are not anonymity networks, because the administrators of the VPN can know both where you are connecting from and where you are connecting to and break your anonymity. Tor provides anonymity by making it impossible for a single point in the network to know both the origin and the destination of a connection.
de: Virtuelle Private Netze (VPNs) können schneller als Tor sein, sind jedoch keine Anonymisierungsnetzwerke, da der Administrator des VPNs wissen kann, von wo und wohin Sie sich verbinden und somit Ihre Anonymität nicht gewährleistet ist. Tor bietet Ihnen Anonymität, indem kein Teilnehmer des Netzwerkes sowohl Herkunft als auch Ziel einer Verbindung weiß.
pt: Redes Virtuais Privadas (VPNs) poderiam ser mais rápidas que o Tor, mas elas não são redes de anonimato, porque os administradores de uma VPN podem saber tanto de onde você está se conectando quanto para onde você está se conectando e assim quebrar seu anonimato. Tor provê anonimato ao tornar impossível para um único ponto na rede saber tanto a origem quanto o destino de uma conexão.

source: When using a VPN, an attacker can also break your anonymity by monitoring the incoming and outgoing connections of the few servers of the VPN. On the other hand, the Tor network is formed by over 5000 relays run worldwide by volunteers.
de: Wenn Sie ein VPN benutzen kann ein Angreifer Sie enttarnen, indem er die ein- und ausgehenden Verbindungen der wenigen Server des VPN's mitschneidet. Im Gegensatz dazu besteht das Tor-Netzwerk aus über 5000 Relays (Servern), die von Freiwilligen betrieben werden.
pt: Ao usar uma VPN, um atacante também pode quebrar seu anonimato ao monitorar as conexões de entrada e de saída de alguns servidores da VPN. Por outro lado, a rede Tor é formada por mais de 5000 repetidores mantidos ao redor do mundo por voluntários.

source: User base
de: Nutzerbasis
pt: Base de usuários

source: Tor is the anonymity network with the largest user base. More than 700&thinsp;000 users connected to Tor daily in 2013. Being adopted by such a large audience proves its maturity, stability, and usability.
de: Tor ist das Anonymitätsnetzwerk mit der größten Nutzerbasis. Im Jahr 2013 verbanden sich mehr als 700&thinsp;000 Nutzer mit Tor. Solch eine große Akzeptanz und Verbreitung beweisen die Reife, Stabilität und Benutzerfreundlichkeit von Tor.
pt: Tor é a rede de anonimato com a maior base de usuários. Mais de 700&thinsp;000 usuários se conectaram ao Tor diariamente em 2013. Sendo adotado por tão amplo público prova sua maturidade, estabilidade e usabilidade.

source: Tor is being used equally by journalists, law enforcement, governments, human rights activists, business leaders, militaries, abuse victims and average citizens concerned about online privacy. This diversity actually provides stronger anonymity to everyone as it makes it more difficult to identify or target a specific profile of Tor user. Anonymity loves company.
de: Tor wird gleichermaßen von Journalisten, Strafverfolgungsbehörden, Regierungen, Menschenrechtsaktivisten, Geschäftsführern, dem Militär, Missbrauchsopfern und normalen Bürgern, die sich um ihre Privatsphäre sorgen, benutzt. Diese Vielfalt bietet eine verbesserte Anonymität für alle, da es dadurch schwieriger wird, einen bestimmten Nutzer zu identifizieren bzw. ins Visier zu nehmen. Anonymität liebt und braucht Gesellschaft.
pt: Tor está sendo usado igualmente por jornalistas, agentes da lei, governos, ativistas de direitos humanos, líderes de negócios, militares, vítimas de abuso e cidadãos medianos preocupados com sua privacidade online. Esta diversidade atualmente provê anonimato mais forte para todos da mesma forma que mais difícil identificar ou encontrar um perfil específico de um usuário Tor. O anonimato adora companhia.

source: Technical merits and recognition
de: Technische Vorzüge und Anerkennung
pt: Méritos técnicos e reconhecimento

source: Tor has partnered with leading research institutions, and has been subjected to intensive academic research. It is the anonymity network which benefits from the most auditing and peer review.
de: Tor hat mit führenden Forschungsinstituten kooperiert und wurde dabei intensiven wissenschaftlichen Untersuchungen unterzogen. Das Anonymitätsnetzwerk profitiert von solchen Untersuchungen und Begutachtungen.
pt: Tor se associou com instituições de pesquisa de ponta, e tem sido sujeito a pesquisa acadêmica intensiva. É a rede de anonimato que tem se beneficiado da maior parte da auditagem e revisão por pares.

source: Tor has been received awards by institutions such as the [Electronic Frontier Foundation](https://www.eff.org/awards/pioneer/2012), and the [Free Software Foundation](https://www.fsf.org/news/2010-free-software-awards-announced) to name a few.
de: Tor hat mehrere Auszeichnungen von Institutionen wie der [Electronic Frontier Foundation](https://www.eff.org/awards/pioneer/2012) und der [Free Software Foundation](https://www.fsf.org/news/2010-free-software-awards-announced) erhalten, nur um einige zu nennen.
pt: Tor recebeu prêmios de instituições como a [Electronic Frontier Foundation](https://www.eff.org/awards/pioneer/2012) e a [Free Software Foundation](https://www.fsf.org/news/2010-free-software-awards-announced), para nomear apenas algumas.

source: An extract of a Top Secret appraisal by the NSA characterized Tor as "[the King of high secure, low latency Internet anonymity](http://www.theguardian.com/world/interactive/2013/oct/04/tor-high-secure-internet-anonymity)" with "no contenders for the throne in waiting".
de: Ein Auszug aus einer Top-Secret Studie der NSA charakterisierte Tor als "[den König der hochsicheren, latenzniedrigen Internetanonymität](http://www.theguardian.com/world/interactive/2013/oct/04/tor-high-secure-internet-anonymity)" mit "keinem Anwärter für die Thronfolge".
pt: Um resumo de uma avaliação secreta feita pela NSA caracterizou o Tor como "[o Rei do anonimato de alta segurança e baixa latência na Internet](http://www.theguardian.com/world/interactive/2013/oct/04/tor-high-secure-internet-anonymity)", que "não tem outros competidores pelo trono".

source: Relationship between Tor and Tails
de: Verhältnis von Tor und Tails
pt: Relacionamento entre Tor e Tails

source: The Tor software is made by [The Tor Project](https://torproject.org/).
de: Die Tor Software wird vom [Tor Projekt](https://torproject.org/) entwickelt.
pt: O programa Tor é mantido pelo [Tor Project](https://torproject.org/).

source: The Tor network is run by a worldwide community of volunteers.
de: Das Tor-Netzwerk wird von einer weltweiten Community Freiwilliger betrieben.
pt: A rede Tor é mantida por uma comunidade global de voluntários.

source: Tails is a separate project made by a different group of people.
de: Tails ist ein selbständiges Projekt, das von einer anderen Gruppe von Leuten entwickelt wird.
pt: Tails é um projeto separado, feito por um grupo diferente de pessoas.

source: Tails is a complete operating system which uses Tor as its default networking application. The Tor Project recommends the usage of Tails for the use cases that are not covered by its own projects (for example the <span class="application">Tor Browser</span>).
de: Tails ist ein vollständiges Betriebssystem, welches Tor als standardmäßiges Netzwerkprogramm nutzt. Das Tor Projekt empfiehlt die Nutzung von Tails für Nutzungszwecke, die nicht von ihrem eigenen Projekt abgedeckt werden (z.B. dem <span class="application">Tor Browser</span>).
pt: Tails é um sistema operacional completo, que usa Tor como sua aplicação de rede padrão. O Projeto Tor recomenda o uso do Tails para casos de uso que não são cobertos por seus próprios projetos (como por exemplo o <span class="application">Tor Browser</span>.

source: But many people use Tor outside of Tails, and many people use Tails to do other things than accessing the Internet through Tor, for example to work offline on sensitive documents.
de: Dennoch nutzen viele Menschen Tor unabhängig von Tails. Umgekehrt nutzen viele Menschen Tails für andere Zwecke, als sich nur durch Tor zum Internet zu verbinden, z.B. um offline an sensiblen Dokumenten zu arbeiten.
pt: Mas muitas pessoas usam Tor fora do Tails, e muitas pessoas usam Tails para fazer outras coisas além de acessar a Internet através do Tor, como por exemplo para trabalhar offline em documentos sensíveis.

source: Want more?
de: Sie wünschen mehr?
pt: Quer mais?

source: Tails also allows you to connect to [[I2P|doc/anonymous_internet/i2p/]], which is another anonymity network different from Tor.
de: Tails bietet Ihnen auch die Möglichkeit, sich mit [[I2P|doc/anonymous_internet/i2p/]] zu verbinden, welches ein anderes Anonymisierungsnetzwerk ist, und sich grundsätzlich von Tor unterscheidet.
pt: Tails também permite que você se conecte à [[I2P|doc/anonymous_internet/i2p/]], que é uma outra rede de anonimato diferente do Tor.
