Repository: vjrj/tails
Catalog: wiki/src/doc/first_steps/installation/manual/linux.*.po
Languages: fr, pt

source: [[!meta title="Manual installation using Linux"]]
fr: [[!meta title="Installer manuellement depuis Linux"]]
pt: [[!meta title="Instalação manual usando linux"]]

source: [[!inline pages="doc/first_steps/manual_usb_installation.intro" raw="yes"]]
fr: [[!inline pages="doc/first_steps/manual_usb_installation.intro.fr" raw="yes"]]
pt: [[!inline pages="doc/first_steps/manual_usb_installation.intro.pt" raw="yes"]]

source: This technique uses the command line.
fr: Cette méthode utilise les lignes de commandes.
pt: Esta técnica utiliza a linha de comando.

source: <h2 class="bullet-number-one">Install isohybrid</h2>
fr: <h2 class="bullet-number-one">Installer isohybrid</h2>
pt: <h2 class="bullet-number-one">Instale o isohybrid</h2>

source: In **Debian Wheezy**, **Ubuntu 14.04**, and earlier the `isohybrid` utility is included in the `syslinux` package. To install it, execute the following command:
fr: Dans **Debian Wheezy**, **Ubuntu 14.04**, et versions plus anciennes l'outils `isohybrid` est inclus dans le paquet `syslinux`. Pour l'installer, vous pouvez exécuter la commande suivante :

source: In **Debian Jessie**, **Ubuntu 14.10**, and later the `isohyrid` utility is included in the `syslinux-utils` package. To install it, execute the following command:
fr: Dans **Debian Jessie**, **Ubuntu 14.10**, et versions plus récentes, l'outils `isohybrid` est inclus dans le paquet `syslinux-utils`. Pour l'installer, vous pouvez exécuter la commande suivante :

source: <h2 class="bullet-number-two">Find out the device name of the device</h2>
fr: <h2 class="bullet-number-two">Trouver le nom du périphérique</h2>
pt: <h2 class="bullet-number-two">Descubra o nome do dispositivo</h2>

source: The device name should be something like `/dev/sdb`, `/dev/sdc`, etc.
fr: Le nom du périphérique devrait être quelque chose comme `/dev/sdb`, `/dev/sdc`, etc.
pt: O nome do dispositivo deve ser algo como `/dev/sdb`, `/dev/sdc`, etc.

source: If you are not sure about the exact device name, with GNOME, do the following:
fr: Si vous n'êtes pas certain du nom exact du périphérique, avec GNOME, procédez comme suit :
pt: Se você não tem certeza do nome preciso do dispositivo, no GNOME faça o seguinte.

source: Make sure that the USB stick or SD card onto which you want to install Tails is unplugged.
fr: Vérifiez que la clé USB ou carte SD sur laquelle vous souhaitez installer Tails est débranchée.
pt: Tenha certeza de que a memória USB ou cartão SD no qual você quer instalar o Tails esteja desconectada.

source: 1. Open <span class="application">GNOME Disk Utility</span> from the menu <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Accessories</span>&nbsp;▸ <span class="guimenuitem">Disk Utility</span> </span>
fr: 1. Ouvrir l'<span class="application">Utilitaire de Disque GNOME</span> depuis le menu <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Accessoires</span>&nbsp;▸ <span class="guimenuitem">Utilitaire de disque</span> </span>
pt: 1. Abra o <span class="application">Utilitário de Disco do GNOME</span> a partir do menu <span class="menuchoice"> <span class="guimenu">Aplicações</span>&nbsp;▸ <span class="guisubmenu">Acessórios</span>&nbsp;▸ <span class="guimenuitem">Utilitário de Disco</span> </span>

source: <span class="application">Disk Utility</span> lists all the current storage devices in the left pane of the window.
fr: L'<span class="application">Utilitaire de Disque</span> liste tous les périphériques de stockage actuels dans la partie gauche de la fenêtre.
pt: O <span class="application">Utilitário de Disco<span> lista todos os dispositivos de armazenamento atualmente conectados no painel esquerdo da tela.

source: Plug the USB stick or SD card onto which you want to install Tails.
fr: Branchez la clé USB ou carte SD sur laquelle vous souhaitez installer Tails
pt: Conecte a memória USB ou o cartão SD no qual você quer instalar o Tails.

source: A new device appears in the list of storage devices. Click on it.
fr: Un nouveau périphérique apparaît dans la liste. Sélectionnez-le en cliquant dessus.
pt: Um novo dispositivo aparece na lista de dispositivos. Clique nele.

source: In the right pane of the window, verify that the device corresponds to your device, its brand, its size, etc.
fr: Dans le panneau de droite, vérifiez que la description correspond à votre périphérique, la marque, la taille, etc.
pt: No painel direito da janela, verifique que a descrição do dispositivo corresponde ao seu dispositivo, sua marca, tamanho, etc.

source: [[!img destination_device_description.png link=no alt="Drive description containing: 'Device: /dev/sdc'"]]
fr: [[!img destination_device_description.fr.png link=no alt="Description du périphérique contenant: 'Périphérique: /dev/sdc'"]]
pt: [[!img destination_device_description.png link=no alt="Descrição do dispositivo contendo: 'Device: /dev/sdc'"]]

source: On this screenshot, the USB stick is a Kingston DataTraveler of 2.0 GB and its device name is `/dev/sdc`. Yours are probably different.
fr: Sur cette capture d'écran, la clé USB est une Kingston DataTraveler de 2.0 GB, et son nom de périphérique est `/dev/sdc`. Le vôtre peut être différent.
pt: Nesta captura de tela, a memória USB é um Kingston DataTraveler de 2.0 GB e seu nome de dispositivo é `/dev/sdc`. O seu provavelmente é diferente.

source: If you are not sure about the device name, you should stop proceeding or <strong>you risk overwriting any hard drive on the system</strong>.
fr: Si vous avez un doute sur le nom d'un périphérique, vous ne devriez pas utiliser les commandes suivantes, ou <strong>vous risquez d'écraser involontairement l'un de vos supports de données</strong>.
pt: Se você não tem certeza do nome do dispositivo, recomendamos parar com o procedimento pois, caso contrário, <strong>você corre o risco de escrever em cima de qualquer disco rígido do sistema</strong>.

source: <h2 class="bullet-number-three">Do the copy</h2>
fr: <h2 class="bullet-number-three">Faire la copie</h2>
pt: <h2 class="bullet-number-three">Faça a cópia</h2>

source: <p><strong>All the data on the installed device will be lost.</strong></p>
fr: <p><strong>Toutes les données du périphérique à installer seront perdues.</strong></p>

source: Execute the following commands, replacing `[tails.iso]` with the path to the ISO image that you want to copy and `[device]` with the device name found in step 2.
fr: Exécutez les commandes suivantes, en remplaçant `[tails.iso]` par le chemin de l'image ISO que vous voulez copier et `[device]` par le nom du périphérique trouvé à l'étape 2.
pt: Execute os seguintes comandos, substituindo `[tails.iso]` pelo caminho da imagem ISO que você quer copiar e `[dispositivo]` pelo nome do dispositivo encontrado no passo 2.

source: <p>Note that the <code>isohybrid</code> command modifies the ISO image. As a consequence, you won't be able to [[verify|download/#verify]] it again afterwards. We recommend you to execute those commands on a copy of the original ISO image that you downloaded.</p>
fr: <p>Notez que la commande <code>isohybrid</code> modifie l'image ISO. En conséquence, vous ne serez pas en mesure de la [[verifier|download/#verify]] à nouveau après coup. Nous vous recommandons d'effectuer cette opération sur une copie de l'image ISO originale que vous avez téléchargé.</p>

source: Here is an example of the commands to execute, yours are probably different:
fr: Voici un exemple de commande à exécuter, les vôtre sont probablement différentes :
pt: Aqui está um exemplo dos comandos a serem executados, os seus provavelmente são diferentes:

source: isohybrid '/home/amnesia/Desktop/tails-0.6.2-isohybrid.iso' -h 255 -s 63 dd if='/home/amnesia/Desktop/tails-0.6.2-isohybrid.iso' of=/dev/sdc bs=16M
fr: isohybrid '/home/amnesia/Bureau/tails-0.6.2-isohybrid.iso' -h 255 -s 63 dd if='/home/amnesia/Bureau/tails-0.6.2-isohybrid.iso' of=/dev/sdc bs=16M

source: If you are not sure about the path to the ISO image or if you get a <span class="guilabel">No such file or directory</span> error message, you can first type <code>dd</code>, followed by a space, and then drag and drop the icon of the ISO image from a file browser onto the terminal. This should insert the correct path to the ISO image in the terminal. Then complete the command and execute it.
fr: Si vous n'êtes pas sûr du chemin menant à votre image ISO ou si vous obtenez une erreur du type <span class="guilabel">No such file or directory</span>, vous pouvez d'abord taper, dans le terminal, <code>dd</code>, suivi d'un espace, et venir glisser-déposer l'icône de votre image ISO depuis le navigateur de fichiers vers le terminal. Tapez ensuite le reste de la commande et exécutez-là.
pt: Se você não tiver certeza do caminho para a imagem ISO ou se obtiver um erro <span class="guilabel">Arquivo ou diretório não encontrado</span>, você pode primeiro escrever <code>dd</code>, seguido de um espaço, e então arrastar o ícone da imagem ISO a partir de um navegador de arquivos e soltar no terminal. Isto deve inserir o caminho correto para a imagem ISO no terminal. Então, complete o comando e execute-o.

source: If you don't see any error message, Tails is being copied onto the device. The whole process might take some time, generally a few minutes.
fr: Si vous ne voyez aucun message d'erreur, Tails est en train d'être copié vers le périphérique. Ce processus peut prendre du temps, généralement quelques minutes.
pt: Se você não vir nenhuma mensagem de erro, então o Tails está sendo copiado para o dispositivo. O processo completo pode demorar algum tempo, geralmente alguns minutos.

source: <p>Once the command prompt reappears, you can shutdown your computer, and [[start Tails|start_tails]] from this new device.</p>
fr: <p>Lorsque l'invite de commande réapparait, vous pouvez éteindre l'ordinateur, et [[démarrer Tails|start_tails]] depuis ce nouveau périphérique.</p>
pt: <p>Depois que o comando terminar e retornar para o prompt de comando, você pode desligar o computador e [[iniciar o Tails|start_tails]] a partir deste novo dispositivo.</p>

source: Troubleshooting
fr: Dépannage
pt: Solução de problemas

source: dd: /dev/sdx: No such file or directory
fr: dd: /dev/sdx: No such file or directory (fichier ou dossier non trouvé)
pt: dd: /dev/sdx: Arquivo ou diretório não encontrado

source: Then double-check the name of the device you found in [[step 2|linux#step_2]].
fr: Dans ce cas, revérifiez le chemin vers l'image disque que vous avez saisi à [[l'étape 2|linux#step_2]].
pt: Verifique o nome do dispositivo que você encontrou no [[passo 2|linux#step_2]].

source: dd: /dev/sdx: Permission denied
fr: dd: /dev/sdx: Permission non accordée
pt: dd: /dev/sdx: Permissão negada

source: You might also have committed a mistake in the device name, so please double-check it. If you are sure about the device name, this could be a permission problem and you could need to gain administration privileges before running the commands in the terminal. That could be:
fr: Vous avez probablement fait une erreur concernant le nom de périphérique. Faites donc, s'il-vous-plaît, une seconde vérification. Si vous êtes sûr de vos noms de périphériques, il s'agit peut-être d'un problème de permissions. Vous aurez sans doute besoin de vous identifier en tant qu'administrateur avant de lancer la commande dans le terminal. Vous pouvez procéder ainsi :
pt: Você pode também ter cometido um erro sobre o nome do dispositivo, então por favor verifique-o novamente. Se você estiver certo/a quanto ao nome do dispositivo, isto pode ser um problema de permissões e você talvez precise obter privilégios administrativos antes de rodar estes comandos no terminal. Isto poderia ser:

source: dd: tails.iso: No such file or directory
fr: dd: tails.iso: No such file or directory (fichier ou dossier non trouvé)
pt: dd: tails.iso: Arquivo ou diretório não encontrado

source: Then you surely have committed a mistake on the path to the ISO image in [[step 3|linux#step_3]].
fr: Vous avez probablement fait une erreur concernant le chemin de votre fichier ISO à [[l'étape 3|linux#step_3]] de la seconde méthode.
pt: Neste caso você com certeza cometeu um erro no caminho para a imagem ISO no [[passo 3|linux#step_3]].

source: Under Debian or Ubuntu the `isohybrid` utility is included in the `syslinux` package. To install it, you can execute the following command:
pt: No Debian ou Ubuntu, o utilitário `isohybrid` está incluído no pacote `syslinux`. Para instalá-lo, você pode executar o seguinte comando:

source: isohybrid [tails.iso] --entry 4 --type 0x1c sudo dd if=[tails.iso] of=[device] bs=16M
pt: isohybrid [tails.iso] --entry 4 --type 0x1c sudo dd if=[tails.iso] of=[dispositivo] bs=16M
