Repository: vjrj/tails
Catalog: wiki/src/doc/first_steps/installation/manual/windows.*.po
Languages: fr, pt

source: This technique uses the Universal USB Installer, for more info or more help visit [http://www.pendrivelinux.com/](http://www.pendrivelinux.com/universal-usb-installer-easy-as-1-2-3/).
fr: Cette méthode utilise l'Universal USB Installer, pour plus d'informations ou de l'aide, voir [http://www.pendrivelinux.com/](http://www.pendrivelinux.com/universal-usb-installer-easy-as-1-2-3/).
pt: Esta técnica utiliza o *Universal USB Installer*, para mais informações ou ajuda visite [http://www.pendrivelinux.com/](http://www.pendrivelinux.com/universal-usb-installer-easy-as-1-2-3/).

source: Insert a USB stick with at least 2GB of free space
fr: Insérez une clé USB possédant au moins 2GB d'espace libre
pt: Insira uma memória USB com ao menos 2 GB de espaço livre

source: [Download the Universal USB Installer](http://www.pendrivelinux.com/universal-usb-installer-easy-as-1-2-3/)
fr: [Téléchargez l'Universal USB Installer](http://www.pendrivelinux.com/universal-usb-installer-easy-as-1-2-3/)
pt: [Baixe o Universal USB Installer](http://www.pendrivelinux.com/universal-usb-installer-easy-as-1-2-3/)

source: Click 'Run' when prompted<br/>
fr: Cliquez sur 'Run' lorsque cela s'affiche<br/>
pt: Clique em 'Run' quando for perguntado<br/>

source: [[!img windows/01-run.jpg link=no alt="Do you want to run or save this file?"]]
pt: [[!img windows/01-run.jpg link=no alt="Você quer executar ou salvar este arquivo?"]]

source: If the security dialog appears, confirm by clicking 'Run'
fr: Si une fenêtre de sécurité apparaît, confirmez en cliquant sur 'Run'
pt: Se aparecer uma caixa de diálogo de segurança, confirme clicando em 'Run'

source: [[!img windows/02-run.jpg link=no alt="The publisher could not be verified. Are you sure you want to run this software?"]]
pt: [[!img windows/02-run.jpg link=no alt="A fonte não pode ser verificada. Você está certo de que quer executar este programa?"]]

source: Read the licence agreement and choose 'I Agree' to continue
fr: Lisez la licence et choisissez 'I Agree' pour continuer
pt: Leia o acordo de licenciamento e escolha 'I Agree' para continuar

source: [[!img windows/03-license-agreement.png link=no alt="License Agreement"]]
pt: [[!img windows/03-license-agreement.png link=no alt="Acordo de Licenciamento"]]

source: [[!img windows/04-select-tails.png link=no alt="Step 1: Select a Linux Distribution from the dropdown to put on your USB"]]
pt: [[!img windows/04-select-tails.png link=no alt="Passo 1: Selecione uma distribuição de Linux da lista de opções para gravar em seu USB"]]

source: Click 'Browse' and open the downloaded ISO file
fr: Cliquez sur 'Browse' et ouvrez le fichier ISO téléchargé
pt: Clique em 'Browse' e abra o arquivo ISO baixado

source: [[!img windows/05-browse-iso.png link=no alt="Step 2: Select your tails*.iso"]]
pt: [[!img windows/05-browse-iso.png link=no alt="Passo 2: selecione o arquivo tails*.iso"]]

source: Choose the USB drive
fr: Choisissez le lecteur USB
pt: Escolha o dispositivo USB

source: [[!img windows/06-choose-drive.png link=no alt="Step 3: Select your USB Flash Drive Letter Only"]]
pt: [[!img windows/06-choose-drive.png link=no alt="Passo 3: Selecione somente a letra do seu dispositivo USB"]]

source: Click 'Create'
fr: Cliquez sur 'Create'
pt: Clique em 'Create'

source: [[!img windows/07-create.png link=no alt="Create"]]
pt: [[!img windows/07-create.png link=no alt="Criar"]]

source: <p>After the installation completes, you can [[start Tails|start_tails]] from this new USB stick.</p>
fr: <p>Une fois l'installation terminée, vous pouvez [[démarrer Tails|start_tails]] depuis cette nouvelle clé USB.</p>
pt: <p>Depois que o comando terminar e retornar para o prompt de comando, você poderá [[iniciar o Tails|start_tails]] a partir desta nova memória USB.</p>

source: [[!meta title="Manual installation using Windows"]]
fr: [[!meta title="Installation manuelle depuis Windows"]]

source: [[!inline pages="doc/first_steps/manual_usb_installation.intro" raw="yes"]]
fr: [[!inline pages="doc/first_steps/manual_usb_installation.intro.fr" raw="yes"]]

source: <div class="note"> You will need version 1.9.5.4 or later. </div>
fr: <div class="note"> Vous devez utiliser la version 1.9.5.4 ou supérieure. </div>

source: Select Tails from the dropdown list
fr: Choisissez Tails depuis la liste déroulante

source: Then safely remove the USB stick from the computer.
fr: Enlevez ensuite en toute sécurité la clé USB de l'ordinateur.
