Repository: vjrj/tails
Catalog: wiki/src/news/test_1.3-rc1.*.po
Languages: fr

source: [[!meta title="Call for testing: 1.3~rc1"]]
fr: [[!meta title="Appel à tester Tails 1.3~rc1"]]

source: You can help Tails! The first release candidate for the upcoming version 1.3 is out. Please test it and see if it works for you.
fr: Vous pouvez aider Tails ! La première version candidate pour la version Tails 1.3 à venir est sortie. Merci de la tester et de voir si tout fonctionne pour vous.

source: How to test Tails 1.3~rc1?
fr: Comment tester Tails 1.3~rc1?

source: **Keep in mind that this is a test image.** We have made sure that it is not broken in an obvious way, but it might still contain undiscovered issues.
fr: **Gardez à l'esprit que c'est une image de test.** Nous nous sommes assurés qu'elle n'est pas corrompue d'une manière évidente, mais elle peut toujours contenir des problèmes non découverts.

source: Either try the <a href="#automatic_upgrade">automatic upgrade</a>, or download the ISO image and its signature:
fr: Vous pouvez soit essayer la <a href="#automatic_upgrade">mise à jour automatique</a>, soit télécharger l'image ISO et sa signature :

source: <a class="download-file" href="http://dl.amnesia.boum.org/tails/alpha/tails-i386-1.3~rc1/tails-i386-1.3~rc1.iso">Tails 1.3~rc1 ISO image</a>
fr: <a class="download-file" href="http://dl.amnesia.boum.org/tails/alpha/tails-i386-1.3~rc1/tails-i386-1.3~rc1.iso">Image ISO de Tails 1.3~rc1</a>

source: <a class="download-signature" href="https://tails.boum.org/torrents/files/tails-i386-1.3~rc1.iso.sig">Tails 1.3~rc1 signature</a>
fr: <a class="download-signature" href="https://tails.boum.org/torrents/files/tails-i386-1.3~rc1.iso.sig">Signature de Tails 1.3~rc1</a>

source: [[Verify the ISO image|download#verify]].
fr: [[Vérifiez l'image ISO|download#verify]].

source: Have a look at the list of <a href="#known_issues">known issues of this release</a> and the list of [[longstanding known issues|support/known_issues]].
fr: Jetez un œil à la liste des <a href="#known_issues">problèmes connus de cette version</a> et à la liste des [[problèmes connus de longue date|support/known_issues]].

source: Test wildly!
fr: Testez à volonté !

source: If you find anything that is not working as it should, please [[report to us|doc/first_steps/bug_reporting]]! Bonus points if you first check if it is a <a href="#known_issues">known issue of this release</a> or a [[longstanding known issue|support/known_issues]].
fr: Si vous découvrez quelque chose qui ne fonctionne pas comme prévu, merci de [[nous le rapporter|doc/first_steps/bug_reporting]] ! Points bonus si vous vérifiez que ce n'est pas un <a href="#known_issues">problème connu de cette version</a> ou un [[problème connu de longue date|support/known_issues]].

source: These steps allow you to automatically upgrade a device installed with <span class="application">Tails Installer</span> from Tails 1.2.3 to Tails 1.3~rc1.
fr: Ces étapes vous permettent de mettre à jour automatiquement un périphérique installé avec l'<span class="application">Installeur de Tails</span> depuis Tails 1.2.3 vers Tails 1.3~rc1.

source: Start Tails 1.2.3 from a USB stick or SD card (installed by the Tails Installer), and [[set an administration password|doc/first_steps/startup_options/administration_password]].
fr: Démarrer Tails 1.2.3 depuis une clé USB ou une carte SD (installée avec l'Installeur de Tails), et [[définir un mot de passe d'administration|doc/first_steps/startup_options/administration_password]].

source: Run this command in a <span class="application">Root Terminal</span> to select the "alpha" upgrade channel and start the upgrade:
fr: Lancez cette commande dans un <span class="application">Terminal administrateur</span> pour sélectionner le canal "alpha" de mise à jour et la lancer :

source: What's new since 1.2.3?
fr: Quoi de neuf depuis la version 1.2.3 ?

source: Notable changes since Tails 1.2.3 include:
fr: Les changements visibles depuis Tails 1.2.3 comprennent :

source: * Major new features - Distribute a hybrid ISO image again: no need for anyone to manually run `isohybrid` anymore! ([[!tails_ticket 8510]]) - Confine the Tor Browser using AppArmor to protect against some types of attack. [Learn more](https://git-tails.immerda.ch/tails/plain/wiki/src/doc/anonymous_internet/Tor_Browser.mdwn?h=testing) about how this will affect your usage of Tails. ([[!tails_ticket 5525]]) - Install the Electrum bitcoin client, and allow users to persist their wallet. ([[!tails_ticket 6739]])
fr: * Nouvelles fonctionnalités majeures - Distribution à nouveau d'une image ISO hybride : plus besoin de lancer `isohybrid` à la main ! ([[!tails_ticket 8510]]) - Confinement de Tor Browser via AppArmor pour se protéger de certains types d'attaques. [En savoir plus](https://git-tails.immerda.ch/tails/plain/wiki/src/doc/anonymous_internet/Tor_Browser.mdwn?h=testing) sur ce que ça changera dans votre usage de Tails. ([[!tails_ticket 5525]]) - Installation du client bitcoin Electrum, et possibilité de rendre le portefeuille persistant. ([[!tails_ticket 6739]])

source: * Minor improvements - Support obfs4 Tor bridges ([[!tails_ticket 7980]]) - Touchpad: enable tap-to-click, 2-fingers scrolling, and disable while typing. ([[!tails_ticket 7779]]) - Support Vietnamese input in IBus. ([[!tails_ticket 7999]]) - Improve support for OpenPGP smartcards. ([[!tails_ticket 6241]])
fr: * Améliorations mineures - Prise en charge des bridge Tor obfs4 ([[!tails_ticket 7980]]) - Pavé tactile : activation du toucher-pour-cliquer, défilement à deux doigts, et désactivation lors d'utilisation du clavier. ([[!tails_ticket 7779]]) - Prise en charge du Vietnamien avec IBus. ([[!tails_ticket 7999]]) - Amélioration de la prise en charge des smartcards OpenPGP. ([[!tails_ticket 6241]])

source: See the <a href="https://git-tails.immerda.ch/tails/plain/debian/changelog?id=ca9705874a4380db51a85aaddf5309580fd3e04e">online Changelog</a> for technical details.
fr: Voir le <a href="https://git-tails.immerda.ch/tails/plain/debian/changelog?id=ca9705874a4380db51a85aaddf5309580fd3e04e"> journal des modifications en ligne</a> pour les détails techniques.

source: Known issues in 1.3~rc1
fr: Problèmes connus de la version 1.3~rc1

source: [[Longstanding known issues|support/known_issues]]
fr: [[Problèmes connus de longue date|support/known_issues]]

source: Required persistent configuration updates
fr: Mise à jour de la configuration de la persistance requise

source: If you have the Pidgin persistence preset enabled, then you perform the following manual steps to make it open links in the Tor Browser:
fr: Si vous avez la persistance de Pidgin activée, vous devrez alors faire ce qui suit pour qu'il puisse ouvrir les liens dans le Tor Browser :

source: Start Tails
fr: Démarrer Tails

source: Enable persistence without the read-only option
fr: Activer la persistance sans l'option de lecture seule

source: Start Pidgin
fr: Lancer Pidgin

source: * Choose <span class="menuchoice"> <span class="guimenu">Tools</span>&nbsp;▸ <span class="guimenuitem">Preferences</span> </span> * Click the <span class="guilabel">Browser</span> tab * Type `/usr/local/bin/tor-browser %s` in the <span class="guilabel">Manual</span> field * Click the <span class="button">Close</span> button
fr: * Choisir <span class="menuchoice"> <span class="guimenu">Outils</span>&nbsp;▸ <span class="guimenuitem">Préférences</span> </span> * Cliquer sur l'onglet <span class="guilabel">Navigateur</span> * Taper `/usr/local/bin/tor-browser %s`dans le champ <span class="guilabel">Manuel</span> * Cliquer sur le bouton <span class="button">Fermer</span>
