Repository: vjrj/tails
Catalog: wiki/src/news/version_1.1.*.po
Languages: de, pt

source: [[!meta title="Tails 1.1 is out"]]
de: [[!meta title="Tails 1.1 ist da."]]
pt: [[!meta title="Tails 1.1 foi lançado"]]

source: Tails, The Amnesic Incognito Live System, version 1.1, is out.
de: Tails, The Amnesic Incognito Live System, version 1.1, ist da.
pt: Tails, o Sistema Live Incógnito e Amnésico, versão 1.1, foi lançado.

source: All users must [[upgrade|doc/first_steps/upgrade]] as soon as possible: this release fixes [[numerous security issues|security/Numerous_security_holes_in_1.0.1]].
de: Alle Benutzer sollten ihre Installation schnellstmöglich [[aktualisieren|doc/first_steps/upgrade]]: der neue Release behebt [[zahlreiche Sicherheitslücken|security/Numerous_security_holes_in_1.0.1]].
pt: Todos os/as usuários/as devem [[atualizar|doc/first_steps/upgrade]] assim que possível: esta versão conserta [[diversos problemas de segurança|security/Numerous_security_holes_in_1.0.1]].

source: Changes
de: Änderungen
pt: Mudanças

source: Notable user-visible changes include:
de: Relevante für Benutzer sichtbare Änderungen beinhalten:
pt: Mudanças notáveis e visíveis para os/as usuários/as incluem:

source: * Rebase on Debian Wheezy - Upgrade literally thousands of packages. - Migrate to GNOME3 fallback mode. - Install LibreOffice instead of OpenOffice.
de: * Migration auf Debian Wheezy - Upgrade von tausenden von Paketen. - Migration zum GNOME3 fallback Modus. - Installation von LibreOffice statt OpenOffice.
pt: * Base no Debian Wheezy - Atualização de literalmente milhares de pacotes. - Migração para modo reserva GNOME3. - Instalação do LibreOffice ao invés do OpenOffice.

source: * Major new features - UEFI boot support, which should make Tails boot on modern hardware and Mac computers. - Replace the Windows XP camouflage with a Windows 8 camouflage. - Bring back VirtualBox guest modules, installed from Wheezy backports. Full functionality is only available when using the 32-bit kernel.
de: * Wichtige neue Funktionen - Tails unterstützung vom Booten über UEFI. Dies sollte Tails erlauben auf moderner Hardware und auf Mac-Computern zu booten. - Die Windows XP Camouflage wurde durch eine Windows 8 Camouflage ersetzt. - Es gibt wieder "VirtualBox guest modules", installiert aus den Wheezy backports. Die volle Funktionalität steht nur zur Verfügung, wenn ein 32-bit Kernel benutzt wird.
pt: * Grandes novas funcionalidades - Suporte a inicialização UEFI, o que deve fazer Tails inicializar em hardwares modernos e computadores Mac. - Substituição da camuflagem Windows XP pela camuflagem Windows 8. - Traz de volta os módulos de convidado VirtualBox, instalados a partor do repositório Wheezy backports. A funcionalidade completa somente está disponível ao usar o kernel 32-bits.

source: * Security fixes - Fix write access to boot medium via udisks ([[!tails_ticket 6172]]). - Upgrade the web browser to 24.7.0esr-0+tails1~bpo70+1 (Firefox 24.7.0esr + Iceweasel patches + Torbrowser patches). - Upgrade to Linux 3.14.12-1 (fixes CVE-2014-4699). - Make persistent file permissions safer ([[!tails_ticket 7443]]).
de: * Behobene Sicherheitslücken - Fix der Schreibberechtigung auf das Boot-Medium via udisks ([[!tails_ticket 6172]]). - Aktualisieren des Webbrowsers auf 24.7.0esr-0+tails1~bpo70+1 (Firefox 24.7.0esr + Iceweasel patches + Torbrowser patches). - Aktualisieren des Kernels auf Linux 3.14.12-1 (behebt CVE-2014-4699). - Die persistenten Dateizugriffsrechte wurden sicherer gemacht ([[!tails_ticket 7443]]).
pt: * Resolução de problemas de segurança - Conserta o acesso de escrita a mídias de inicialização através de udisks ([[!tails_ticket 6172]]). - Atualiza o navegador web para 24.7.0esr-0+tails1~bpo70+1 (Firefox 24.7.0esr + Iceweasel patches + Torbrowser patches). - Atualiza para Linux 3.14.12-1 (conserta CVE-2014-4699). - Torna a permissão de arquivos persistentes mais segura ([[!tails_ticket 7443]]).

source: * Bugfixes - Fix quick search in Tails Greeter's Other languages window (Closes: [[!tails_ticket 5387]])
de: * Andere behobene Fehler - Fix der schnellen Suche im "Andere Sprachen" Fenster des Tails's Greeters (Schließt: [[!tails_ticket 5387]])
pt: * Resolução de bugs - Conserta a busca rápida na janela de Outros idiomas do Tails Greeter (Fecha: [[!tails_ticket 5387]])

source: * Minor improvements - Don't install Gobby 0.4 anymore. Gobby 0.5 has been available in Debian since Squeeze, now is a good time to drop the obsolete 0.4 implementation. - Require a bit less free memory before checking for upgrades with Tails Upgrader. The general goal is to avoid displaying "Not enough memory available to check for upgrades" too often due to over-cautious memory requirements checked in the wrapper. - Whisperback now sanitizes attached logs better with respect to DMI data, IPv6 addresses, and serial numbers ([[!tails_ticket 6797]], [[!tails_ticket 6798]], [[!tails_ticket 6804]]). - Install the BookletImposer PDF imposition toolkit.
de: * Kleinere Verbesserungen - Gobby 0.4 wurde entfernt. Gobby 0.5 ist seit Squeeze in Debian und jetzt ist ein guter Zeitpunkt um die obsolete Version 0.4 loszuwerden. - Wir verlangen im Tails Upgrader etwas weniger freien Speicherplatz bevor nach neu Aktualisierungen gesucht wird. Das Ziel ist es zu vermeiden, wegen zu vorsichtiger Speicherplatzanforderungen zu häufig einen "Nicht genügend Speicherplatz für Test nach Aktualisierungen" Fehler zu zeigen. - Whisperback säubert angehängte Logs jetzt besser in Hinblick auf DMI Daten, IPv6 Adressen und Seriennummern ([[!tails_ticket 6797]], [[!tails_ticket 6798]], [[!tails_ticket 6804]]). - Installation des BookletImposer PDF Imposition Toolkits.
pt: * Pequenas melhorias - Não instala o Gobby 0.4 mais. Gobby 0.5 está disponível no Debian desde o Squeeze, agora é um bom momento para abandonar a implementação obsoleta 0.4. - Requer um pouco menos de memória livre antes de verificar por atualizações com o Tails Upgrader. O objetivo geral é evitar mostrar "Não há memória suficiente disponível para verificar por atualizações" tão frequentemente por causa de necessidades de memória super cuidadosas verificadas no empacotador. - Whisperback agora sanitiza melhor os logs anexados com respeito a dados DMI endereços IPv6 e números de série ([[!tails_ticket 6797]], [[!tails_ticket 6798]], [[!tails_ticket 6804]]). - Instala o BookletImposer PDF imposition toolkit.

source: See the [online Changelog](https://git-tails.immerda.ch/tails/plain/debian/changelog) for technical details.
de: Technische Details finden Sie im [Changelog](https://git-tails.immerda.ch/tails/plain/debian/changelog).
pt: Veja o [Changelog online](https://git-tails.immerda.ch/tails/plain/debian/changelog) para detalhes técnicos.

source: Known issues
de: Bekannte Probleme
pt: Problemas conhecidos

source: Users of persistence must log in at least once with persistence enabled read-write after upgrading to 1.1 to see their settings updated.
de: Nutzer eines persistenten Speicherbereiches müssen sich nach dem Aktualisieren mindestens einmal mit Persistenz und Schreibberechtigung einloggen, damit Ihre Einstellungen übernommen werden können.
pt: Usuários de persistência devem logar ao menos uma vez com leitura e escrita persistente habilitada após atualizar para o 1.1 para ver suas configurações atualizadas.

source: Upgrading from ISO, from Tails 1.1~rc1, Tails 1.0.1 or earlier, is a bit more complicated than usual. Either follow <a href="#from_iso">the instructions to upgrade from ISO</a>. Or, burn a DVD, start Tails from it, and use "Clone and Upgrade".
de: Eine Aktualisierung von einem ISO-Image von Tails 1.1~rc1, Tails 1.0.1 oder früher aus, ist ein weniger komplizierter als üblich. Entweder folgen Sie <a href="#from_iso"> der Anleitung zum Aktualisieren über ein ISO-Image</a>, oder Sie brennen eine DVD, starten Tails von ihr und benutzen das übliche "Klonen und Aktualisieren".
pt: Atualizar a partir da ISO, a partir do Tails 1.1~rc1, Tails 1.0.1 ou anterior, é um pouco mais complicado que o usual. Você pode seguir <a href="#from_iso">as instruções para atualizar a partir do ISO</a>. Ou então, queime um DVD, inicie o Tails a partir dele, e use "Clonar e Atualizar".

source: The automatic upgrade from Tails 1.1~rc1 is a bit more complicated than usual. Either follow <a href="#automatic">the instructions to apply the automatic upgrade</a>. Or, do a full upgrade.
de: Die automatische Aktualisierung von Tails 1.1~rc1 aus ist ein wenig komplizierter als üblich. Entweder folgen Sie <a href="#automatic">der Anleitung zum Anwenden der automatischen Aktualisierungen</a>, oder sie machen eine vollständige Aktualisierung.

source: A persistent volume created with Tails 1.1~beta1 cannot be used with Tails 1.1 or later. Worse, trying this may freeze Tails Greeter.
de: Ein persistenter Speicherbereich, der mit Tails 1.1~beta1 erzeugt wurde, kann nicht mit Tails 1.1 oder späteren Versionen benutzt werden. Schlimmer noch, der Versuch dies zu tun kann den Tails Greeter einfrieren.
pt: Volumes persistentes criados com Tails 1.1~beta1 não podem ser usados com Tails 1.1 ou mais novo. E ainda pior: tentar fazê-lo pode travar o Tails Greeter.

source: Tails 1.1 does not start in some virtualization environments, such as QEMU 0.11.1 and VirtualBox 4.2. This can be corrected by upgrading to QEMU 1.0 or VirtualBox 4.3, or newer ([[!tails_ticket 7232]]).
de: Tails 1.1 kann in einigen virtualisierungs Umgebungen, wie etwa QEMU 0.11.1 und VirtualBox 4.2, nicht starten. Das Problem kann durch einen Umstieg auf QEMU 1.0 oder VirtualBox 4.3 oder umgangen werden ([[!tails_ticket 7232]]).
pt: Tails 1.1 não inicia em alguns ambientes de virtualização, como QEMU 0.11.1 e VirtualBox 4.2. Isto pode ser corrigido atualizando para o QEMU 1.0 ou VirtualBox 4.3 ou mais novos ([[!tails_ticket 7232]]).

source: The web browser's JavaScript performance may be severely degraded ([[!tails_ticket 7127]]). Please let us know if you are experiencing this to a level where it is problematic.
de: Die Performance der JavaScript Engine im Browser könnte nennenswert verschlechtert worden sein ([[!tails_ticket 7127]]). Teilen Sie uns bitte mit, falls dies bei Ihnen ein Problem ist.
pt: O desempenho do JavaScript do navegador web pode ser muito ruim ([[!tails_ticket 7127]]). Por favor, avise-nos se você estiver experienciando isto em um nível problemático.

source: [[Longstanding|support/known_issues]] known issues.
de: [[Schon länger bekannte|support/known_issues]] Probleme.
pt: Problemas conhecidos [[há bastante tempo|support/known_issues]].

source: I want to try it or to upgrade!
de: Ich möchte Tails ausprobieren oder aktualisieren!
pt: Quero experimentar ou atualizar!

source: Go to the [[download]] page.
de: Gehen Sie zu der [[Download|download]]-Seite.
pt: Vá para a página de [[download]].

source: As no software is ever perfect, we maintain a list of [[problems that affects the last release of Tails|support/known_issues]].
de: Da keine Software jemals perfekt ist, führen wir eine Liste von [[Problemen, die den letzten Tails Release betreffen|support/known_issues]].
pt: Como nenhum software é perfeito, mantemos uma lista de [[problemas que afetam a última versão do Tails|support/known_issues]].

source: What's coming up?
de: Was passiert als nächstes?
pt: O que está por vir?

source: The next Tails release is [[scheduled|contribute/calendar]] for September 2.
de: Das nächste Tails Release ist für den 2. September [[geplant|contribute/calendar]]
pt: A próxima versão do Tails está [[agendada|contribute/calendar]] para 2 de setembro.

source: Have a look to our [[!tails_roadmap]] to see where we are heading to.
de: Werfen Sie einen Blick auf unsere [[!tails_roadmap desc="Roadmap"]], um zu sehen worauf wir zusteuern.
pt: Dê uma olhada em nosso [[!tails_roadmap]] para ver para onde estamos rumando.

source: How to upgrade from ISO?
de: Aktualisierung über ein ISO-Abbild.
pt: Como atualizar a partir da ISO?

source: These steps allow you to upgrade a device installed with <span class="application">Tails Installer</span> from Tails 1.0.1, Tails 1.1~beta1 or earlier, to Tails 1.1.
de: Die folgenden Schritte erlauben es Ihnen, ein mit dem <span class="application">Tails Installer</span> installiertes Medium (in Tails 1.0.1, Tails 1.1~beta1 oder früher) auf Tails 1.1 zu aktualisieren.
pt: Estes passos te permitem atualizar um disco instalado com <span class="application">Tails Installer</span> a partir do Tails 1.0.1, Tails 1.1~beta1 ou mais antigo, para o Tails 1.1.

source: Start Tails from another DVD, USB stick, or SD card, than the device that you want to upgrade.
de: Starten Sie Tails von einer DVD, oder von einem anderen USB-Stick oder einer anderen SD-Karte, als der, die Sie aktualisieren wollen.
pt: Inicie o Tails a partir de um outro DVD, memória USB ou cartão SD, que não seja o dispositivo que você quer atualizar.

source: [[Set an administration password|doc/first_steps/startup_options/administration_password]].
de: [[Setzen Sie eine Administratoren-Passwort|doc/first_steps/startup_options/administration_password]].
pt: [[Configure uma senha administrativa|doc/first_steps/startup_options/administration_password]].

source: Run this command in a <span class="application">Root Terminal</span> to install the latest version of <span class="application">Tails Installer</span>:
de: Führen Sie das folgende Kommando in einem <span class="application">Root Terminal</span> aus, um die neueste Version des <span class="application">Tails Installer</span> zu installieren:
pt: Execute este comando em um <span class="application">Terminal como Root</span> para instalar a versão mais recente do <span class="application">Tails Installer</span>:

source: How to automatically upgrade from Tails 1.1~rc1?
de: Automische Aktualisierung von Tails 1.1~rc1 aus.

source: These steps allow you to automatically upgrade a device installed with <span class="application">Tails Installer</span> from Tails 1.1~rc1 to Tails 1.1.
de: Die folgenden Schritte erlauben es Ihnen ein in Tails 1.1~rc1 mit dem <span class="application">Tails Installer</span> installiertes Medium auf Tails 1.1 zu aktualisieren.

source: Start Tails 1.1~rc1 from the device you want to upgrade.
de: Starten Sie Tails 1.1~rc1 von dem Medium, das Sie aktualisieren wollen aus.

source: Run this command in a <span class="application">Terminal</span> to apply the automatic upgrade:
de: Führen Sie das folgende Kommando in einem <span class="application">Terminal</span> aus, um die automatischen Aktualisierungen anzuwenden.

source: Do you want to help? There are many ways [[**you** can contribute to Tails|contribute]]. If you want to help, come talk to us!
pt: Você quer ajudar? Há muitas formas de [[**você** contribuir com o Tails|contribute]]. Se você quer ajudar, venha falar conosco!
