Repository: vjrj/tails
Catalog: wiki/src/news/version_1.2.*.po
Languages: de

source: [[!meta title="Tails 1.2 is out"]]
de: [[!meta title="Tails 1.2 wurde veröffentlicht"]]

source: Tails, The Amnesic Incognito Live System, version 1.2, is out.
de: Version 1.2 von Tails, dem Amnesic Incognito Live System, ist erschienen

source: This release fixes [[numerous security issues|security/Numerous_security_holes_in_1.1.2]] and all users must [[upgrade|doc/first_steps/upgrade]] as soon as possible.
de: Diese Version behebt [[zahlreiche Sicherheitslücken|security/Numerous_security_holes_in_1.1.2]] und alle Benutzer sollten so schnell wie möglich [[aktualisieren|doc/first_steps/upgrade]].

source: Changes
de: Änderungen

source: Notable user-visible changes include:
de: Bemerkbare, für den Benutzer sichtbare Änderungen umfassen:

source: * Major new features - Install (most of) the Tor Browser, replacing our previous Iceweasel-based browser. The version installed is from TBB 4.0 and is based on Firefox 31.2.0esr. This fixes the POODLE vulnerability. - Upgrade Tor to 0.2.5.8-rc. - Confine several important applications with AppArmor.
de: * Wichtige neue Funktionen - Installation (von grossen Teilen) des Tor Browsers, der unseren vorherigen, auf Iceweasel basierenden Browser ersetzt. Die installierte Version stammt vom TBB 4.0 ab und basiert auf Firefox 31.2.0esr. Dies behebt die POODLE Schwachstelle. - Aktualisierung auf Tor 0.2.5.8-rc. - Beschränkung mehrerer wichtiger Programme durch AppArmor.

source: * Bugfixes - Install Linux 3.16-3 (version 3.16.5-1).
de: * Bugfixes - Installation von Linux 3.16-3 (Version 3.16.5-1).

source: * Minor improvements - Upgrade I2P to 0.9.15, and isolate I2P traffic from the Tor Browser by adding a dedicated I2P Browser. Also, start I2P automatically upon network connection, when the `i2p` boot option is added. - Make it clear that *TrueCrypt* will be removed in Tails 1.2.1 ([[!tails_ticket 7739]]), and document how to open *TrueCrypt* volumes with `cryptsetup`. - Enable VirtualBox guest additions by default ([[!tails_ticket 5730]]). In particular this enables VirtualBox's display management service. - Make the OTR status in Pidgin clearer thanks to the formatting toolbar ([[!tails_ticket 7356]]). - Upgrade syslinux to 6.03-pre20, which should fix UEFI boot on some hardware.
de: * Kleinere Verbesserungen - Aktualisierung von I2P auf Version 0.9.15 und Isolierung des I2P-Datenverkehrs vom Tor Browser durch Hinzufügen eines eigenen I2P-Browsers. Zudem kann I2P automatisch beim Systemstart gestartet werden werden, wenn die "I2P Boot"-Option aktivier ist. - Klarstellung, dass *TrueCrypt* in Tails 1.2.1 entfernt wird ([[!tails_ticket 7739]]) und Dokumentation wie man *TrueCrypt*-Datenträger mit 'crypsetup' öffnet. - Standardmäßige Aktivierung von VirtualBox Gastergänzungen ([[!tails_ticket 5730]]). Inbesondere aktiviert dies die VirtualBox Verwaltungsdienste. - Den OTR Status in Pidgin in der Symbolleiste deutlicher kennzeichnen ([[!tails_ticket 7356]]). - Aktualisierung von Syslinux auf 6.03-pre20. Dies sollte das Starten mit UEFI auf mancher Hardware ermöglichen.

source: See the [online Changelog](https://git-tails.immerda.ch/tails/plain/debian/changelog) for technical details.
de: Sehen Sie für technische Details ins [Changelog](https://git-tails.immerda.ch/tails/plain/debian/changelog).

source: Known issues
de: Bekannte Probleme

source: Tor Browser is translated in [[15 languages only|support/known_issues#browser_languages]].
de: Der Tor Browser ist in [[15 Sprachen|support/known_issues#browser_languages]] übersetzt.

source: [[Longstanding|support/known_issues]] known issues.
de: [[Längerfristige|support/known_issues]] bekannte Probleme.

source: I want to try it or to upgrade!
de: Ich will es ausprobieren oder aktualisieren!

source: Go to the [[download]] page.
de: Gehen Sie zur [[Download|download]]-Seite.

source: As no software is ever perfect, we maintain a list of [[problems that affects the last release of Tails|support/known_issues]].
de: Da keine Sofware perfekt ist, pflegen wir eine Liste der [[Probleme, die die letzte Version von Tails betreffen|support/known_issues]].

source: What's coming up?
de: Was kommt als Nächstes?

source: The next Tails release is [[scheduled|contribute/calendar]] for November 25.
de: Die nächste Version von Tails ist für den 25. November [[geplant|contribute/calendar]].

source: Have a look to our [[!tails_roadmap]] to see where we are heading to.
de: Werfen Sie einen Blick auf den [[Tails-Fahrplan|tails_roadmap]] um zu sehen, wohin es geht.

source: Do you want to help? There are many ways [[**you** can contribute to Tails|contribute]]. If you want to help, come talk to us!
de: Wollen Sie mithelfen? Es gibt viele Möglichkeiten, mit denen [[**Sie** zu Tails beisteuern|contribute]] können. Wenn Sie helfen wollen, sprechen Sie uns an!
