Repository: vjrj/tails
Catalog: wiki/src/news/version_0.23.*.po
Languages: fr

source: [[!meta title="Tails 0.23 is out"]]
fr: [[!meta title="Tails 0.23 est sorti"]]

source: Tails, The Amnesic Incognito Live System, version 0.23, is out.
fr: Tails, The Amnesic Incognito Live System, version 0.23 est sorti.

source: All users must upgrade as soon as possible: this release fixes [[numerous security issues|security/Numerous_security_holes_in_0.22.1]].
fr: Tous les utilisateurs doivent le mettre à jour dès que possible : cette version corrige de [[nombreux problèmes de sécurité|security/Numerous_security_holes_in_0.22.1]].

source: Changes
fr: Changements

source: Notable user-visible changes include:
fr: Les changements notables visibles pour l'utilisateur comprennent :

source: * Security fixes - Upgrade the web browser to 24.4.0esr-0+tails1~bpo60+1 (Firefox 24.4.0esr + Iceweasel patches + Torbrowser patches).
fr: * Sécurité - Mise à jour du navigateur web vers la version 24.4.0esr-0+tails1~bpo60+1 (Firefox 24.4.0esr + patches Iceweasel + patches Torbrowser).

source: * Major new features - [[Spoof the network interfaces' MAC address|doc/first_steps/startup_options/mac_spoofing]] by default. It can be disabled in Tails Greeter. - Rework the way to [[configure how Tor connects to the network|doc/first_steps/startup_options/network_configuration]] by using bridges, proxies and restrictive firewalls. This option can be set from Tails Greeter, and replaces the old experimental "bridge mode" feature.
fr: * Nouvelles fonctionnalités majeures - [[Usurpation des adresses MAC des interfaces réseau|doc/first_steps/startup_options/mac_spoofing]] par défaut. Cela peut être désactivé dans le Tails Greeter. - Refonte de la manière de [[configurer comment Tor se connecte au réseau|doc/first_steps/startup_options/network_configuration]] en utilisant des bridges, des proxys et des pare-feu restrictifs. Cette option peut être activée depuis Tails Greeter, et remplace l'ancienne fonctionnalité expérimentale de "mode bridge".

source: * Bugfixes - Additional software: do not crash when persistence is disabled. - Upgrade Pidgin to 2.10.9, that fixes some regressions introduced in the 2.10.8 security update. - Wait for Tor to have fully bootstrapped, plus a bit more time, before checking for upgrades and unfixed known security issues. - Disable the Intel Management Engine Interface driver. We don't need it in Tails, it might be dangerous, and it causes bugs on various hardware such as systems that reboot when asked to shut down. - Add a launcher for the Tails documentation. This makes it available in Windows Camouflage mode. - Remove the obsolete wikileaks.de account from Pidgin.
fr: * Corrections de bugs - Logiciels additionnels : ne plante plus quand la persistance est désactivée. - Mise à jour de Pidgin vers la version 2.10.9, corrigeant quelques régressions introduites dans les mises à jour de sécurité de la version 2.10.8. - Attente que Tor soit complètement opérationnel, et un peu plus, avant de vérifier si des mises à jours et des trous de sécurité non corrigés existent. - Désactivation du driver Intel Management Engine Interface. Nous n'en avons pas besoin dans Tails, il peut être dangereux et cause des bugs sur différent matériel comme par exemple redémarrer lors de l'extinction. - Ajout d'un lanceur pour la documentation de Tails. Cela le rend disponible dans le mode Camouflage Windows. - Suppression du compte Pidgin wikileaks.de obsolète.

source: See the [online Changelog](https://git-tails.immerda.ch/tails/plain/debian/changelog) for technical details.
fr: Voir le [journal des modifications](https://git-tails.immerda.ch/tails/plain/debian/changelog) pour les détails techniques.

source: Known issues
fr: Problèmes connus

source: [[Longstanding|support/known_issues]] known issues.
fr: Problèmes connus de [[longue date|support/known_issues]].

source: I want to try it or to upgrade!
fr: Je veux l'essayer ou le mettre à jour !

source: Go to the [[download]] page.
fr: Aller à la page de [[téléchargement|download]].

source: As no software is ever perfect, we maintain a list of [[problems that affects the last release of Tails|support/known_issues]].
fr: Comme aucun logiciel n'est parfait, nous maintenons une liste des [[problèmes qui affectent la dernière version de Tails|support/known_issues]].

source: What's coming up?
fr: Et après ?

source: The next Tails release is [[scheduled|contribute/calendar]] for April 29.
fr: La prochaine version de Tails est [[prévue|contribute/calendar]] pour le 19 avril.

source: Have a look to our [[!tails_roadmap]] to see where we are heading to.
fr: Jetez un œil à notre [[!tails_roadmap desc="feuille de route"]] pour voir vers où nous allons.

source: Would you want to help? There are many ways [[**you** can contribute to Tails|contribute]]. If you want to help, come talk to us!
fr: Vous voulez aider ? Il y a de nombreuses façons pour [[**vous** de contribuer|contribute]]. Si vous souhaitez aider, venez nous en parler !
