Repository: vjrj/tails
Catalog: wiki/src/news/version_1.0.1.*.po
Languages: pt

source: [[!meta date="Tue Jun 10 12:00:00 2014"]]
pt: [[!meta date="Ter Jun 10 12:00:00 2014"]]

source: [[!meta title="Tails 1.0.1 is out"]]
pt: [[!meta title="Lançado o Tails 1.0.1"]]

source: Tails, The Amnesic Incognito Live System, version 1.0.1, is out.
pt: A versão 1.0.1 do Tails, o Sistema Live Incógnito e Amnésico, foi lançada.

source: All users must [[upgrade|doc/first_steps/upgrade]] as soon as possible: this release fixes [[numerous security issues|security/Numerous_security_holes_in_1.0]].
pt: Todos/as usuários/as devem [[atualizar|doc/first_steps/upgrade]] o quanto antes: esta versão corrige [[vários problemas de segurança|security/Numerous_security_holes_in_1.0]].

source: Changes
pt: Mudanças

source: Notable user-visible changes include:
pt: Mudanças facilmente perceptíveis para o/a usuário/a incluem:

source: * Security fixes - Upgrade the web browser to 24.6.0esr-0+tails1~bpo60+1 (Firefox 24.6.0esr + Iceweasel patches + Torbrowser patches). - Install Linux 3.14 from Debian unstable (fixes CVE-2014-3153 and others). - Install openssl from Squeeze LTS (fixes CVE-2014-0076, CVE-2014-0195, CVE-2014-0221, CVE-2014-3470 and CVE-2014-0224). - Install GnuTLS from Squeeze LTS (fixes CVE-2014-3466).
pt: * Correções de segurança - Navegador de internet atualizado para 24.6.0esr-0+tails1~bpo60+1 (Firefox 24.6.0esr + patches do Iceweasel + patches do browser Tor ). - Instalado Kernel Linux 3.14 a partir do Debian unstable (correções CVE-2014-3153 e outras). - Instalado openssl a partir do Squeeze LTS (correções CVE-2014-0076, CVE-2014-0195, CVE-2014-0221, CVE-2014-3470 e CVE-2014-0224). - Instalado GnuTLS a partir do Squeeze LTS (correções CVE-2014-3466).

source: * Minor improvements - Upgrade Tor to 0.2.4.22-1~d60.squeeze+1. - Upgrade I2P to 0.9.13-1~deb6u+1.
pt: * Pequenas melhorias - Tor atualizado para 0.2.4.22-1~d60.squeeze+1. - I2P atualizado para 0.9.13-1~deb6u+1.

source: See the [online Changelog](https://git-tails.immerda.ch/tails/plain/debian/changelog) for technical details.
pt: Veja o [Changelog online](https://git-tails.immerda.ch/tails/plain/debian/changelog) para detalhes técnicos.

source: Known issues
pt: Problemas conhecidos

source: [[Longstanding|support/known_issues]] known issues.
pt: Problemas [[duradouros|support/known_issues]] conhecidos.

source: I want to try it or to upgrade!
pt: Eu gostaria de experimentar ou de atualizar!

source: Go to the [[download]] page.
pt: Vá para a página de [[download]].

source: As no software is ever perfect, we maintain a list of [[problems that affects the last release of Tails|support/known_issues]].
pt: Como nenhum software é totalmente perfeito, nós mantemos uma lista de [[problemas que afetam a última versão lançada do Tails|support/known_issues]].

source: What's coming up?
pt: O que está por vir?

source: The next Tails release is [[scheduled|contribute/calendar]] for July 22.
pt: A próxima versão do Tails está [[agendada|contribute/calendar]] para 22 de Julho.

source: Have a look to our [[!tails_roadmap]] to see where we are heading to.
pt: Dê uma olhada em nosso [[!tails_roadmap]] e veja para onde estamos caminhando .

source: Would you want to help? There are many ways [[**you** can contribute to Tails|contribute]]. If you want to help, come talk to us!
pt: Você gostaria de ajudar? Existem muitas maneiras de [[**você** contribuir com o Tails|contribute]]. Se você quer ajudar, venha falar com a gente!
