Repository: vjrj/tails
Catalog: wiki/src/news/version_1.2.3.*.po
Languages: de

source: [[!meta title="Tails 1.2.3 is out"]]
de: [[!meta title="Tails 1.2.3 wurde veröffentlicht"]]

source: Tails, The Amnesic Incognito Live System, version 1.2.3, is out.
de: Version 1.2.3 von Tails, dem Amnesic Incognito Live System, ist erschienen.

source: This release fixes [[numerous security issues|security/Numerous_security_holes_in_1.2.2]] and all users must [[upgrade|doc/first_steps/upgrade]] as soon as possible.
de: Diese Version behebt [[zahlreiche Sicherheitslücken|security/Numerous_security_holes_in_1.2.2]] und alle Benutzer sollten so schnell wie möglich [[aktualisieren|doc/first_steps/upgrade]].

source: On January 3rd, the SSL certificate of our website hosting provider, boum.org, expired. This means that if you still are running Tails 1.2.1 or older, you will not get any update notification. Please help spreading the word!
de: Am 3. Januar ist das SSL Zertifikat des Hosters unserer Webseite, boum.org, abgelaufen. Falls Sie Nutzer von Tails 1.2.1 oder einer noch früheren Version sind, bekommen Sie dadurch **keine** Benachrichtigung über die neue Version. Bitte helfen Sie diese Information zu verbreiten!

source: Changes
de: Änderungen

source: * Security fixes - Upgrade to Linux 3.16.7-ckt2-1. - Upgrade to Tor Browser 4.0.3 (based on Firefox 31.4.0esr) ([[!tails_ticket 8700]]). - Improve MAC spoofing fail-safe mechanisms, which includes preventing one more way the MAC address could be leaked. ([[!tails_ticket 8571]]). - Disable upgrade checking in the Unsafe Browser. Until now the Unsafe Browser has checked for upgrades of the Tor Browser in the clear ([[!tails_ticket 8694]]).
de: * Behobene Sicherheitslücken - Aktualisierung auf Linux 3.16.7-ckt2-1. - Aktualisierung auf Tor Browser 4.0.3 (basierend auf Firefox 31.4.0esr) ([[!tails_ticket 8700]]). - Verbesserung des Sicherungssystems bei der Verschleierung von MAC-Adressen. Dadurch wird eine weitere Möglichkeit, MAC-Adressen zu enthüllen, verhindert. ([[!tails_ticket 8571]]). - Deaktivierung der Suche nach Aktualisierungen im ungesicherten Browser. Bisher hat der ungesicherte Browser im Klartext nach Aktualisierungen für den Tor Browser geprüft ([[!tails_ticket 8694]]).

source: * Bugfixes - Fix startup of the Unsafe Browser in some locales ([[!tails_ticket 8693]]). - Repair the desktop screenshot feature ([[!tails_ticket 8087]]). - Do not suspend to RAM when closing the lid on battery power ([[!tails_ticket 8071]]). - Properly update the Tails Installer's status when plugging in a USB drive after it has started ([[!tails_ticket 8353]]).
de: * Bugfixes - Korrektur des Starts des ungesicherten Browsers in einigen locales ([[!tails_ticket 8693]]). - Reparatur der Funktion zur Erstellung von Screenshots ([[!tails_ticket 8087]]). - Tails geht beim Schließen des Notebookdeckels im Batteriebetrieb nicht mehr in den Standby-Modus ([[!tails_ticket 8071]]). - Korrekte Statusaktualisierung des Tails Installers, wenn ein USB-Medium während einer Installation eingesteckt wird ([[!tails_ticket 8353]]).

source: See the [online Changelog](https://git-tails.immerda.ch/tails/plain/debian/changelog) for technical details.
de: Technische Details finden Sie im [Changelog](https://git-tails.immerda.ch/tails/plain/debian/changelog).

source: Known issues
de: Bekannte Probleme

source: It is [[hard to exchange files with the I2P Browser|support/known_issues#i2p_browser]].
de: Es ist schwierig [[Dateien mit dem I2P Browser auszutauschen|support/known_issues#i2p_browser]].

source: [[Longstanding|support/known_issues]] known issues.
de: [[Längerfristige|support/known_issues]] bekannte Probleme.

source: I want to try it or to upgrade!
de: Ich möchte Tails ausprobieren oder aktualisieren!

source: Go to the [[download]] page.
de: Gehen Sie zur [[Download|download]]-Seite.

source: As no software is ever perfect, we maintain a list of [[problems that affects the last release of Tails|support/known_issues]].
de: Da keine Sofware perfekt ist, pflegen wir eine Liste der [[Probleme, die die letzte Version von Tails betreffen|support/known_issues]].

source: What's coming up?
de: Was kommt als Nächstes?

source: The next Tails release is [[scheduled|contribute/calendar]] for February 24.
de: Die nächste Version von Tails ist für den 24. Februar [[geplant|contribute/calendar]].

source: Have a look at our [[!tails_roadmap]] to see where we are heading to.
de: Werfen Sie einen Blick auf den [[Tails-Fahrplan|tails_roadmap]] um zu sehen, was wir als Nächstes vorhaben.

source: Do you want to help? There are many ways [[**you** can contribute to Tails|contribute]]. If you want to help, come talk to us!
de: Möchten Sie helfen? Es gibt viele Möglichkeiten, mit denen [[**Sie** zu Tails beisteuern|contribute]] können. Wenn Sie uns helfen möchten, sprechen Sie uns an!"
