Repository: vjrj/tails
Catalog: wiki/src/support/tails-support.*.po
Languages: pt

source: [[!meta title="Tails user support mailing list"]]
pt: [[!meta title="Lista de emails de suporte ao usuário/a Tails"]]

source: This list is **the right place** for:
pt: Esta lista é **o local correto** para:

source: **User support**: solving doubts about how to use Tails, security implications of Tails, etc.
pt: **Suporte ao usuário/a**: resolver dúvidas sobre como usar Tails, implicações de segurança do uso de Tails, etc.

source: **Community interaction**: information and tricks about ways of using Tails that are not officially documented but might be of interest to others.
pt: **Interação com a comunidade**: informações e truques sobre formas de usar Tails que não estão oficialmente documentadas, mas que podem ser de interesse para os outros.

source: **Small issues**: pointing out small things that we needed to fix and do not require a complete bug report. That's fine and we appreciate it.
pt: **Pequenos problemas**: apontar pequenas coisas que precisamos consertar e que não necessitam de um relatório de bug completo. Não há problema em fazê-lo e nós agradecemos.

source: This list is **the wrong place** for:
pt: Esta lista é **o local errado** para:

source: **Bug reports**: see the [[bug reporting documentation|/doc/first_steps/bug_reporting]] instead.
pt: **Relato de bugs**: veja nossa [[documentação sobre relato de bugs|/doc/first_steps/bug_reporting]] para isto.

source: **Feature requests**: those should be done on the development mailing list: [tails-dev@boum.org](https://mailman.boum.org/listinfo/tails-dev/).
pt: **Pedidos de funcionalidades**: estes devem ser enviados para a lista de desenvolvimento: [tails-dev@boum.org](https://mailman.boum.org/listinfo/tails-dev/).

source: **Computer security essays and conspiranoia** not directly related to Tails.
pt: **Ensaios sobre segurança da informação e conspiranóias** não diretamente relacionados ao Tails.

source: Subscribe
pt: Inscreva-se

source: <form method="POST" action="https://mailman.boum.org/subscribe/tails-support"> <input class="text" name="email" value=""/> <input class="button" type="submit" value="Subscribe"/> </form>
pt: <form method="POST" action="https://mailman.boum.org/subscribe/tails-support"> <input class="text" name="email" value=""/> <input class="button" type="submit" value="Inscrever"/> </form>

source: Archiving policy
pt: Política de arquivamento

source: No archive of the content of this mailing list is kept. We believe this can be help reducing the impact of a posteriori analysis of sensitive information that might be sent to the list by mistake.
pt: Nenhum arquivo do conteúdo desta lista de emails é guardado. Nós acreditamos que isto pode ajudar a reduzir o impacto de uma análise posterior de informações sensíveis que podem ter sido enviadas para a lista por engano.
